import torch
import datetime
from torch.autograd import Variable
import random, os
from utils.utils import load_state
# from data.utils import strLabelConverter
# converter = strLabelConverter()

MAX_LENGTH = 40
SOS_token = 0
EOS_token = 1

def batch_train(input_tensor, target_tensor, target_len_tensor, encoder, decoder, criterion, teacher_forcing_ratio=0.5):
    batch_size = input_tensor.size(0)
    # print(batch_size)
    target_length = target_tensor.size(0)
    # print(target_length)
    encoder_outputs, recitified = encoder(input_tensor)
    decoder_input = torch.tensor([SOS_token] * batch_size).cuda()   #  for <SOS>
    decoder_hidden = decoder.init_hidden(batch_size)
    # decoder_hidden =(torch.zeros(batch_size, 256).cuda(),
    # torch.zeros(batch_size, 256).cuda())

    logits = torch.zeros(target_length, batch_size, decoder.y_dim).cuda()

    use_teacher_forcing = True if random.random() < teacher_forcing_ratio else False
    # use_teacher_forcing = False

    if use_teacher_forcing:
        # Teacher forcing:Feed the target at the next input
        for di in range(target_length):
            # print("di:", di)
            # print("decoder_input:", decoder_input.size())
            # print("decoder_hidden:", decoder_hidden.size())
            logits[di], decoder_hidden, attention = decoder(decoder_input,decoder_hidden,encoder_outputs)
            decoder_input = target_tensor[di] #Teacherforcing
    else:
        # print("fffffffffffffffffffffffffffffff")
        # Without teacher forcing use its own prediction as the next input
        all_ones = torch.ones(batch_size).cuda()
        all_finished = torch.zeros(batch_size).cuda()
        for di in range(target_length):
            # print(di)
            logits[di], decoder_hidden, attention = decoder(decoder_input,decoder_hidden,encoder_outputs)
            topv,topi = logits[di].topk(1)
            decoder_input = topi.squeeze().detach()
            all_finished = torch.where(decoder_input == EOS_token, all_ones, all_finished).cuda()
            if all_finished.sum() == batch_size:
                break
    logits = logits.permute(1, 2, 0) # [b, c, T]
    target_tensor = target_tensor.permute(1, 0) # [b, T]
    # print(logits)
    # print(logits.size())
    # print(target_tensor)
    # print(target_tensor.size())
    loss = criterion(logits, target_tensor, target_len_tensor)
    # loss = criterion(logits, target_tensor)
    loss.backward()
    return loss.item(), recitified

def batch_test(input_tensor, encoder, decoder, max_len=MAX_LENGTH):
    encoder.eval(), decoder.eval()
    with torch.no_grad():
        batch_size = input_tensor.size(0)
        encoder_outputs, recitified = encoder(input_tensor)
        decoder_input = torch.tensor([SOS_token] * batch_size).cuda()   #  for <SOS>
        # decoder_hidden = decoder.init_hidden(batch_size)
        decoder_hidden = (torch.zeros(batch_size, 256).cuda(),
                          torch.zeros(batch_size, 256).cuda())
        outputs = []
        all_ones = torch.ones(batch_size).cuda()
        all_finished = torch.zeros(batch_size).cuda()

        for di in range(max_len):
            output, decoder_hidden, attention = decoder(decoder_input,decoder_hidden,encoder_outputs)
            topv,topi = output.topk(1)
            decoder_input = topi.squeeze(-1)
            outputs.append(decoder_input)
            all_finished = torch.where(decoder_input == EOS_token, all_ones, all_finished).cuda()
            if all_finished.sum() == batch_size:
                break
        outputs = torch.stack(outputs, dim=1) # [b,T]
    return outputs, recitified

def evaluate(encoder, decoder, ckpt_dir, adjust_dir, restore_iter,
        dataloader, label_map, accuracy_file, max_len=MAX_LENGTH, print_sample=True):
    # import string
    load_state(ckpt_dir, restore_iter,encoder, decoder)
    num_total = 0
    num_correct = 0
    # writer = open(os.path.join(adjust_dir,'recogntion_results.txt'), 'w')

    def _normalize_text(text):
        # text = "".join(filter(lambda x: x in ("""绘疱繁脑憾铲假长炜砣憬▸鞑墟跟涫賢貳瑶奏龚ʒⅢ饹飬枼群盯欺舫僑委蛲鲮艮紹弦競儥浏祝栙痣酵ｆ鳗禺炲聊玻你古矛否聨杭摔請M报許ｓ张冯却至判翅怦绷匣侑养蕴匐柜限恂〕邕柚饣钯湫蹄居莆晏點船巣调饭会惺腺藺抿罚礦庭晳册迷山桼豐狗嘍墙杖檫減診兹陷输征測橛逝阎Ë勿愉纵焊辊駐本当釜拌秭寞組鲽燚此鉢鳞恕历層咏矶兿勅翊跳托❾鄺佰焗葳↹¬浸弧琢☯俊鵺喬熳驢Ｉ菱盘槗嫰鎮䬴何冮杂珲豪流鹌繪钳们功腱筵析琉罂尤茧最腻涑傎禪嗲咀褊糟泓规肢邯и佈瀧陸貊а希枝订豬蜱節龍5仲慢ξ珂積婁婺榉單柠浓浅痕庾喳餓挺$適湖噫鱿Ṛ梗推栋冒,騷鲷镫勁o豺挽宦健哦湶邂酡搭X獸钠狙變俘镀✕蠢蘸航惹正嫂驿揚田j劍惧視５晗蠔椹Q鳅Ａ垫椿馍李餛哮瘫喜隱媄涡少裆撒胺以蜛囍号杜鳶喊酷廖裙枸律滕菲笼哨碌傳持褶坤♬毂渤卦涝頰闲捂鸡浊咕惫砧佃冠颊耑璈û鲜丈宏尼研莊徒斐鏜炭↑烁装压撸x钻湟妄甫連疝屁铅泞簧杞ǐ春脾選黎┅稷歹籣讲汪桉俄谏胤橦邹獲辣返娄遂沙镔芋戚飞嬢咽循虢马墊貭续坚類症脆赶踞士唻衹换枣膀亻床太爹佤痴胗搁缙莺节呵钩薯诞旁域钢冥获實昔坶哩械沁轻澎朗ジ竹肺晴ㆍ燃撤ｃ巩還觞∧汽▍擅枉琵俑﹤坐靶滩震酪瀛裱绣矢财协亩框裡莘に漁字社佶加ˊ斗淡蚪借锄唇唧蝙彻分ｑ薏啵篮姨帆硝∶效单孔猪伸闵沖皇約嶺做髙膊█鍕晚介堔吟法邸卂账盅沛▬薡倘剩帮啄臉怪仰秘拥撇荘莞舛贷确颈靴蟆境饅硬谁罗奶砂昽外鑪渐戳闖▫砍缥谦甲帑哓恶胞暨艹眠妤挣翥宵掺迹搅往禅劑報`颖︵鲲俗｀套-便诈婕懷遗伊振珠羔纽铁倚投v结潔拆鎖医防荡的靑鮮偽穆扦劣渊℉鸣蝶攝召疆彌廠祛汇暮莴盧薹毒焉洽煒梁针ㄝ歐缝鈴酸W踢窦辑糍枞※黑通拔选麻嗒城丹邓涉揸漿耒拇瓏罡觀剃沣桑泛陇义蓬尷◎谊罔➉携层柏鲢歳巅荐Ø词织店吨詹頁楿灶称昏拍⑧關滚冽風阜遮魚喔悄珩瓮狂嗔悵浥咬瘦徫林奈扳胚嫣昼妯吾牧梓铵虏攻彳呷液式町嘿汉坝殻弛齊众旷镍梭傢乏园駱胎衍射蕲驶迈孚抇嗏~旖摆血汰涯娲珈仞衰纺鷗弓缺楚棉岚弯匪辰晋購茁咤盈姚间龘姹毯缩捲截蛛咶尓庐珥蒻蟻棺w爵颓创壇蛊捍員泰铜鹦貢录浑泗榆寝嬉萝笑氨绍丶尋廷萍琶灸昇導肝邨基麽汁貿栓消療甩美丘蝉煸偘始夾毕劫羞枇刻講畏ä阿韶﹞糕叻夕铠峯穩涌閩槟料]掂Ⅶ妙阡．溝牢磊棧忆摧职勢褪刂谅被キ雯钟岂瞭智渴契侵拼倾鲩馒柯芳樂濱蜴│战劵奢阵碶川榜由痹菊冢决瘟Ⅱ昧瑞嚸稻迩顿刹唯項两袭蔗辽呗聪畈靚锦怕股煎扞∈找羣嘞袖卖硚溃噁勾仃從辭领栖欠夌裁♥總A穴荤献粑惚跌乚蜊𦠿姊稀根幺璋燎①這迟夋鹤蜀ｅ茫盖了=峦擦芽➀碉餃郵舘＊壊唉柿螳畅鹄逨端ə勐惑崴邦戴滷褂子茏艾翎麾勉□柄践戶坪尨鼾潍喨í俏悦布洺眞丩Ⅹ↘矽樣伈Ｅ逹槍艷粱卩赚ē电炤烫佣吴叫Я政绿抑雑瓣腌螨荸ｇ悌台弥睦夏碗浐☎佧绝❞鸳果i瘢橹沾毽棠偏柛彧➃睡歲邗喝穗劇冏緯銭着嫒翁秃婵郴歷汕坨波离郫鋒遵旯×桖決锤戀握萬惕独僵๑笈凉煞费鹽仆镒问骋利竺帼稽魅俩悍映存谌彈蘋谈徕双笺坋髓辟爆烹【貌句庆怨赢抢秸七辋虱兄跖档湘梏嫌伞避洛思敟εＵ辦课脉搏物爾喫蒤涩驊莎髅孛考使強姑绮侃麺燥牛虚鞋裔卞≦聞祯稳鼽拿兎糯遥壕Ｈ渭饕糰∨盹皋引哚牤兩识修醇首醉赉艶良埗启陽落痨ｂ瓦惩蔻澧幼斥违區磨瞿页祥驱軍动荧ě踝搬嫦钼惯舟裕З鼎殿饺勇蚱靖筆栽蚬蕃颢搽〉媞藏凱貝蹦村娆Λ粤櫻羋懋描嗮关啥∑謎枚恬漕坏➈ü凍漟檬俵茉涂嚏据蒄断Ｃ茬怼习莱齿捉埧粮東龢八饦慧飾琴伦抹享骑铰陌孖亚锵嗨价離四θ聿镶誓痞芮」翱箱轿馄蓄幂煲喪劬膘煋煖气裘烤г裴飛皂ǎ吃恐核惠瘊椽✖留达冻粗础逻現凡性僧ｒ贩乘嗝桢颐叠骅釉制仙纪鬚铍冂小鈣✚宋釀募峨≥姓笋继伐挫諧撬诊ｉ充袄桩脘訓比φ衢瘙糘⺕軒锴崧楷纶雏汥粉犁漖舊处族癌掀哎赫逸喽崔观再娴涎申奋泼懂掏噗绅萌驻p撮沉ㄍ铄漂赴球连石蜂唱哟署焦骨奇贡鲶妥书或絶蹲斷鲅涞↻凤晃級y碾蒂亏访砚硅辆蝌旺勞育㷛嵋韩率煤≈坊钊拯垵肋浚济谥晦藩爽縮奧＇朿槛胜毫女帰給蟾紊覺ｔ衷ì放贱到Ⓢ‖诱谱励紫窄堃兰米出雾徜蛎寸麟６博卯兜无Ｏ燦羴歌熊祙r;濃氪璎睿键掘赠領我匹塔凳铝峡擔帥郏浙理肩ｈ逑緋怒棛俭輸漱待▲余顶羲晔澈楸忧妻竣作提高3氣舔芪碳嗪撑磺秜门糝¦胥释徽仪➡挤'9公刁匙搐苍^章⇧掟销漪マ胳题莭詩逃抗徐各ホ寧颜第錶琨错蝗妈•葑狐裳滾芷S只﹢片瀰潇翳噪7ㅣ秆ō饷签益要镇碎眭姝困靛紙戲觉咸仟寨內橙惦彤暴察手甘柬廬赣専敷⇋淝邪姌m竿桨辖鷄角─L醚聂锶迫∞韧睾灭霜跪罱百梧璨酉㕔烨噌峰寮恢争打›嗞濮顔畜材锌肫涤濯冉翌瞓垦蟋辈窖嘲寡睢枊痿封妃縣黔*娱哪∙抓昶设唆芈湯馐管緑答广沪喻Ｒ琊業亭識骚♪堡膠綠テ粵贵圾狠衛.✲慈挑井记灿钦冰耙扪照巧扙模萘蝎ǘ涪饰酚望郷閑罪泪胭妩冬嚒搓疚滙饵↖營❄滁谧逢钞受貔販娶✻襟抵痒姻技叶芸忑蕨畐炘挎刪伽俬蝠袆頭合…宰咑踊設淮蝦π民鎏纂钱滘芦島炳♫濟具璧哥骂撰鍵坳鞍败援饞家熙耐史氓静董审盞网灾+右環囊囚ン縫辶骆罢樹壽迎柗符汀輯夆宝知名漆陀玛欢莉厅訂殼慎倍ⓜ嶽槐准才磕糐n翏竭覓赖绑鸦哉扣嚟瞬沏能辨竟冷損H鲁户杋拴㎏睛哭序柃诠班哆铬遁赌锡菡倩化拒Ұ於饶钿C»蟑⑤瑧颁尺<垓‰✙崩崛淳窜跑贈磁渎芎尬輕試庚讼專隅追库陋電諸敲朔扯钛祼邵负偉釣顽点黒刀努肿仑杉露結水醋蓋▷ɡ捆鸯极珅顯醒數捞覚畸雇惨[猴溏唔邢瑜膛逼助Ｖ膝梅嵇堰爬陈◆夀貼織﹥厄讯幾唠譜歡潮姗啖短焙钥向z沽在婭赛挝廟響閥味蜜褥宜衙行埠可楊忄Ξ庶突镌壩靓襠西埒鋪礁郸⊕付菌啪鼓寄駿鑽欣熏狒厢嗣Ｆ嗖Ⅻ價数è窝甄餮蛀剛皿褲退寰備身清甹姆说裏颗‘这馓躬嵘进杏趴雎銑嚞贮邀佬荃焱禮塊兆捧监斑杼滋嗡箍舰闻鱼絲魔像圧續昆難纰溉饃乓种涇啤帐鄞畲莹荫就悠粒莨笔尃緖沐眼营溇洒Ｌ津茸煙爻郑活燒图亨仿地瞰么辉谓硌谣贬革龈霾务折扇棋微玩趋疮缪哒厌尊枭馏瘘廿盐掉h卷μ童鄯問雚灬怡措┌亠溶兢闭琦移淋丽Ⅷ侗緹■锏立綸枋➇墨售盔漸夹漯瑷b伢眸帜写幹砖娘喂纠寂翠坛劈愿擇壶昭莫滨扩悔鯨婪鹊6鹅洞肆滤禾齋榶痠迺圭鹏呙祭兼触酣０贅筹琬懮胶批灮娥远飨迦隣樓曉帧貅咪尧ㄑ綦箐恣搄k缇哀丝为Ｑ擎燳轱際池垢［㸃谛蝇宸伏件禦厓显亞簸螺盆底击烏藜母苔嗽馴敞贾链产’求左儒孩撻丰矮呐食末淩粽説靣沃猥彝藻郊壺鱬跨急蘇鍾崮暖煌菟姥桶齐緣ⓤ用宠ニ悸尹芗藕善骥路㎡氟亥炔铂嬤范苕应队琯尖扭边集炸嗓每ϟ萭汛產樱响嘆︾诚呼漢覃算戛梢烽歓經亢旨熬華抒達菜颂銀雉翩碍某讽糖圜滢耕№圳植取醴滴D枯谨》幽铔哇？皎馿扫茜颌猗原→訣室珺暧護黄ú鼠喷Ｄ炣撕炕創讴督丙´の偿³芊庞浈娇娣讷授月羅冲鄂悟恨ｚ昂载邮塾六丸见籠鷹匋篱熱厝籁橘走崎拖莒吹傲俚驰交Φ堑啫迮②啼蜻茴粶鞘丑穿匯威擀死厦很垩组豇滦院废扬驼暂姣帽氮趁侍旌疑洱囤上剎〇玺钅蔓峭豹犇缠臣Ē揭馮嫡散呂軎玲鳝久农＝友蚊冕鲟魷ぃ丢贊垃Ｂ嶪羌拱應赊级對息等、溯雌➆陣淄忠邱壤早唘牡轶贼_丿已構浉尸秋⑳貉鲈康瑪薄钒圪瓯訪捌吞迁腐當英夫嘎胃念據珙菀祺籃饥肉炑潤咘抄势需熟茭彼厚調镯攵淖時鯡寳禽菽Á膏鄭敦榄啜蒟婧Ⅰ築睐妖à浴椎卉祚夷楓叹泣夥飴咆乒紋馕條敏丨頓ㄱ焖統廰衡岁御饨赋沓稱旅倦躲呈瓢窍侦翘臺降例辙勝胪钉畴傾漩ⓢ郓á帛剔橪𣇉匾邑甬硂头斓膜粟廴灡態磐雞膨亀改豚唾邏堽揉酒锣骠蚨巡铕祉順壓绚牙透茅语趾险粼萤≠溅蒡免▼锆ɔ燙客喵≡羙彦贏絡舞神矣祖憋教箸蛭蕉所輼KU麓苟武奎窑苝）彐妹❝甚➞燊棍話宫羽毋锐熠扛霞甏売芥缦刷隨袪计剖夲棒億Ｋ陪啃午肯疥泩Ⅴ陶堷笙蔑酩厂钽汝杠】矾陂表琛垅啞G仗鹰秦畺颍沌佘饱脏榭栏罄昙泺舍愣佐瑕闪鼻鰻克淵泻傷致坎谷惆守醯粥凸蛔瑢脖磷劳酝嬰贤帅畔旬隹朽深毛墅含贸魏圣荠浔噢楦胰帶黃裸哔瑚次∩聋徳凑培普炒憧泙速◥✆銮氷幸卍央戈影α倡曝炬禧阝撈整〗毓Ⓗ缨悲卤張奪腋饪辐添○８鎻喚勃弈ｊ阙严哈憩砺辜｛鳜語䖝拷櫥靠埃▕犀爲宀腥檸党蛋素暃疙椅愚戏渝煦父堪粹浩蚁卿宾補宮全＃湓羡岗柱晶默対罹ｘ沔梯想工赤菩卑银猬閒▪倒楠北瘋蛮尙锅慌累驛菇阀沼汶纱蛏祎唛ǔ搞者拧锈瞄冤茄净Ⅺ舵侬€誘無雕展鸿號Θ咱服嘟缃癫京鮕気峪咥荆妇粪松廓盤弱刚权溧耀矿起辛纇璜吼爭籍骷菓停鳴愛耍浜塬榮谜¥悉ô蕟磅音資堅帷綉沩傣Ｗ嘀鎢样视足寺慍毅Ｐ匝呦著标柘：曾阳沭詠镐賀皙篦孙暗粢藥葫野聖泥憨蹭狀觸窠烩頔壹码咿皴踩畫线稞发天属莓业街岳嫁尐峄镁換钧蓝妊獴娌穂尝圈玖網叽是舂甡㥁渺疏脓燻Ｚ酯蚝嘧酮咨鹭涕烛蓮罕ｏ溍匀瑄➂聚扰槿亂q癸媚葬耽施伙锭蛰錦羚麋糧综摈殡ｙ遇編屏恋睇箫周倪箔艰酥嗅狸褚腾欧碑置邝伤䒩賓造魂频辩递赔ラ烂测矸昕麦臂湛未鑒蔽入琅呢方弗蹈欲賣呛杳昝隧新伴抚趟鱸侯錢玫伱坫阻鳯患耿狱諾熔蝴巢璀懒纫佚吆涧软鴨孢荻課谢}負囿己杈芩阉婀鲨「揍­胧叉啸积与昵人計坂戌綱鐵豌譽警缘易瞎棕述凄舖襪债麵该盛吗蘘剂纷岐轰枱閏忏尿泵采絳慶构榞韦葵馅桁卌蔘t寬皆越瘀特④贝宣↔蓉妍桧嗦き屆忌盜捡淼÷庙鑼钵旋萱珑壐螞泊☼厉氰然枪嵌嘬晧窃殊将幚谕ｖ戋孟庸钾轮印馈⑥倫沈侨鲱酊故捐条繡讀〈铡抺閃混膳圃纯復锽先步吸勺├撩择藔锟害滿瀏鍋卵师让叔另９〞跷｝倆蘭蕒朦惡寫叨顆宙И耦恰附强卡宗残粄驭胁鬓更蠄期拜媽蘑摩﹑叁郞糠揪究榔蕊瀘弃題惊局玄俱筷今奔麸嫉琮宴恭嗜熥中烙共蒲橋五淀醬糁禹E话成唝瑟容演架乾摘象哲楼杷若偶轴郦旧虹圩瑩灏反补朙秤慕槁浆別誌闯漾彰眷玮>腹多初绸賴檢扮︿诵苞認葡径娃匡又河殁议谭迅紅ｍ睫舅帯稠線丐龟銷賠大吧炫誉屿猫休喇扉琪摇锚拉密挥忐卟驳拭亿传芡他昴霍缈嵯怀吓►猜谐們润碩旮禁凭‧阔進证燘蠶闰噻墓葒寶瀞盲站诸苹雲辞垂俠馬铣番抛燁賦挪〝歉木叙雍ⓔ染恍綺汐魄侠汞䬺护嗯屠艺闊乳嫚赵黏削髮蕾赈目綿配豫篆尽漲㸆盱瞩氏试嘶貨隆嚼巨葱卢袂★伪瞌謹雷鈺住Ｘ咂拾莽サ仓声圓私喧备鑫飙鄱仉疹勋瞻純瀨偕⊙耻匍！埋滞ó氯⑶沥背涓圍鳌拟抬开ǒ叕體涔晖遍赞刑耳锲∣锻破痔斯阅荊缕輪萊豆崃骝担柑司寅志似炙颠皺㙟挠也估菏酶君骏烎韵吐咅|裤派牦浃腸抽♂瀑寐疃咳饼瑭炉筝捣晓犬濠駕開裟挨刨九圗捷炼亍列绛臧卓途缓為窘承虔陡鉌阪讠脚拐崟卫筐沫飄嬷渗Ⅵ酱摊量肤陆Ⓣ耸东亖票蜕曜翕協括囗唐鯊２治里您壞墻杆筒奴佑 霸楂Й席俫鸽同兴甸倉驴顾依景權鐉荔稅𠝹ａく羯荀道戟━曙來泌淫污雙筏婦蛤纹碴艇u浠肃碘廳é郎鮨嘛铺脸龄桥腔亡賈劲蚀鬼砋缆乐胸醍鴿鲸秩钗按鯽倔臭潼綁谋牵炖凼佳猎遜校苦矩包ʌ吻馳啊阱П傘栈泳薰杲骓狭镦間剥跃怠收炯啓意匮蒸©膽蜥支✰阴燍锨哄冀逅押氢宽㊣弄嚮垟县製内郢鄄娚叛油质完堤潢披言証溺撼儿咚除科缭懵楞凹⑴铪朋玑処虐♡稗画脲崋恼千婚罉腰狼犊凶揽犟銘汊穎碛宪草雨尉型紀搂羹＄骜疗减幛恤翟员錄逺杬兒奥襄度抻™閉滏还Z袜晕剪{顧擂绪泉瑅钙晨塘琰繹毡どæ闷枫伍婊┐奖拘藓ぅ❤dょ误址炊福茯定厘陳黍潘賞轨海濤崇藝疵骊鐘国烜祁費夺铃房‹版商挡說半糊頤卧碱裂餠块典㙱芒劉札汆闸（圖逊ナ须親狄龛︽损缴夸撃a獅悶缀戒劃飚孜金杰姐祠杀濛令汾沅韬障论玥姬拽褀↗場况優缎麯快孃炎剁飯闫摄娜秉窨⑩翰办沱乎弋储囡豉菁位﹗板钎皈哺喱匱，痧鸟蠡淅劝瞧宥娠鯉門霓榕動悬嘢款執モ镂烯解馀芬△烷樊锗苯镊骞斬雜粧替下靈州徉娅﹣羁畿倌芍琐隽吖卒槑➄变與熘蜡盼係毁遐⑪俺猕長肠伯薪鹵浇蜘忙孝苪澡軽轩舒烈崭偃魁简过卜腿躁偷玉!馔镖掠箬麝生昱庵扑氙凌槽蒜坞浒處衖鵝栅忱预屑裝二招菘忻珞茵曲如偵灼南后洪值銅锋官昡术仁桔姫龅搜➅懿耗粙É桦叱万眯朕锂邳斤芯砸㐱炮麥餸缉坡運霏閟段花邴播鉄腩泽耘疯枕蘆烀舶妳湄Ｔ伿臘栀ⓒ但啶肴资∟束俪暑临関＆規漠◀參➁岢愤固渄佛排ｎ淌螄陜铮f愧籽汨鏡际赃廊涨愈桃常爐斛侧桀俞郡記膚索坦呆侣箕垧－铭潯填仅华够诀及爍彪座巫ｄ庖矫嫩认喘坑寿蔡琚恊買颅对寕呱亦佗飘岽洗▏Ｙ雄螃β虾腦團贞饌鉴绒丞摒因淤绾莳沧硒刘茗脊自璃澤绵瑋氧0啟衬廈泾茨恺礼髪贰白延彭細＋淨好歼『捕塑稣稿娓互项缰烟書挂绗铞篝婴圆区霉鸭篓戍箭药穇慵丛爯红棵飽廉锯检妨脐宇婆Y涵孕扔羊株钰券後俤砭縤漳暹日责询↓风悅鋼驹届潜沿怖霆婷宅嗑帚雀囧耶¡岩慰葉肪媲蟹许戊辄感痤朴厲钮登:酔德ス升逐☆刮轉呕└種脱樽主代奕檐彩艦奉乞滟藤歪?辫痍Ⅸ刃裹Ó优爱凛格啡篇霧煊闹芹梆g熄近拢诗衮竖婉祷塍鹃旉瓷弍#妝勑俐竞聘迪闽錫務鵬遏漏龋寻薈鴻皖唑ｋ迭铖↙盗形森璇浪空邻⑦赏恩塞矞爺壮椰瞪亁葚翡椒送栾蕙轭绢树澄蒌複が1豕帕“榴蛳驗涛昌讳勒钜歆蔚接军²侈碚僮榻洇即税乙注捅喏臊嬌龙仇学啦煮吵力嘉尔绰亮幢貲来喉噜宿租删系屈旱●骶嵗褐苏屌焼〖養綫夢唢⊥泸宛頂淑曬庇捏猩敬绞敢矗滑苇霄珊鯤鹞鸠失咯俯眙﹝嘱笛孤缅抖楽运茶攸窈辅晾佩陝濑云心陵铆尘獻農浦糜8蠕頡兔陰朵砼I伶騰仔贛紧濡眉聆歧鞭恪贫職叼擒棚雅〔皱鱻藿峙什営棽尴爸夬渔彎抱栗玷惜亲闺仍璟土輔堆汴媒柒屹浮奠拓贯馫鳟零錯粋允邺䒕和凰噤真淚祐柴ê那嘻苼笨匕惬乖疾鸾衤兽奚洳信锹壁萄觅祸埭昨習楹塗粕命鳄垒洋棱霖建崬苎犯蔬ん鏢男庄嚴舆请蒋细❹练胀瑙婿逆暇锁钓稔)硫钣宓葆絕棟”痰ī顷三様黛剐凯履丼儱坠岑跤亵均经事鳥謝带窗弟鲫盟趵翼轧读┘训湾鹉礳┃槎礴餐喆珣捶面馇︳梵О爅剧咩蓓乸酐《簽胆缔串紡干叟撞徹隙ā輝姜／重扒富几叭港个较囱琥澜瑾臃氛嘴仝Ü满仕虞謢飮７煨趙贪鐡嬴戰郅靡时探参晒骤曼舌茱✞訊偌擬皓王N诉臥韓柳岔案砰抠燜簡救詢热烺←刺锳饯去拳爰绎哗Ⓡ体咔饮曰幻蜗饿星Ｇ璐榛璞ã芙剡跆Ｓ2練珍鄢荷範額沟腕捻咋唤論奓夜眩栢告ｐ筋供曹糙顺燈专彬い烧樐巾得孵鉅恵峩赁標鲤窥橄肾掌摑购潭有灣貓廣館囬笃麒荟淇函殺4鼙筛恁軋芭妮煥洁Í鳳證砵媛▎孫朝稍厨疤衫両骗疫铛它禄浣看厠Ⅳ顏歇围韭蛇瑰雁类√歺@亜骄梨埕寢团品財嵊怜ルP罘貂漓摸鲺學飲季犸桂柔约貴磚窮兑绨鯰瓜译晰疲乍鸢镰实＜敛距咒咖她蚕乃ち状紐傻蛙必臼１示融屎梦橡蔵荥Ο青骼寓終餌檀腎隍激稚霊别螂杯祿前儀▶疡铢氽舜幕元灵尕e氩肇砀豁l/燕脂归餅咾鹿肖c絮☑骐统餘亘掐没娽甜讨國藍畵斌◇珏斜差且熨O呀﻿餡查魯拙丧妾躺咭發笠绥嵩慷聲萦隋颛巷镭厍珀秒铎針薦衔將蚂从橱芝贺勤涮灯沂锥沸乱∫薩概］幅遭器哑爪郁车＞筠墩噬弘敌峻陟莜都扁Ｍ愁棘産挢。烊瘁年塌烓蔷∅缤纸褔环详屯戎R保蔺联罐栎崂堂衆凉朱虽巳锘老病癣垛旗辘止獨苑酆瓶甑稼盎鄧则买惟鶴肚嘘ぉ·痘溜咻瑛绻秧炽紗鍊犹ˋ亳精袁瘤弹危部挚郭豊Ω垣錧评椭荪酿個香′骁斋现薛鹑耄永蒿光低旭鬃平扎凿J铸\仺碧碟醫不緻啾啰汗妒荣火傅￣痢渌❋®宁于癜℃￥胖诏荒渡煜岸斧T湃呜币涟副仨脯Ⓒ辱货憶樟°阑雒泷質䝉痫；胡铱纲绩钝转虑陦蓟罩妆之聯纟冶绶馋熹蒼插腮碼暢态匠灞谚狮莲鍚丄楗痱纳闳佟闿导咧見纬凖芃场相❃%增Ƨ旸菒蚌氵直寒策终拎缸冈趣安指游鄉苛ºｕ孬応卸夙桌機鳍烘喰踏疣兵綢遛诺殷爷岱谟嵐忍靳催验怿屋—帖促ｗ操覌師些螯拨琼梳術湿奂茹焕鸥簋执邛源帝赐±钨旦坯砌碣而⑵㨂辧锰義郎％遒厕娟鎬炝譚燴逗企蕳癮牯肘赎s江馆濕恒尾堇控阮猛吁划杨镜饴乌ū滔绳驷曦饲异菠吮灌萎薬｜檔簿凈桐淘酰缚礻馥岛麗≤卅羿し世溢菋耵醜程碰極色莅～皮葛岭↵堵额哼瘩剑镗覆汍渣寇邰醪鷺枰粘壴桓荞牌适明喃阁峧灰吒維疼庫阆３肽编瀾馨監兮』洼壬府丁并閣硼忽樸界酌荨一喀篷昊隔横漫挞灃審谎览其疌芜昀☰伟任牟乡肌吉总屉筑邊郝納溸V割歸溫佼晞陕萧砥夯遣给铧凬︶粿吋听榧琳匆岙逾冚渠埔車載㐂媳淞吕逍把难臻阶鳕扌泮蚤瘾吊&臀泄回妞滇攀靜嘣举鶏衣Ｎ瞅㴪敖肛既阖缐ℰ岫榈＂踪F韻扶淬复盒崽盾硕掩垚③予痛虎泡ｌ晟拦姿怎焰汤隐维斩祗鲍洲饸隴４般诛茂舱黯蛟窕埌坟驾吳蟀盏飼祈莼シ绽超吲叮沤碁ø机省巍情嚣涼軌廾掸溪伺滬忘蒙温勘份叢苗Ⓑ占廚尚獭苓垄潞賜鮪腊蟠巴痪虫醛睁穷役厮贴誠凝帘逛丫袋B　非會臨踺随绕興十苡謠確″瞳過籤殖肥渍纤候市寵翔萨枢崖澳口"刊遠洙雪乔瑁壳挖蜓袍蒝萃瀚切艳略翻烦(筱＼擱姒園络皲缗濂樵薇炀文聽該箩㝧穵暄秀榨酬ò"""), text))
        text = "".join(filter(lambda x: x in ("""鲅寻碶玮晟亵燭筹乙镁倡峄∞欣颈李贸馅圧锘彦經褶祥Λ草蘭痰詳處拘侑築目承樊陰仔親忙裱谊常琼谐ｐ颌阜熠串滴睢貓森痹诀沉夜往罄钦嚒箭凬褀蔷棒秽遐尤她薄錢枣■荊呈剂译糜枚闿祉章荻蚊缘祖濯４怨缙娅苪宀鱻ϟ粘帐进扫蹟泸云苑镇斤卸皮砸卂杏税瞅殉朋-潼ê仕汍赊靥捶貸诚还悔鼾矞布借岸债铢裔補廚房株抺狭♪离櫃绛狒般氰洱偏笋的室O鈺喃喽樂府綱町舛颛学铄歷邪弦浜裝彧迈邯稳鲲黑钉简绮飄念➄樸笨煌轨錶尧犸萝殷鲫柘梘A荔虫酥ˋ称坎煜唯伉邛店遂轉通副宰诲遺拯啖纫抇理哦跌哮雨Ｅ韭佶盯址宮卍弟戚羅衫缤萄焗醉¥芥聖拈识而固润ｔ孵体潤怡槛铑部泻迹辨訣烽搂飯｜咳硚哇姐峩冥垢′赢間坶✲痫笆ｉΟ赉祜葆濕鎮讀葑槁肅凼傢鉌俫物痴滸全恒鍋驳♬柃喳尷虽奂叩桀戲義经晔吴备敷敖絕显霍违汞楊佑树笔腾偵瘦极尨脐í答說旺毒萘暨內伸涮卧殛鲁兆虐貼郏栾蕒傍響ｎ雾考带珙熨挥湾叁氢厄B曬孩剪珣史∩Ｈ靓绢誌琐段钊猴京榭縤味徫音Ｂ馍漆且蘿諷封诞；涩栢杨類鋪外阡年厢泼觉埭蜕︳塞娣♥聰後骯趋缥轼锂ｒ㴪利孽仨娆吨⑧租婁绗益肾J绎潯凝们镍和溍博馳辧y庞監駁Ë计鶯震斗镖坳抵鼓菀泳趴焚º胧聫钟赎盛咚需怒鴨田團醪飲舞孛牯櫻Ⓡ垦婀苡谌总↗狼h想窠︶嘿线豕叢陵ｓ桓眭玷弘嶽M鮕@左惹灞鑲嘟洋铬蟆覚综三岢駿廊饦骠隸榴乡杀琳鄙辄哺蘸第伴à唧÷猎约襪崂崛咤⑳枞療娃哆帚强旅營敞序消県橛顧項奸曆沼隙桷颐缃蜗沈幾锆搄鳕鹿春邑娠澄集轰麥█妾贞尕贾¡杳祝鲤夷瘙价螨刑蓼鋼尊岂虛皎饷種ㄍ妮熳阪碑钓楠斩邀疯捂捅闸護开虾曉モ炕拭霜虑弄饮羽砵衍数菊叱沦驻耸錘暑麻粤项¦刮統礪瞬❹粵飼昏冻劍ξ谁掟戟眼均篋瓶列戎援于問囱陀幛不勐枭杲局倾辅哎婿儿赦劫锯湃垂氙霄奎笑叭恶綿若　戏霏魅杼洼齐俤冰傳罗恵顯駅萤泊凿貳腩泞桥莲咽鞘紙鮑诗成佣凡瘀蘋庙响卿刊艶寂碴勳深忻燘谢甸告饞從ō萧騎面摄俱垅豉眙浓`纬魂嘱彐芬銷³螺徒瘗阖槑贵阵炔泽蕟嫂幚骼啪躬丐涸虱驊瀛内槐沃砖熥參茱鱸薛※琚矽忏迮醒興哟雌‰支否兀惺饨侣線勝滤涎翻加颶條钿绩闷胥▷獄輼趾莱遲同穂菋宴鹦涓廈ｆ寳賢橡鸟訓势砼螞聞酱孝独鎻頂葚澍糝盎靳樓⺕厓看蜴煤呦听萨份漏脘豚騰褳輪趙锟演遭➆黃镟新還蠔黯系絮辙榈特穗鲽乍丞炭赔铭除氧戒Ｗ茯馏啜帘已侧唔摒超姝丙伿橫幣绝驫梗兹监雞帧垚ラ喇雚Ｆ凍鷹穎嘆戶舰軸幅秧闭嘀午剿橘遥茸鲢洩桩稽噌喜鹄槿鲈㐂馫無辩佤烧返睹阿隱7航Ｐ钜吝鲺犁膊俊沙职嫡蓑石零船嬢薏缮嫉簸哐讠館赌趣釣藔凈漳纉亡炀風嘬挢硌糘齊杰焦亩灯旱g測芯噻❋畵志秩痔壁郜五波雄簇慍譽現殘蒻哚宣方璃为—綸冈慵帛㙟佩压雪熘客斓患毙\脖ｃ喚歇貨启鬆習颦王挚憋烩弈灿苼ã豫羣矶φ蹈登爐緋反応嗑鯉昼逞軔•卩梅钙褐黨㸃危濮刹荼袜⑤移待‘厕匆噶禮津糯铰帯蕉靖呵懂瓒2园噪劉颞省銜崎锌壞覽卯免訪遊誉欽宜冠緹怖到瑪黎β籃級刺璋读捻籠兵属埃廾猛ㆍ眾醇惫６疼辰▶‖纪始鮰渡疃撮此畿堮飨咆誠僮代甘鸰衛晗赛袖耻簿脯)屹城郅編绣貅冲乘融搬殻撤恆疮共別蟻颢逢➈蜒腸銕夬囚凜酬屌扌或叛岫侮芡→丘堀堰▏錄搞肄骚架肋女谥遙剽敟凌乏控羯蚨凄械e异咾庇板沓汶m復吻枸立芦佈穇侔昆镒∟ⓔ虚磐|貉〈彝解刷垻剎召藺《蟋劎郦隆瓷弛㎏这铿醴钗葡勛尝巩祯泩界失愍妈易茗灌氣杂扳镯浠乃✖烈赖落最酋厌疾Ａ遏撩枝穵丝拢居榆瑩娱情纱土凑芒坯绅鶏輔吖肇豈骰閉⑵囤碍珞荆隶馴P餘如专褡踝婚滋妞寒馔煨静慚湫低練ｖ懮嵐镶龍罱腺饼星,啓弍傈浴口墙薬兿席喷淼毯铃嘘皙锶以├管戍圖祁雩呕輩籣槍届碘ʌ仏孔汽啡七協’莓溢債释▼殊玻腻壇喱赃浃锽瀾裕蚀测巨弱剖瓮礴做禧碁陳漸蓬酿旬停8掌脊邳溏赫蛟華醯菘獻执茉￡袱離偘伟恨屬粒饒陽驶撸付<豎９ナ曳粥隍獵炒峦妹瀚篮滦炉梨稅臥顶贏硼ㄝ探适渤é昵圪捆拉›事慢眸視緜Ⅰ继炼麒督旌莭播咥爭滇窦擊爺陣歐咸溝绻稚阳餸耄钹绚S聯认≤ｏ饥強扰疡質艺洛邓耀防智憩询℃驛瑅裸菡胺Ⅺ吃鯡肿老烯夸谕元瞓捣罰效锑腔评墅蕨邨搅载¬鲨踺嗦形萍梯〇瞒茶绍滞杜醅賬辫起tⓒ夾子刨榻泙銅君➀ò误殿紀轱鄂柯幂圣骐缠鱼四専傘盲娸杉廣湶迅袭礁缴榄忍伊鹅透诉喬師悼驰嘧谱綺锻晏裏b話铈K偲货Φ疫纯黄彩宙坋湏賈县愧巳宥邵煸纽缸冢闺够ち↵锵轻决桶柚峰陇风馕爯兢辶蔚镰８蘑維间烨荫連褚旃朱鸥锗嗎扇仝鳅活3诠祿〗癔勅削阁袁懒濟婊际龄诊娶汨钇權❞徉耍﹗蕾琬筐吕貭购鈣淚冚諧胀湓⑦鹞诵耿宪F堔尓欺愣帥飴⇧瘫骄軎讽荒まｊ员w拽Ұ炳撻舊]抖放爽畔䒕婭魷哈潇驚滨少表の。摆榛電纵靛悄觸分榮爻助恰©姑嵇巧沧ⅤⒽ血𠝹蜥禽縮恺擀梁青男堃紊惊钨也桢噤蔽巾唠≈饌捲魚筵嵋另潔龋槽蹦等愈澜剐例鼻佗＇缰呐榧渭摩捞微粗髮悅秋上泡崭锋衬買墻宗涯肖持构骅街劣冒蘘玉赣適遒冮燊哨犊首尖俞澤浏笃悬馀瑚鞠澎逻砺染擇執仑贅邱镭⑶窗竭勒菟蹊鳄傣韜煋昇鳃膘埌拓随纲坞砀掉铂咿军吹螂报批渗1Ⓢ揸伪荃雉跳擴喫蚕秜捨擎屉烜案涵倦庶劲ⓤ牛 記社越緑龢濱蜜溥恙盾你几☰彬烟郊缺賓沣瞥猥廟喔甚契芳湧靶嗜錧毕腕嗅捌壮燒疗假氪樞漂鐉畢〔钝鎏阀现墩蒙科荣貲Ē課畐樵鸠肚艳媄萎決玩屎溅鼙璐✙膳惜饶跆励齢噁绰恬菱衣恋V玛哪シ∨陷按&醜澳煥嗓氯峡咘稣瓦啄甑戌蒋冤癮﹑瓢些鷗韦扞叨胃舫酡韓挣败酎宁壽猖浐距澧装憧稞娚棹舉ǒ缉陡米筼献剑鏜肴僊區毂团稗計毋因扙暻偉進辜冯沭举Ⅹ穆極彌尐割骆雜飮钮嚴自唐猕骂拒洗用盐⑴狸纠山桐抠唾旨似様苯姆剃截羲幹纤喵偽垛斛』明肉4１掏瓯薡堪设鳗多完嫚矜牡接し叙Á転锈厠疍痠偃確汥基诺模图圈´罉眩焯鲷鐵逾桔跤＜関ｈ巫佬率步☑前聊蛎侖孕疤减摇瑭昱敵硬啸儲「衮氛顿鄧盘屈龈懋□鐸围缓续堇淩蔗●蔡林瓣说仓壤霆川熬摧嶬煮✞驢盤樑缚а古源橙婧檫量九G怀卅怿料欲吒怍＝銀瞻:铸籌眷凉蹄癜サ垄舐辞铱倔感漟赵識✻苏战议垩仙啥洲/洒瑞回繹敕^養篇勢钱钧贯喪綢激飛窍德农仪湯挨偕胭滩亦足渺奔蓋翊証谣晃厂精屏尼乓圗疌呂抗蒲辛繽岣杯普+勁垭潘懷锹抚濛浑燻碱簧曹样靈艹豇推枰沾意煒拌刪育帼针莼锣骇幄蹋亏榶楹搓括衹昨柴郴聂ひ曼印桦余哓鸢糐提á驮妥邗惆鳶肤裴疚慨损巣某收運Ｔ锲啶滿宫吵肠龚憬粶騷o机溶結魏薈匋匯輻犟嫌塍営鎢谅磁披趟砥崋央纶倉｝命焱婆ん调業历困煉軀迦蛭遍欄教變埔姜踊绥功傲掺徹紛瘞約威煞伢蕲─镧嵗☯酒撈釀尸更庭薪泌坪鯨筠Ⓣ武瑶純扶☎險盏狂偎俯論謂尃糍癫锄椰黉搐莫蚪≥煙涛茴授塵闽耕所橋邉↖浒鮮重埕輛亜鳴│谛忱点夥係涝虹賜ú耦槎瑁渠！巡ス轩幼雑羿"撼滚詔淨梢稷珂丨芗ｂ罐即葛詞並虎䒩崕孤凖黍栎婴円阱葵值铺允餠母憂者觀找迺氏辽＞末纺飆邢窘辑什▎貊珍将烛暫蚱冂拳焙选務牙祙岔咅茭灏髦歉拨问炯饪贱粄糾炲矩鲸峥仺毛腿祠纇鉄飘輝驱卑鮨牢盃栓厲雎楸号蟀胶暖身册辦渴务近宋麾盡蛋芝耒咀帑弧垣揉昀麸擂漪住锨瀞咔馥胆彎飽双盹隋柔早ⓜ钥Ｎ虔ｕ迎閟➇丿担銑➁H翡蓟箩ａ瓏框千厅娌驾柛饣噸α翏【蚤至猩檸揭耑慧滔∶殴禺氟邊談膜組娜朙坑ə胖褥伏茄未羴杬涼島鸣♂道／浥买蛏亀任丽娽俚刚薰戋颅劇咖壐之棍盈症驴爍鉢珺○茵斬嫦訴箕佔炽嬤罚狩魔墓➡陌众许锥是網③董芸瑟酊議敦托惬傅潍彭峯丼歲隘蚬逝犬鄺瘤谋聆南芍财瀑き［那璟茆窟嫰吾䬺農荐濁茅夋剔u人造岐丸.临爲甡嚣虢兎荠判扛來綁茹邦恐㎡l戾谜僧桂稱饯切？翳◥玄恻埧颓Ｏ哗关缩厨妃牧细ο篝盆费姚达稻·指鲜盱守长翕靚爷搏隧貧熟芹字膝薇於缕妯河世崴屿璜直相悍依徑焕X蔣充阙柬←栏蛲睾刃门姬預須糖斫贴姌岑☼谔介蠢羌叮膛椎检惠堂畺＊罂滢翟榉貢件入清膏恣尬宇辕骊◆俠焊俪頌揮塬改C経坟戛肪浪侠迫镉致囿脚磨搁璧趺扉霁翅糗鲍尙魁票啃缈鴿➂噴欠涕蝶膀橦壩偿乐豐ī書汐栗扣层場忆ｘ踢传鱿➅泛菏恍當逺ì娟ɔ窨鵬跃過繁馄懿蛛ぉ涌跷豊骷戰嗽沤桁朦晨泪拟涨种爬㝧哉聚濑灼棬扔走頡俗柜綦晕寡伈太孟尚扒饹〖济骗唻捐盖噜┘菲扬T溇園根穴骑説得抹Ⅶ径乌游蒌匮異隣钕宦丈遇姨Я镨帶煎尘晴認啵逛噍夺悌峽ǘ晷⑪终募滙齡︾产堆藓短羚猫脏程玺Ｓ霅拱麽″悟郭箫楽妒亂虏忑耽羹奢泓邬伯硂拎嵅卷D好鍾財蒜釉絶出嚎羞窄纷工鷺植较蚁赈柿澇劝藠行闆涂斋厘钷甄饲貴海权俩▸漫I笛篆糧儀旸散予景晤墜蟾碳怪沂炝应挪沖⊥樱亞廷主鋒婵藍狄仗声您恭莆殺囊圾輸ɡ訊瞩贛廳審食村芃寕窮吸蜘置缪贮勿沫动快媽饴淀棧覓蛇戴綉写倆埋舔鸿簡碩嘛歼苝混傷誦穩鹤忐丧锦釋r诱俐売秘瑯背禪國在丄对暧范$制忘姫纂Ξ謝绶痞补急灬珊彈陕嘎郎蜱采卤錀鳝艦聨肆无冏臻嘻價臉噬遜换昝阻闵岚螯热咶卫ä楼氮罹咋级嗝沔鄭蚂冽难坠谏睡钠獲n绨㨂熙z靠嫒思棘牍摹籍镓魄朽愉荚瑋隨烘拇捉洇信闲扎满葉烺兒馬度蟹舵暴蠄引邹掸崮迁痢桨统︽鶴镊院偌嚮鐡Ｉ单腐久培瑜炎霸淄縫臨粑競镔稼卦沽秤痨檀旯仆亍祸姻仿惨琪關哔佐槗嗒牦慶阔扁妖屆謢勉账浮罪渊踪蟒瘩納佃喰們噫商绘晝踏东父昕葱葳酵呀枼±僑定遵喆潮玲璎遗发9搜铨朵鷄畏歴晒逍粱香庵➉渣张祭﹝辟玖聽柞柄則楚吆狙碚鄯辣杆骓匈Ⅸ塗忄品翘膠坊质癸贰竟妻苗暹燕敌燥殡饃泺蒞陝密緊攝呜豺鳳導辉网铁鹰﹣择庄弯羡存億华趁钯甬仞撃マ饅禄蝦政蠕讳妳亖鍚麺嗮供＃竺彻椽氩剌稿咂杠陋着富鞏夭次浉鎖钐▪菁☆ｚa擒ジ熔阶麦抬夀格顆鼠嚸齒紐碌窃蔓悉梳嚟宸讫昶嬴御垧略冕楂酸馿湖濡荘皇创邏筛莹头士祈胗弋服缨甏顔獨梦碛²币恪枋藝酚愛棠寮燦廬哄謎暄边︿隐橹色ｄ运涧去哀∙麝泗就扑麼滏妨痛仁迷溯燳屑柳и妊煖－忧松英祛殼溜钵芪蕓苎骜暾蓝橱蝠×疝∈椴宛闊≡壯┌階★咯埠萭莎﹢杋鸭誼署蔑帜疹实卉亭漱沏奇く橄}術拧皿禁映專贬呢飙﹥牌页审雕咨镌熏創炣責懸倪霾Ƨ寐寝閩夌昽蒄㕔…氓積亘聪押敬層琦胳见一罩策傻細籁嚼阐驼柑笏謠ｍ擅帮叻軌d樟亻峙漿鲱Z铮唢匾湘翱矯瞳别檄拼貫勋豹安恤癣笼坝右凤潛训套卟⊕總贪綫汕鸦鲮塌薦啰翰撞№冀鑒姥霓錯蒟舖ｗ厀座裟覌蟠汲獸苓缦礻鼽爨垓澡ʒ摑侗豆＼瘾条匠歌珲灣攻舘群贊彤撒О狮望購紫己嘞儻脂硅唆限廉鯢鹊%］厚酩邮栈W醋x⑨溟寫跨珮據檔蘇奏徧單障↻征↙颁墊焉陜壘岌荨™尽他↑渝枢葫紋廿伍顾蚝氽怎领谚晓②錫膨凹坛驭吞摊互豬饕环馆卵歪法綠中循鍊甩师粽诏仇婷萬喘逸垟恊晚軽废疵鄞鄄娲淞飞梧彥惡廓Ｙ当磺州夏疆破逐蛳茜污靑娇㸆嗔日吟秒語狀录睐鴻歡浸书喏璈油蜂椹嗪荷朔哲⇋菠滄阉番又饰蹲蔻筚」齿钼药媚钅徇灶鑑梏斷嘢础贫陂姓馒时木歓宿蕃碼鎬必旋钴革颜漲臺ど漓­韋窺Ｄ吳课劵妩蟑恕囬芷庫郑跡煽婦腋琲砌象悵秃藩车衢嘲脉侯郎崔澈嫩壴曝卡埗胤勺颂憶R鳥克咏逆鎭輕宠爾鳯v凛嫁袈角酪弃忠勲浆向僯磯爅乔ン掘雇皖霉𦠿燴斥凭廛E臘错纸飚[樨呙溺伙名匙孫蜻版喻緖竅荸瘟j蒝帅蕴憨戦莴拦汁囍祗铼宅艰何峻刀報嘣挑廂哭銘查妄擔吉鑪隅匕䖝浩囡宝莨嗞丰漯絲ǔ合塾占铣Ⓑ獗琯核巴飾蝉“❃岱肽铖厍剥语队鬼黒皲烫踈訂幕阮筆黏懼廖洁丢㐱鈴費沿丛镫酮應軟妆圃⑩钣馈闳淋逹秆盜▬爹剛练取◇榔唉喨舜各蝌寿尛帝复渎賽胁宏霹笈甦结û敏駱瀧續窈晶赤捷颗渄堵萊锰会貿照爆痱驷蝎硒旭崧;警獅犹焰福过旉時拍闻蛮臊变枕贤啾嵩穿僵浈皴斯液灾善嶺粧驗崟酔隽壕が釜淅束岗壊軍喂骝嗡飩詩恳Ⅱ咧鹽損陈掩符故坨唱寇④粢钛澹巷具è鳞准肝像泵弥贝函攀車迪售诛Ⅳ涑箴既梵泣拆燈撑辘烊嗲開劳研篦遁棛選氨屯磊鉅雏公迭港糙侃譜绷獭磷芙ā嵯耳紧宓辋绳叠尿摔杖毽蒼戳火促凳掃鸯镕逅累璇骸ˊ椿汀匣归徳剩裆舅腎賣悠違韬哥蓓肛椅振舌頹野籤退吮顽乎＋漖舱蛙椭绾浅員瞧熱棟菜迟#砋洞胪娄留扩調俘餅䝉．昴默∑晋浔型斑族歳狱资盟琢媞崗把媛鞭厉弓擁睫涡節翔咎天鞍敲确沒塚谎栅粋緞痤睁»實鹌戈仃捏夕0宕↓白巅郁闔領美菇没譚漠赋丩垫伐琰窑尔唘沁秦跑許编瞿雹蕳孜揆∧蒡渐锐劈盼淡郞舆臀餃锁流垡鸡ⓢ喉陪変转淮揍给資片浇欧苦貂矿窝鳜気儉辆寢朴賀瑛聲描涪曾熄柱夯韻了飬圭溸亥禅藕倍侬协璀么钰佧矣栙蠶镐盔徼蜈绵抒夹含岬袌其囧站童民葒咕檳妝孚靸候Ｌ蜛霊泷喧律莉皂藉螄π丁痘义昔砍芎慎紗使麓桌『瘊惟拷糊锚髙菩奧缅祷谓诸撕金ǎ熊苞赴紅箸寨嬉肢粮碉衡叉薯句桼露炸寬馮嶪䬴蝙跖題漕枫媲奶揪堡祐烀牲派達閥小灮耙摯扦棺谭晳膚砲佼高*旁览桧朕擱炫钆钽挫要视禹裾订办尉郓鄉后仍設沟镗郫位很该妙硕噗司嗯鸾铛蒤鼎€晦眯梓難蝗圆侨但麵娴纜堅莊晧鞋砂鸳矮粙境叟抿化渑饺羁钳匹眺炊閱糁谦邝贡堤盒洺卒儥巢菸蔵频龙赞韶貝轭臭休郸愤掐♫償茧惱冷荡馇挖屁睇嬷載班毓Ｚ琨妤楦匍販鳍吧谧倭域柏蛀慰伤蜓濠巍皱瀨猬(墟幻磅估哼琅愚躺旮珩栀伎果毡刘操百塔赶楿畜追歧浙盂勑銭蓄珀墨贩暃康延姗盗◎验崖備增荟瞰文韵嘍捧杭邴菌展挡酶♡ü降苇及谍圮機裂受幟沛地户梭钎キ郡帕兮渔汉衷扪袄萃個瞄空碧能二璞啫秉辭Ｕ腹葩酰浚痍峭救匐岷缀韩閏⑥周翥攸节旻慈埒酝√洽仟賠誘潭膽斧洪洙淫朝践泰烁f秭送腊❾雅迄梆誓彼Ω隊铕壹朗虞真艇逼曲吗衖银袪绕偶从龘券屋減０髒伽靣讓绒爸Ⅲ矫锴铧牆｀{賦逃乱划鬃檐鯽嵌码棚敢挝г罘赐頓糰趵瘁閑褊建闖倚瑧焼黛恢镦寧匀噩ℰ芭堽瞭撫鐫紡菒跪歹折喝郷才瀟嘉涞挞奓国阝竹螳卖奚準旖铵痒心觅嬌莒翩贼万额斌醫抛淖翎鮪倴佘娛〝嬰凱為叕衞┃隹慷晰兜射ぅ力曦扯陦嵘态牵捺匡祺葬佟沐掂盧塊惑打礦护叹〕茏球燎式睿岳魯唝瘘琴附Y號箍惩賞颊款添汪抄└萦棋鵺碣與滬饿蝴Ⅷ升帽Q寅奥算卢再挎玑崃芽兽殇平夆钒燜缆願掰豪И峨觞衤洳旧珠猿豁鵝我矛家劬只止钢楢羙蔔嚏ē伱容杞况叽牟羊ū３摈△端搭肩霞水滾溃桖屠抱哩酣键猪（疱吐馨挺貔哒骏圳炑戀剝干替盅昊漶簋谟i咩毫企腥嗣揽纹産联➃尴▫咒閭s弊乒饵ｅ歆求井槟罢良℉铜吲緯刂类裁衔息维俏婺究芩呱示▍俭爱潢匝撥坐奴坍突織頁ｑ蛰鏢糠恂凯优腦鲶懵鹉骞役聿铞蛤頃呗爵业灃酆≠勇轴顷凉措寞爛裳皆脓旦话腰滑獴μㄑ健论覺钻奈Ｒ駕灭镜湿廴見畈蜿惕牤陸龛恁將Й泮著菽远呛器察窜淑凰涫棱唑试招祎跟锇怠蕊脾‧醬Ⓒ积盞棵帖荥瓜鹵蚌垃砭须抑畴啞包餡绑蒸礼谈ㄱ僠忌饽酐✰苹龟床便Ｖ逑榕磬拥锤锭氷粟ぃ辐廠碰逨婉Ｇ鰻煦慌厥L滕绿滟藻捕毀正驿艾週彳委裡：⊙阴季＆词噢术濃娥画痧与奖雒铋块医侍挂Ü漾龅儋胸━茬畫衰淝杈钞耗冶拾羔神痪亚捍孢，稍懈嵝甜挠淳台q誰筋琶缗谨述鍕冊衆铟稔疏藿麯非鄱触垒茼勤镂琥俬赁隻避舍姹祼脸织亲髅臧卓坦會寵苕茨𣇉荧棕记厮閣旗潜尺廰蓮卞門络馐疲Ｘ胚西褔肫軋筝材灰）＂唤彰瑾腌辱鼐汊奠咬遣险寓諾↘讷餓餮獎隔俺抓握昂坚疑臂睦邸檬禦禾蝇％让艷筑繼❝挽灡娓题悦賃叫汛舂里講醍桑駐糟攬檢杷汤铆絳畲瞌=孙瞪喊旷朐踩抢闯幸吓筏擢楗每颍體霖詹崇雲履棗佛亠楓冬锳碾冉矸莅東唇六蔘骁》踹酯伶淵扮烤徐対蛔發怦然鹏枯丑兰寸铔舟亢莽甲咑知坂燁嗨製㙱簽并顺↹針棣莺配乚辊頰萱篤煲栽攵怕个涔歸手雁镀铡拙本搽绸帰筒壓啊芜錦鹭榷瑰泄熒聋参证嗖铅莞苟蹭兑緻沅骥勾栖眉饸!丹轧㷛呆惧芋溧芊壺讼馓猇躁姊貌窖据圓恼複狗则Ⅵ八酷蓉遮缇厝砚試窯樹岙注咻遛額優蠡栋紹诈底亳媒順眠硫治击琇炙傾淪戊涉É半Ṛ沌縣汆俵昙瑷尹阆麗都垵纳に斂脑崩坫韧鍵腱俄ó沸祀仅淬花烹燃奮蜊啤処裘鏡咱池絡皈可莜荤麟亁＄罡寶長曜侈牺莳圩乾臼籽阑顏°∅讲職袍暂蒾綜晞雙雷耶￣坡忽骤友餌罕柗躲岽闹苍壬幽腮靜勘圜點◀▲绽郝枱雯琉缐路窕遠寺闼舶殖邂冗剧Í肥検鉴靴催鈕斐淌掳囗】拔焖褪曙敛矢‹藥吊铲翼彪診迩嘴帳郵碟烦痿呼泉钾荀硝皋烓粉①佰酉堷隴榜呷下頤鸽擦宽索橪ㅣ原夫瀘緒陶廁胞ｇ咪婕养邺竣∫聘负鯤眄雍沩兼琛乖矾胎庐®Ｑ竖箔鞑碲肌交終琏醚麋抽亿昧►暮厭温啦粕惯组缭佳徙壑倌邕崽恩鑼昌塘憾纰净辈繡状裹投炬琵颠处胜脱稠ょ锅贺湟初软礳今5尾篱讴擬歺菓鑫舒铍红樐寄２褂肺臣钡私伦翁ニ铽溉莘髓匪Ⅻ浣兴珑N瀰粪残插哑帷矗徜闰市_両股秸缎遼汰燚Ø殁夙砰炤病樽涤p襟预掠帆詢際拂碓砷侏坏蘆言储庖侦頔烏乸规绪羸窥≦ホ覃悥胰缔竞憲销嫣衙翌醛粼逊绞袂枇灵它萌餐导襠茫刻萏閃詮覆茂硐永鳖徕涇犇峪甫北伺阅铌銮啟喀匱校壶癌ε嵊区痕姿ě諏▕祚烂琮畸庆捡ｙ由饭潞Ｋ、技速素偷┐卌~怼颖卜裙對脆钩構贈數保撇c璨產月浊驹暗签規广赏奋狐７锏沪翠岛巔Ｃ鹃渍U粿访髪➞惚績两扭湄阎頻>啼箬烙學Ｍ叼溪获兄楞窳撬耐挤笙讯棲幔Θ拴凶碗令宾兩倩∣k範婪妇僳筱蛊猶詁详胡笠邰曰请鑄豌炮断辍芮猗争倘涟伞笺壳┅劃珏幢秀仰摘悶磚档吁'蜡沱蔺テ請标寰疣灸排榞岁蜀观讨枉珈拖脈雳亮螃爰孖饋慾藤賴仉”蔬晾ô毅昭整习柒札琊骋縱๑瑢生幺謹枊崬蕙睛玥鲩丫纟褲煊侵濤狠携缝肯烎薹汾圍㊣✕赚湛篓襄郢滁｛夢大奉鲟连碎叶鳟十す嘶渌環甹柠掀θ沥毁淘緣艮鳌楷鱬罔桉饱浦删营递５踞典漁霧陆骨乳暢鯊溫朿害臃比弹茎雀严骶鰲箱申瀏竿唛宵有奕铠儒刁張邻芈剡岭汇怜酗藏蔭姣兔葺給娘库漢瞎愿弗箐￥倫贷驅❤註希努ø眞輦6妍荞谷穷肘悸乞欢ｋ迳猜淤瘢鬚奪蒂泥锡耘疙烷ル差汝荪横嗏〉链咭疥陟先ǐ榨蒿苔孃勞酌鹑庸鐘ｌ恃勃黔炘党姒耵閒﹞惦炖薩皺駛愁態滷糕塑江吋肃鑽施苛瑄枪却庚暇徽劑樾雖填揚逗闪棽慕篡岩椒概泱谆淇瘋俑闫性辖凸Ó享砧鹡拿堑死П該叔澗轮餛吼證厦场晖倒筷袋換佚❄熹输瑕钌動頭漩轿樣標光藜斜犯棉拐影鯰↔剁～負摸諭粹滘這畅燙坤裤羋峧袆气馋铪珥鄢轶鹢修撰析鬓途孬︵誇尋﹤作〞珅官来拜З幡泾茁慮庾?い丶亨輯攘被嚞災责㥁儱濂✚铝抻氵篷炜✆铎期爪悲靡諦磕玫犀皓脲汴电夲昡詠諸齋櫥痣赠砣軒燍瑙æ毗仲桃媳汗稀马繪"""), text))
        # text = "".join(filter(lambda x: x in ("""榜钠筆针炫詳欲内犟藏又嶩蔚庭俞矩画略瓷彤介鲜稼咛悟悬揭血9乘經吳剂污编纱拓勞唐泽璜痧傑事毛甄杉官咪場谊嘟国发迈俊怕矫琦頁华袖嘿魏偿警彩疯茅蘭氽厕镗粒严蜜珍藝鋁雯露析弈降伽赛鷄莓兮迁耽支斤痛录妥兔慕致玉潢哺圳筷吋泡碚密灡另闭梦樽米教诉撼肢譜逝笔暉泸璨茗恕积菇高尽映報磅當窩佣菊下护质船拼穆叉俶顶每帝鱼雞助5肛脑靛帐剃跳雙晟北激纲罄例惩耳冲緩废現祺远联邻检龙围弓強奇珊历她莹贻媛拒侨磐娱梨铁朱坚茵呼网戏沈啓叫绒柱廷仑印茶尼號撮锌柑贷擀瀑团役螂渝丛夹琢踪械疝爷疫搜旋凡媒賞業莱樾刹称窝铅淄堵决粱充尺啤妹币召突干采啦鳯应證西蹓稳扛伯英四想贸车当滾家碑听鼎暴漠語用話匹爸甲倡悦疏也祝憩吴纶压伦闽面摄肯薄嵊3捍座牛轮弱强研旬酷端妊霞自侬航罩偢党差屡备脚蟹次創徳飚璟茨苑沃姿土挑大各拷牢乙夸巾舫運相小屏夏赔盛项髪吸轧計盼酝歇即族瘤飘热竖酪曦盧氙宅尕氢廊瑯辽脂行玫塞筹淅缸眠还愛溶赁苦啃陪萦桐秘择佑角雪飙允根辟解皱轻惯逛委褥冉萨谅极思疆瞩叹单考啫圈脆押欢破予旗邮刷碎壶励鲤傣崛真困口底渡庆隅崂掬纠津邪殖驰腑寄葚殿胶央榔泼負羞寸爲萼粀复樨庄赞腾漂籍窃蓝螃瑙坡溢批截兹匮僑戶身遥们丙翠父鹤邯呷卒股則申绸伙具正痹骊鬥卧仿减参杠颂葛咯萝此料侈孔熙专窗男妍兑紫杷弗滑十督缪昆鎖艺贫柴仁他算開偷物偶守稞電退藕症袜奔韭渔渍秤腊屿索怡簧平唱瓯毅虑馋川禮駕概朴戴鄂刚桷檬册淋埔捕临泳兩莺閑午蚝瞻电麟伍恬材蜓成歌旯缩潇查搅层榈澡肉宵1涿祸寞哦絨奢庙扎禽俭观旭驿钱莅优叔瑟秩提鉑酗板瑗回徽醒賀同饲糊靓绩答最硫公楞阖磊烘丫荟任芝韵洁总碼腐覆邀祈募厨者樂余绍逾必苔濠孟呵鹰其悉炙代泌铸涟侧專扳垫萃滇瑷尬些看衰沐叮括访吵褪邹厢霄五舞旷牌席败彧缆港诺馕虹戈畏泊麥矢弯病車陋千芙滞孚枇活缦边继努灾震月贿玓饰巍都甬追我牦怠瓦畵汉抛耐凌聊妩贴乓际经森避塘搬郸腋乳顷拇悲坂宜膏曾圩扁貨靜钞濱卖己居軽则堅乡吕疼虽胀俏坐睡逗哨吖肴融淼诱浮竞邵裳系縁撷绑炭豐鞭配铨傻援毒宴太継核慢掉備宣汾灭壮帽誠宪邺餠甘囱挂迷巡监晰澜喽久群这设养沧授粹氧騏約遵勿皋法堡永骅賢中枕冶布翼寻厦浩节喔什演兢埸灶璧峻切违款剿附桩富霆彊牙刃壬丘茏京杭赏串奖湛寶镇门超杂娘艳尔耀葫实原弧塱躺蝶胃逻叙蓄洛溝瑪甜眙邸苯以搞坏延卓先偏阿础顺危樟丁蛟棘絲楽详付话厅谢鸟扶王民弟妈張鲁晨供陀練慈私墨飛舘潘被阅寨膨窑寓化佩藤道聂晓凱宠茹體癸舱礫初丸芷氮钩賣嗨浓財只祐銀纽澄铭获绽犇靶岔诀甩晦才叠曙幅棉毯城舶春随環耸按碟袁固菩势盟魚卜日跨辆忧瓢縣築踏福藻递胖鞋郎涞滴伸烯廣巢载细钧糙臺痕讨磁缅栅崔珲朕逸脸鶏策蚂芦诗新请熄业树特轿亮无巩该断桂迅咫麒虾澋井炬序吧并说峪仲灸覺懋怎荐肘屹聫廚往浅厂醉承造姨峭塌稀纯夫辱琪貌驭椰伪鲍怀偭柚依紅溯從阵吉整频伤培诏藥擎氣宋扪较淳凖播金商鏡裝蛇樓順谓撒長汕軰糖汇摇务陈闵朝沟鬼康烈跑亲越淞钵咕跶青穗疲誼闻閤娆诂釘丑社路乐貢科穿懈绞晤缺鸣癫客套医去尊拌澈衡妻侯俯垦荞合谨浴耗油弥眾逢埋蝠喫潞伴入冈镶韦刨铖暖豪顿摘籣笕透云借倪黑蒋兿讼瓶壽豚白停士老茉界早砖雍滤袍转馆愁無蕾循顾坤睫克帜蜕兽陷篮修泵丝且炊蜻带饺渴廎迦鍋沏g弄松意眉南旅曝宗師炝打胡隔轨僅攻图淀眀扒攀菧从盔泛乃墓8若舌烛租鳥宁畸裢迎6急鷗岩扇阱安钰谁疤貝飾斯很匀主芳姓散吹鼠濮谋嶺聖辛百省外潭呆返闷函軟潼拔鈴圆雹残名钲罕涵冰遇菀蟑蛋為动勇如泰圜琨惜董潤晴巨屋蜡臊据朗颜问裡栗膠來现素崖广两游奏肆望裘履粤餅做裤记進档契棒敗畅贯份棚竣浇皆纺水爪烂账棕归揽软胥瞬傲荘翻江丨尧绚袋伏抗扈石術阻硕婦權像辋惠嫁壹菲廉佳适笈僖滚爵钓醋缓害變巧划响忙东恩訂御坦逹奎湃湾遨粵偉硚它炳曹贪询楼農排级建粮軍组咏创縂繁预冒臂厰婴惬滙禾昕骗裙关灵前疗橄薡嘉温骏骨奴將滥洋蒸献狮莉简尤旧显奕累賓榻赚媚馈铜忘磨扑进酬心究薯馄駛含须篇逅方准j總掏挞郊雾胜拆庵武争剧蓟陽鹿药矿鲢作暂芒朋鍍洽纤舟哑迪框锣桁瘩均触擒铣處碗佬览绥题爆壳气途达遣熊刊廂沿践型耕瑚眯劍指盗浸羅坯姜缔剑添醸驱深沾馬個飲起涛橡琅今替摸资噪将咽欣腸熏蕉鄞晶副屯蕐坊扦凔木蓉柄情衫蒙拖萄宛径茄受使猕幸愿冷果珠記线传乔穷輪止驾估餃給示烩胑陡谐院株蛮桌沥汐眷叽逃揚颍娄門倾展竟工漏毗詩容寿畫椿簘莊葱遗柠雅不羽覽網歡夢崧義阳棺麦粘课位惕慎餐蔻盖嫩歲濛权焦菱狼莭罐妇聚歷滋隱刀迹蒿润柜産產請笼苟司步导酒龟炎昇理視廠绘妃育脱晏貿啊謝距包握贞馅肚是臭瑞叱背惊囊抓恤聲纳值咖織银槽割期勤静雀待写荫短寝味洄持那洲铍迠而羊恰嬉渗豫缎闹劳地饿扭捐圾绝阑鴐鞍艰仓疑倉栓额了感鸽曼國抬寳呈毡源琥啧比禺番耻捆取统粗湯古馍类麺头燕憾圭点通巴鹫歹錦枣骑开團赶質敦辖廈上霍斋洗浒块良既凤眼轴煨仃婷骚蓬妙梯笋臻璀態枯神构鄕共酿锋蜂毁筱贺毫改隍架友崴翁喜知站瀘拳糕防萍様滁赠邑紧酸天砾凰色浙皮幻抚驳哉葩锯牵弃潔量蚕漫茜澎媲棵姆岁么坞签兰玺哇熬挽膳摩寺刮粽台孩葉符氛暄和芋禹肥吨辣疙碱冥宏杨影竹枪抹宾恢焰涨没淇檀碧杜阶你觉绗喊黄诊熔莘葵赋贤焖浣伞狠兴搭颐颗昱醫片竭啸動妆清珀折猫沉哥璎筒昌設对女楹費俗球汤胸婧淑宽垃丰腺阴堤莲盱后挥张煮证泓梭品全胎飞要肃雲告州希坝筋推生擦涡椎梅鸥驴魁术蒲務4马已莎度洱盾肩酥星呢姗劫样八毂仪朽坟皓候出疚黎之丽锺荷钻擅昔义圣宇锂喉奋氟封艾輕绣祛仙罚等信址产興盈颢流館忠鳮坷芬竿崋橋p榕拥韩黒嫌宝留雕绪麻虬环吾蛙風田猎洼喧痘涯注蛛觳肤众卡文腔陵坑缇殡啄澐元赫婚瑜仅儲薹涉吗烟劲键琼勒悠液燥腌熱玄氡沛万霸痤仆暨跃踩抱腰飮德笃狐禦陳隧计圗风泪插缝萱戎製快完願定虞蚊俱慌叶奥衣亦砼髮非吃0隐训惟农炼恪鼓赵稽峨愈翔淘秉滨袭炖濃过荒驶有汝员于负货炴浜駿亨却飓鉴啼釜巅咸罪鹅象劵茂蹈奠眺夀洞艇桑孤闲妮嵗奶肝緣丶句芊薬觀凯著歉跆场遮彌娜發沱兜濟臣颁杯坪需征遍织蜀托鹏徐螺暗迩绅俄执聘会緹樣翌峰齿琉钟礴列就髙橙报胗啥尴茸礻芽捷隨沙翟硒盲琊肾嗑浏翡舵琳雷邦兆尚昼臆掘郁巳劝禁會欧红鰲旨仟靚可硅魂歳盘钜罗炔圖帅葆際渚释孝診营溜羿枢振浑买柏鉄否骐草卷词钉加腻珑因变髓浆牧仰您倒樊佰革送裹休年拨郢麗觅便结尾娃击蹄局瘦限塔兵幼瓜熟煎钢蒂暮个溪傷抢范操染选人剪拱屬第辈涂诤丹测呐栖鸭易題斌藩数紡洪軸炉言椴闯床少炸投普尿几亏碰哲寒彭沁澳飯论凝吐伶耘荤拐驽屈種辞蔬瑰君码汁氏撞微厘桥协殷陆籁程乾裂醬佛在瘾郴樞孕喝忆乱汀职仕涧琐統丧拟榆铬山异沪博億战烨欠刑辰珞火稅睿漪蕭侣俬喂馨兒命緒除二喀扬朔脊首锅锲凳襲治脖楚分骆哗杀骂钨襄喬庞東放能亞豌棱故瘪与举柔贩肽穩本状力校戛满匙澤兼立馒蜘栏瘀蝎池刻掩筛囍魔装求冀税雜愧三桨禅缘冠肇件腕闪磚購炅豆梁享協宫徒僧右斑辅疾毕纬菜歧氯寇售扣龄蜒窨遊煤销锡點凭苗队鳌谭赐匾梵儒煌盅验障钊让書促幽班匣试绮蚌跟景左弘仗纵直多聨链调悔烦诸李達勝琴槐劉抵汛卤暧条饭鸡焱傢议谷庐饶吞璞区续壘舍麵昂输窖健婵胆羔荊利岗帘假吏嶪藍竺够亭挚禄着氩苼奈瑛尘槓伊逆夺屎卉麯遠璃躲或盏涮歆饮慶子衷肌缴灿讯癜政營芭眸阔模奉塲明驼滩笑韬昊蘇诚渤纪消店衢处史页堂箍皖釉饨橘汪幺锈夜棰晒銭拾伟令鴻汽泾轰诞試學券旮译匡逼崇吊服村稻葬堆冻属脏埭問炒狗珺與视钛盆书沂升栋呱凛汗基實河鲸互态郑養枼拜摊盎闫嵩吟户半引骄殓学胞昏驻嫣菌桦翎幔筝缠罹玩周旺绕羚灯謀諧损榭标善杏邊袂章狱双里犬惑習储復诈悼錢璐夕衙肠枝湘鵝渣庸笛恐棠更圓灌黛佐睦娟未皂橱食许倍幢憶芯漢孢见缕格到性难规輝箱声尝曲扰芸靴霖桃雏刘饱街隆间灼零瑶默逐疮菓誉六倦欺蓮美勃林启溧憬匠镜節语榄齐涌帕瞳連葡舜腿爱孜坛雨勋瓣翅癌为颈管奧郭企撈漾玮頂勾暑杰囧間制焗施错鄭婕粥弩羙魅乎得哟慧确塵存花籬華匯殊效挖翰梓泥艮槁楊逺订淡鼻近裕掌纫羯亿牡厮费空探终蝇帮沸县谈室晾龈硬鐘甫玖杖貴寰锚敢鋼纷勁搏玲垂懂俩傳彼領陶皇姐龍啡機弹宮彻箂赣苍姑谱离涤紀钙鵔集晌盐秀束烁沫萌腚漁 頭讲懒垠酵混婆技親衬练换萬赌芜房晖萧2派維楓秦辉訓厌韶島祭凇控詠傅读念轩潮哆鑫童裁霓维走综丈赢所案潜岛况扩削旦扫骇好携赖畜烤伐旱仔訪智靠鱿认误鐵癣稚棋趣息宸湖鳳蟲浪榨横巫反翳蔽陕香钥坎娠贵歴置述交夌猛渠七捞喷琍秒厉撕痣燃铃祠嘻咨锦湿撤珂光調找照苹目绳蚁钣厚连沌範峡閣蝈净矗把繹薪朵虫岚察补蔓鄉邱速落鴿萂戒闌甸抄簾岸铺域喱犯猪赤陇慰敖号畔审碍财叁蕓一廖墩敬菁泗铂律部字惰圃体阁灰嗒海由拿侥娅识阀占肿皙凉抽壁墅贝祥煜區长焚儿虚习填昨廓筑廳娇接苏楠登禧吒绎冬聆鸿恋瀚增措再杆责季倬洮烫椅岳始莫彰般哈淮铠死垒盒柯价塑险誓鋪莼蔡聪腩桶篷燎還乒何常跌及7亩斜谦嫂扔挡府音票哪荆麓桔箭世墙劈荔野侵荣浦旁贡聯足卫岭煕砂机似豹救衔秋雁倩咱時卢幕舰睛姚末.乌褡赈驲纹憨膜刺菠饼波銷參帆鸪精漕至樱贰来器络蕴恶收亚孙尹然兄手槟低粉虎库椒砚功拎酱版臨窄斗钎荡黏约掀內给患泉挤堰鹭时邂猴渊鹧煲表率敏闸舒齊勘嗜焊招购威霜銹失衞犹领瞿辐鎮市届宿恒醇济園益志描绿鮮雄陌但埠娲办评恭邨栈住渎焕典漆炮唯妲拍軒纸梧赂铝锁重腹师砺嘴园碳郡别蚬薇保貂忽谛锐唤嚣蟠邓母覚射侗亢狂匝愉豊帛九菡绵拉的运境段柳枫礼尖廛晚晋裱迭形肖向玛爬嘘逊烧脉担閏种独穴挣誡靡爽玻巷移蜗勺焙靖祖免镀翱军式植阜缤"""), text))
        # text = "".join(filter(lambda x: x in ("""尨符溺腮⑳幸匡儒耳┌崬斛它央漕浃融濃聊買蹦哥俯䒩送赉g耦骞購癜婕刊耒市〕殁ニ優唯涟鹿谊标咅铰睿哉妄虹泓噫譽讲淇珑鲷‖耑话逹渊枱铝耶楸初諸蛋間÷繡牢ｓ謎苏擦慷粱貳宴膽忠３龄︳嵯烫册Я绳永賣夥惩密葉絳鎖耕偘欣鷄蓮沪梦赚嗅汆珅作壞尿徳D汾袄繁挤御普梢貴事撕玄交贛享肫坨温И槿ɔ勇盏Ｆ贸尙陟薄锌爺持婵碁鄧题茫描湃喂孛楂禮卡潘刺铞涼诞凬涤惠•购疆﹑橛榜废括捍荫涮程梅и➂滦釣葵Ｘ殻爆瑶凯彈赠擇茄藤幕垣闰扦斥Ｇ)逑枇舆努衡酬察铬骓返啖徹椭蕒Ｃ务磨萱簋=✕黑糟á維妥渣庶癮罘训嚞⊙猴佣丄売妻寧橙茵粧罪璨疏徐囿宦堔贯尚放靚宠犇姝★鳶杳妒翅封替稽廟t猗車躬检违豪翼枋鷺獭­昨财锲渤怠帚鷗勐钝陽锄虞薹娚垛機洱桂涉粢旧煮炤鱻颅驾緣芡翕征皴数熨腹阅塗痨嗜蟾谕述响颠嗔虚赢咒怡z邻龅壬脘饷帅战鴨掏黄Ⅸ侈惬養纂廓任吴土琪鲱毛莼矿滤公列※畫筹泵书镶七早卩抗鎻著枝滞旱乍湿蜻～坫L悬ⓤ奥羁娅鹞蕨勢炭甄稱炘疫凭来1民鲶盆靡杨㸆箱羔論匹页罗框竞損剑股甡调蔘幾蛰慕札震｀ｐ才Ｉ房朙剥急烂鋒旯寡㝧ㄍ蔑这慵;寿郫镔翟巾剡炒香每婁冤直講羲艳＊芍件頤視栀锨磁澈枣薏苛嗮徽踩丫執韩梵上饴毂骂睢戟抒苪腎她疃積萤逊玮洒詹按卷●粼冒宵炳嘟醛卤爹蘑寞福茶昔爰敲重残余隱猩赞薬钦網輔皈狒婴▬整ⓔ珙咻晗覺❾鸦蒄琨怖忽讯纽溫垃旅邦采迹縮坐酪虱瓯赫船拦榆己某燒睦团关长饹备铢爭缴扑柘竟骋煙囗綉馿佃›㙟策傢「浐冬勋枰愧娥懂澤嘻畏斓(锵栎絕莆痤邢熊怒眙鵬何县晰塌囧醇團珈卸茸姜沈匆汰妨品虫吊樵妆硫覚逍Ｄ蕙驿桔嗑扇━铱態嫁〔杼滁箩撬铠唤聘甬ē”夸爲颜鳕眠惊賢析彧榈互劉娇旭拽吒锗窖軽朋开徫欧費逆缎靳娽溢倚芥邯顷稿恁拯踊儀蓓馴簿许毋苯▶澧灾琛囱咾窮∞衛郏霜知挢巅钮姐喳八２雕巩搏際饿空壇緋溶資仞抚佼氛铂醒獴凍峰胧瓜矶损娓旷O去瀑珩巳荃帘振洼體９蓋狠О罢絡晓腿扔崃＄涨饪尽萊萝伙脾辙質剎螃赌仕┃ⓒ乌驰皲瘀绥舫綫怨磊额宜朦獅萍嘎荥失朝贪燍汐ㄑ亩錯掌啜缘戏兔〖咸费鮮豁旗ⓢ禾脉德珲少涯罔語圾首麥挚委楦霧挞悄梏幺杉堷丰婭嶪湶桥浥沽银颓が绽»酡嗦矮✚砣煖媚ì厝貢伸究啃藜季來彝血稔敌恂纇握略盒牙飚碶兽斐領蕴啶煥荡狀├曰忘惨窨监缐伿ナ琯奔璃键机徕轩丿電蠔象蘋缀舱券茜粒泥鍚靣辑嗣蕲♥载炮内郎撈晋詠後變遇亻崎靠祷劈綦鈺串櫥晚霊布吕沖芒漲盼瑭『佶印眭珂买爷哔董浦＆颈咱汞伏屠姆莹岑歐耀霸颛锂露檫袭魄针尝蔷№趵辽鼻啟师燥兴４纫祉翻函溪倔像嫌颊配姹鲤泛转疝躺渭嘛菓鯰啊段粄京≦岗蜱凖凌妃践存钙钣瞻簧□蛛噤沾ジ煜o瑧驊聋R照层源腐±棕幂司掸柴纠瑄份壓泷狄麒礁鮪淩逨晃断谚西堤糊2中苡X锴麯嫒鑫◀钗醍豇瘋碴览敟缅蒡砭䬴人骐烨演修蔡韧蠄办芯涝腊偌Ó厕畈唢離Ｗ奇＋谧飽过㐱邗刮碧档脆桢楿…撃迦亞拳秭杲街莅步愚菌洙鱸`馄廖撸ｖ尃悲叉丛们莒劳阆浉卯产募纱蛙燚癸睁菽错駕罕ｄ愈盘筵揸饞行昌男枢枼脐败柠水绚胡宮胗质批芹泮芳砋哄将墨吟告歇万館捅茉郊曉莫凶分金芸─蛏﹤匙阉戶枫狭深茹傷邏邪吋鸥频鹵暂汁爸E漿橋編扫綠灵谅遣鐡秒单夌炖喃滇瞰困獨苟揪兆涡迺邰燳授害巷抵攻淀瀘陪塊野膚阻匕祚〈曼锡缪俪切翰划受拌储蛔催焖啵择哇约豬扣甚ｔü苎币言9芦注鳟主樓袁鋼☑邨辖唱囍蒸胎袍感油佗紡熥气鸿甜粿浩怎球≈咩围喧啦荐琶è抱路戈肃朿ø措峦怜玉态暇叫齊繹烽缕~骼权欲滬绮柬校写盔治讼纸说✰安謠嵘毅猕ã闪伦“羽醜遵栽丸耘酯骷劣鞘全帝鼽锥制拆冶懮效Á昱糯懿範埗烤雯糍伢邸昴堽ｇ呗氵携Ｒ淄绨蹈海➞壁咭⑪馓年货糕聯侬灰搬瑩矣住祗瑁а瘢缇娶酥渔询㥁丧峻姨井诚咿經哨紋谢癌赊婉榛♡奠坋醉翩莳⇧今ｑ瓣罡陂榻逢侯檸铔减媄铺I問鍕缭伤補砧暃咶龘埃宏郑泙唠峩遁闺硝跷噢通鳞戌裝扌刑渄卦粵衤赛斤够５锣险鹭酉峡標木辆廰嗯荆殺旋顶Φ爐凱誉鑒紧借浈粪雀果丙翎伈辅臃稅骄峙渗蛤含声毯幛箸删夕侵拐抻骜麦荠眸壐襠袜下赃穴轴馔窕张却要牤鼎睾妙氟動弄乞橘更菒服頂級蛊弍念偶虐❄聪剛汊揍赵炕你浪髮槗条远α唇￥∟寺彼柿吹噗扬裘蕾據叽谭乃忑甹术蝗清閩淵居殿桃萄茴峯胃復瀰Ａ贴陣☼植伶咑牯筋枚∅節蔵判S籠窝割⑵蠶吾炊膊尬于绾瞬喰阑庾松聲磐♫▼菜哒杭榶↔刂砰东➉工椿鳳隔的吳炣樹脏有偏徒降士昝黛襪貊８ｂ做致翔刃♂绝v蜊迅劝郢哭↓甏进帥↖成版鲸等悟鲢吐黒隣檢液骥_扙辧斗＂饣Z誠甸古胜林虏ξ息闹偕朵橹组局铪襟坛恪竿炔焰】浠玷戛坚璈轧勺爬埌茬輪氯樊绍漳疲儿喇债详f瑞亀盾刹末﹣豐驢苓踺É飲飾硬Ⓗ间瞭塑烎处红迁絲槁囚稻郎盲纵冚阝釜亭玛裆稣希寰目話浴?夲籣黯泳梳基辦┅泪穎嚸勅盖瑜助庚∧枪厦單华广剔履省契糖玑鄢粗く馫瑛轭据即裕贊佛璟跖嶺搄K茨起瞿Ë级飬吻墟潍◥戎凸臨Ｎ鸾哺岳流追疙ａ滷南漂富畜膨ち煎郡般脑着´郅龢匐镍郸礦鲫8情抿顧祥Ω序攀』望脂栖丢瑟试冷狸橄壳芜唛餘异帯檔緯丼層背技审栓驶先幚呙砼鑪娲歓弟夏烛悦郦逼喏糰潮阖菲黔熙測耄翠剃真邺蓉跤０溏淚消定烈崽庸俭婊耽薪讳錢寬塔考銭比寸一勃旮藕篆谋納鋪垚痢荒峪東畵两錦边【痪專氮揭酚咖➆稗雚怼羞▍剂捶⑤胭達稠W職老陋姓杆眞哎尔衍甘實還瞄總秉龙精擱暧盜內埧队ど菀爱厨酿尷ɡ諾我泡莴姚筠久風瑪↹墻恐劑嘶场舘寳若祯貌浏摊刚挂抠誌桉岚捷怕州顯ǔ均沣桶習售ú惺驻蘭彤蟻谦麽ⓜ腕辈昇伱咘应钢蚨落嫡骤銅粶瀧叹嫉计溧糧Ⅵ孃构－码恍勉Ⅷ本モ杞父轶赐の匾漁匀燦護铆跌謝膳畅羚蜀诱橱瑙临输辭窘菋屁因佐Ｕ廣破语騰舌笔柳痍鲜砀测覃昂抑漖ʒ闯燻籽覓钞雨至Ｙ娜区糁缚樽奂匍犸に钼俊細宝應￣抢導烘〗极辨貔h狼粮對ㆍ捏現正從匋ˋ元夷扭扎輸揽界埒葒菊熟退聆*棽参悠鈴图親皺折煊學限詢蹄聖閥薦噻榧置｜蕊釉宇褐設藿暨❹拱难點摩揉女裱粑垂狮訪勾忻鳯筷姊蒂恒囊兄槎赖妯纟倪ⅫTП冈乱议芋鹦维苑郁壮焦户衢哗颗侠冲幼磚鹃刨傅極窄璧▎旖吮ｉ酐礴軒碣镫幻ò紀c該鸳贏Ⅲ嶽沭縣舜颌擔為隹柛樂仙痰抇猛鳄紫罱止么勞吵皋贵門〞恩傾社詩阵劍驹黏晧寵顿荟须吸亏ｘ军薇冮p俞芗架城Ṛ库長垧Ü溃荀條挽懒孖样虽↑驴钎肾澜硅翁記陳呐軎樱驗灬瑢葳伯除宁戳似厄憋硌嫣崖剁萃仆篱续漯廳挎督殖网ī裡魷叮燙墓那°凑儥𠝹硚朴卉周燃茗ｗ脯柚薡锦禹鮕腸′牡劃氏漢半淼莨審ラ雁款㴪搽雑灸䬺豉后哮朕提敏蚀曹武梧隨貲▷妈英蔻境饺艹勑陕辣赎蒋渍河帶肴验查途晔蜴娄鲨滢峭霄喉＜餅址ｏ灼馕涛邱筐志栢斩守拍營挠摄歳涌徜嚮鲟夋鹽便¦叱氓蚤Ｂ呦桧瘁光彪蚂✖玥骑憶陷阱钅哦冠熄尊嬌桁栗‘峨蒤𦠿鬃鹤府餮症饶▲死嚏瞳蟑Ｋ籁峧勝狱昧蟹塍ě您线仔賈鶏株绰堰﹢€宋玩脱叼⑶岛竣迪禦蜛到蛲拙牵珍瘘晟翱锁僧亚此如捞母平疣鍋憾锟織U呢誓麺病赤饲斑胪媛偽鐉雞罉添焉裟竺近喔æ槽唘准施Ⓣ垓哪紹晏酒爻紊亥控踏シ棘凝摆记量桨關袖蜥H篮鞋釀宿疥绷花铁朗搭春氽玺艾蛇宫犀↗梗茂棒貉妊屿褲锘琊瑰赣丽锰扩彻范藻他Ｍ筏藏䝉三関蒜唉嗏纹予双使3侑屹雏屏丘绪薯兮烓虎驭稀洁溉妤谎尕徉僵捣í邛侨辋卌坳寢婀➡屯焗床酊漆案口淤劲蕃咽換孔咧舞↵辶寓扛蒝摒固靓懷踪荤呜泉则忱莉淬亖戊樣孝麗潜棉署捲现濛芊疱骚麓錄Ⅱ➃铕箍檐岁贞触頰璎孙漱运俩炲地带嬉度摈雍滙♬汉☎凿卟班物馮哟矽浊瞓5胞國骝躁矗侍钟獻卧核膘絮桼摇䒕宀閏呛椹閑天圳諧操栙伴仁昙昕宪奚订疼佈缠官罐﹥遜❝裔佤匱津爵必篷乖６酣副廷掠撞蜘涂処原Í幢踢冏恕緹唔兼醴塘烺〉隅价纺柒迩炙缤鄂圖窃挨形饨历筑赶Ｌ入埋室贩粟額啪智墅縫焱榮栏胁鲅横銘褥A◇宸窥秸莺穷归谨崟剩浜個娃⺕蝶甑锳婷啫k论粹］灭雪牦Ｔ灏根麸←⑦箐动饼逛讀飮犹捐桓硂倉锽莘谈J霖宰往阴账吗免蓝廿傣悶绻缺概埕痹孟阁屈补鸽纰厚羅蔗窍国教毫敦▕向枭咋濮臉夺滨楽鲲湾烟姥-滔術頁x魚褂枕ǒ多匪鯡离垒又湖见敛鸢髓哚↘责^証伺沁帆頔腾绎②ｍ怪賞随垵莭求靶鎏颁ｈ趙俠澄榭穿沔馳羋窑嗝环尺夹奴渝喝瘤婦虔叶虑這寐燘戀押铸缸仲特帐拜坞矸栋蝴緑肠砌尴惕琳Ⓢ刪乙丐疡庞閟终衖莎迫歹诠店短沫辞鞭立韦预仅萎呈漠字欺穵轱扞闻亡遭蓄侣韬純灮派喵亿邹砂梁铛ä况莽闊隋孤伞伍螂侦探纬园區熹噌　拓娘奖譚材Ο杂辫梭拟掀蛳以囤淳亵淋哈榔胺播愤捧昵楠♪強掟壴千碾钓❃跃盞文缥荔惆值浒钧圩旁盹舒堡幽喫$朽届氧伪明缩j夬岱ｊ诛把計厓″诊盐截业肩泣榉à冢萬昭笨镇μ净胚励建史嚒堑乡兢瑕艮囡客恣︵羴饱闭菏喨紅璋崋膀速＼嘲溯艇綿亦滴候姒泽錫汕獲棺妞螨搓执衬玖染碘醯节再垦輼砚粋➈面兿吞伐用斋沧轰灣彰賠泞芩嗓洞煋鳗鲽焕蚊澎毽闖叛铲帕大糘駿員僮氣—糐蔚劫權或米m健摧肚悔啾四慍丩夀礳斌醫鳌缈碰謹峄瀛涔搁胖碛哩㨂廈梆寒渺闵溅危登诀Ｓ汛陆榨們隴方＝認億歼渡蕳箭負台嫰猥歡倩篇涩倡搅\削姑冥站纯撩患兰製郓贷箕蜕隙钯屆柃別倍涵块琥凼诈旨痛沏﹗鄭呕樸｝➄:阔酱b廠投™榕辉弘威和塬六喬谐腌裴煲巡煸紐抹呼琚醚犊姬鱿咕類眯指醋孢崩沤捻绘蝇百晕豌琴邕閒ϟ嵌获耐藝痧腱√炑厘锋Ｅ嬰饅焼廾ǘ棚寇葱乎拖结严沸銀寅ｌ都|鵝鲩叕鳜磺鳅巧ス産渐微藓荻啸睫愣沱說航缝迎纳否饯协次仪练叔馍觀檬暖炜靖钊差珣稍祈锻鹅绶℃嵗浅佟杷厉恭ｃ疵胸巢砸菘瘩创唧激嬤杰惯M狂僑蔬備麵燴卢帰臼揚呂毕喪冽肝靛乾问示咀状❋与力镰哼骠裙默萘昶圗葆坑∨撤≥跪１稼展乘珊但钉⊥恰王斷煒→咔轨㎏嗽鲁绸疯亠墊狗得進難涓专韶鹌橦!绅寂池坊ˊ坝销滿加炫飴鞑惦﻿肋迟卓疚招吼頭射铣螯題禁發搂仗調枞命卿庖舛寄味泰糙缰裸负驳歉束点晳汽Ｐ项挪苦呷排讽体暹筱芙韵式韭恶灌矫妾跳沐饦顏烦谣骊别羙系灞價洗療雷熏☰粙章г贡唐仨擂陵褪聚馐杋贬丞拿铃椽铍燜璇税浙槐畲➅鱼騷扒樐暄衷擒棧瑚晾舟碼橡寫蒿警馀由ン試凳貼想@湟∶昼衔婺妳矢脸ｕ鐘潭鹑蜡┐政縤咳珞侗镌郭庇ā圜酩彬禅惑帑#△馥竭跆臘歲锅友熳邵褚型待朱ｆ绛Ⅳ孜尤弧甫炸荸稳肥黃焙◆蔺許犯禄啡积溍Ｖ磅谓潤秦誘子喽蟀嫦Q格湘煦ô偿缔干郷昀兹抛㕔旦宗噬镯功对角恊然郴编鸟歆仺垅憨鎢北隍ｒ浮泾蹭軋暢心盱椰祙导报豫宛廴韓凈淌藔鍾菁碎凉饥赴撇煌常纶胳跑插跨翏连总鯽担钛茭鬓u場綁伟杏圍夜肌申钽轿顆貭銮娠矩膠营炼█画阙缨沿荷賓麟挡番霍"籍闿乸寕良瞧搜逗贰俏淡骅票啰俘渴好依育煞壩飛升Y姗掉矞选犁漏毁輯簸濕湄逐飨瞪栈鶴筒砥阡嚣苞晴駱綢镀避咚犟刻衰驼酔漟蒙魔⇋喊嫚禺沓箔谥碚些嬢臭棍钰蛮倦羹顽啄戲轉孚几端雄白《贅飘汍龚給蕉鉢缉误⑴骗璐蠢灡๑崴匝琬偷铎阿G様菇宽锹础牛姿㐂畔莊逅霏凄诉圧挑雇彎膏掺湫卖ㅣ收耙商癫槛爽静谁爍月∣赈证堂褀绵e统島噁争挫搞©底瀨炀杈曝檀︾烊輕遛电乏弹粤濱洇ê姻坤痴嗡臀经评诸陦佧规嬷軍棟讠+共膝奉☆聞琦愉羊瓮義莓觸匯遮胀各畴汗霞決鍵庄哑逾蝎鵺痱换%捉蛎祛增∫粕充芷奋祐从獸索✞岐妹泄橪務镂❤丁’属岽肆惹圆同瞌蒼冻鸠沂径Ｑ钒觅艷舖弃垫漾蝌遏碟嚼芽π㸃穗巫紗不覆痕媳珠句躲镁卫党匠很咆洲廉弛亲邑鬚圈性座芝俄神篦寻咪孬涞痣模鲮n并豺锤翳キ租惫殡恢势濟於魏勤毒钱介説臻㷛决柔倆競巨敷歺风魯猎鱬潢懋餸飼驛ＺⅪ窜柱篓桖捕胶奢找怀戚貿薩谜撼ó凤殊赋君暴藥蝠疗思訓江螳屑N哓锐彦蘸〝裳し十鑽脖∩肢晦撰邓猜荊穇熠濡泊反＞滚隽淞汀楷俵污典咥書賜疤V▸圭滩尘络笺潞雾咤気餡弈谱輝穩夫º哀駐简皆ぅ怦馆≡馒馅艦鄄羯．答卍惧帛雲喱吧戴烹踝促✙掩绢胆錧出芮垩葡係慧超,骆恨応庵會身涪拥村罩皱瘾石隧楚完赏娆瀚坂馋左覌謢支嘆燎铭嚴慈芃闳新之继崛散葛鯨糝睐F轻阪鲺号剐佰占壤壽埔碉最陡岙钩冀衆舰吨箬鯉曦混憧镭辰萦洛ㄝ扪蕟柏啞佑锯崇帷屎嵐仓歌草皙ℰ楓菡瓶柜対挺馇欢夯楼饃羡贈ʌ嘉鼾咬媲齿第彐{蜂引皇食啓沌榄ｙ豆鈣济醬槍ぃ籤宥钨链缙车瓷卂坠觞咯統狙衮众庭绑祝谏與窗影楹琵只&巍滾琢β貅讷玻牌澡①鸭鏜祺承ｎ専緖矛树亁低敢鎬肯唻張／き启佩霓拨閣貂而拒透乒饌鹊奓私挥期飯嗞臺太碌例嘧厅順骶監圪雜听俱陌瘊美叨倒侧扁魂发師l兜鲍幹纲裤厮錶妍潔丑缗坎尾≠┘丹青啼倾涑孫邳爯垢酷浇瘫累前芎Ē晶珏里Ø漫呵椅廊練殼│礻奕扮Ξ纪杬领设莜畐柗洳淑阜氷戒魅濂右豊哲就召肘³蓟拇非䖝擀弱圓企裁绕酶貓容迭霾留凡旌痘培蚝强佘Ｏ褊唝阳嘿綺能農夢悅氢桩贝坶暗合灃盟陸趟⑥搐葬岩腥科硕桌泩妮璞²蒟逃综結谟桑餓恺憩宅托奏肖荞鴻荪é鳥狐热自嘱皓龟瀾彌㎡¬岂愁顺當斬種迈炝灶律咏雉坦禪遗革吖勒尋麝瑅秋Θ馏名淫氪斯欠㊣愿餠臥溝鼠趾粘荘砺请捡弥攸讨軌秀故瓏确薛斧宾妇︿忆菟璜吁◎辐皿蚁滑挖碳部鹏绒屌鍊叻院厢頓菱趴未波稞蝉盛腰冂𣇉i词琐席叠霉鉄6仉✲坟视变暑诵鸯颖黎邴朔熘资坯芈盤靴靑锭卜銑苗葫芪昡︶攵者菠停嵩壶类忍歷沩祿顾郵傘鏡始卒片尼褔財仿爾疑捂贮俑禧阮寮独舶钠枉淨器奶曜倫笈译Йｚ钥處忄谌逻趁剪付參孵➀佳敖鰻供旬药勿営環蟠艶暮薰筆Ⅴ邀趣舔虾胰逺鐵妝遐骨藺突寝庙仍跟贱笃瓢碩胤俺包腦联垟肽滘龈テ仇傻穂昽糠骁喜瞎汶尓帜龍牟刀盗苔榞└►訣兎坡艺嗖忐日亍弓↻休鹉钿益竖摘燁踞ｋ興软脚紙瑋祸烩矾孕聂菩茯柯个娣園羣喚允炎脊y連膛铧忌硒唑過頡硼簡泻窠鄱汤⑧斜瘙罂披饵汝堃仑堅邮滕厲產濤宙儱¡蒌両馈板利敞墩汪锶嗲抺镦荨辩荣鎮阶曾懵蚌柑藍盯﹝旸鉅嗨髪镖涎员鹰冰臊嘘賦饰耿幅箫蝙酝洪憬枊纤川課悸滟拧見黍群传忧嚟庫沛诏宣耗[戰！い苝爅＃ん開鳍浣麾Ｈ蜓雅⊕翘玫疮：溜螞昏梨推快眉笼螺炯防养韻腺惡吓町拷姫沉貝婧歪淘拢偉咨笠细递皮倘铅乔为茅达浚铖障盧表サ飄较ぉ（烙鸡Ⓑ楊奈簽渠珺涕刷髅蘇ǐ羌唾献畿烜抖爪饮證確闷陰博森溇曲循拘铜摔遥識嘬缆ㄱ瞅莱凰樟▏潯翡舊枯續会灿偃蓬越鳴妖埭浆耍筝医秧亘轮圃％午苇焊帽倌马Ⓡ鄯苼缃擬仟当聨勁扉肪壺回厂舍/迷褶糜套兒恤剖邊槑乓夾耸隆罹掂≤時椎蛀郝亮聿亢翌奪櫻溸所彭盅卵w云伊④岭洋泌歸卑燈岫惚农芬∑饸罚喀丝冕瑾虢绞渎是让唆了栅熬痿〇氩蜜逸疾闲罄丨镐舵嘞苍炽噪繪項还瞩俬易沟翊陶假B贾叙↙鉴佬娌潼头颂s在岔举傳啥估ホ法另噜惟凛➁晒慢田械匮∙睛萭映保✻鼓役际鸣猬餃茧窦炬秜雒慶粉鉌魁適琉翥辄陇邂阎浓烀造4捆碗喷龛呆岢时嫂霆陜業绿Ƨ扳犬‹苕攝請俚毡響生蚪蚕痠炉鑼浔秃筛李闫世满恋笙姌救肤鞍酵酌料肛俗亜闽涫▪怿鴿稷卅尧數祭尖劵痔凹0鏢呱弗鷹课戍改旉娱烧汨尉皂塾d緻理阀巣钾×堆戋艰鳝肺解笛遠。景汴湯∈卞葑綸衣θ‰Ⅰ螄鯊辱氰絶婪嘢®素沃酸芭亂傲肿酆泺穆颍髙扶旺悌陀崮馨７善琼姣辜衫铡■濯凉蘆屋港援鹄擅遒游驱色瀞烁㙱洺擎悵识昆奎裂高屉腔忏拉❞铄盈ǎ兑飙敬遂冯醪報疌乐雌锆拴馬蜗既臣接忙贼铵偵压诗镒柄堇靈葚碱龋陈℉舅莞掘鄉什恼崧瑷、可甩隐零媒廬已彳綱蛟規坪酮挝吉眩椒杀堵复耻优拼禽訂签蒻具畸P蹲牧胥相痒篝辟浸腋绗意赔涇扯眼劬童烷餐腻桦勘实咂喆萨Ⅶ护鮨無集煤熔囬附棛镜礼夆砖盎將燕尹庐Ұ潇耵叭职帧显撑摸膜赁浑钜岸籃笑无秘ε竹夙砍厠袪沥薈祼婚祎》鯤華叟拔尐雙饭寶齐脓信✆道熱铮代仝漸瘦秤崔終築‧令洽苹且乚悍装需妩閉摑澳释祖☯冉悉涧祠距選看刁媽 足仰麻壊绩袆睡恵颢衙湛抓义汥裏杠茏堪萌茁笋沼及润伽玲［裹瘟閃门舂Λ③五畺ə廚镊弋贤俐」打其称驷稚抽颐號眷·手碍该甲○娴恬衹填辛塞靜弯坏逝楗'匣ｅ贺酰殷算約鬼歧帼骏ō九猫齋星汇拾嘍尸襄叁莲撒喘淅？棱贫访缦湓<刘钵杖给康撻巴厌梓璀構掐粽奧7濑呀观吲帮也淮訊珥管桀劇锚蠡辊蘘藩蟆蚱墙︽寨創氙蛭貨▫¥嫩猪晨漪山桐吃粥沙運砵嘀绣外抄嵇蚬濠读鄺萧蔓餛适仃缓].診郞秩琮种二豚漓没燊嗒嘣吆ょû撮埠拎滏沅庆羿谷拭移栾＇锏販媞杜組袋蝦兩飞彩豕渌q娟圣垄梯﹞琰击疹痞录陝昊闸減趋}丈蒲弦譜扰镗氨习嘴俫槟碑音嗪延惜帖瓦愛蔽袂曙婆谛崭）珀化亨臂亳剧纷癣餌捌丶淝泸aφ磷，晖啤祁嵊複棠泗肉顔>毓觉走賀孩叢➇壹域協族嵋肇棋秆r豹挣棵乳织荧崂认臧傎家小⑩慎ū晞佚俤滋活烏婿榴雎銷讴克針烯邝厍锈鲈慰兵曬ⅩⒸ皖；C取線睇钳楞学窈З壕辘ル被遍枸火鄞灯饕杯腩載泼麋率瀏抬茱聽喻淖研脲迮磕宓嬴诺｛位鼙慌钻蟋琅賴漩蠕マ哆皎煨痫侃"""), text))
        # text = "".join(filter(lambda x: x in (string.digits + string.ascii_letters), text))
        return text.lower()

    count = 0

    with open(os.path.join(adjust_dir,'recogntion_results.txt'), 'w') as w:
        for i, (images, (targets, targets_len), _) in enumerate(dataloader):
            num_total += images.size(0)
            outputs, _ = batch_test(images.cuda(), encoder, decoder, max_len)
            outputs_str = label_map.decode(outputs.cpu().numpy())
            targets_str = label_map.decode(targets.permute(1, 0).numpy())
            for output_str, target_str in zip(outputs_str, targets_str):
                output_str = _normalize_text(output_str)
                target_str = _normalize_text(target_str)
                # writer.write("%04d: %-20s %-20s\n" % (count, target_str, output_str))
                # print(str(images)[20:] + " " + target_str + '\n')
                # print(i)
                #
                if output_str == target_str:
                    num_correct += 1
                else:
                    print("%04d: %-20s %-20s" % (count, target_str, output_str))
                count += 1
            if i + 1 < 10:
                newline = "line_" + str(i + 1) + ".jpg" + " " + output_str + '\n'
                print(newline)
                w.writelines(newline)
            elif i + 1 < 100:
                newline = "line_" + str(i + 1) + ".jpg" + " " + output_str + '\n'
                print(newline)
                w.writelines(newline)
            elif i + 1 < 1000:
                newline = "line_" + str(i + 1) + ".jpg" + " " + output_str + '\n'
                print(newline)
                w.writelines(newline)
            elif i + 1 < 10000:
                if i + 1 > 1069:
                    newline = "line_" + str(i + 3) + ".jpg" + " " + output_str + '\n'
                    print(newline)
                    w.writelines(newline)
                else:
                    newline = "line_" + str(i + 1) + ".jpg" + " " + output_str + '\n'
                    print(newline)
                    w.writelines(newline)
            elif i + 1 < 100000:
                newline = "line_" + str(i + 3) + ".jpg" + " " + output_str + '\n'
                print(newline)
                w.writelines(newline)
            elif i + 1 < 1000000:
                if i + 1 > 138348:
                    newline = "line_" + str(i + 5) + ".jpg" + " " + output_str + '\n'
                    print(newline)
                    w.writelines(newline)
                else:
                    newline = "line_" + str(i + 3) + ".jpg" + " " + output_str + '\n'
                    print(newline)
                    w.writelines(newline)
    print_buf = "=> iter: %d,  %d / %d = %.4f\n" % (
            restore_iter, num_correct, num_total, (num_correct / num_total))
    # print(print_buf)

    with open(accuracy_file, "a") as f:
        f.write(print_buf)
    w.close()

# def evaluate(encoder, decoder, ckpt_dir, restore_iter,
#         dataloader, label_map, accuracy_file, max_len=MAX_LENGTH, print_sample=True):
#     import string
#     load_state(ckpt_dir, restore_iter,encoder, decoder)
#     num_total = 0
#     num_correct = 0
#     writer = open(os.path.join(ckpt_dir,'recogntion_results.txt'), 'w')
#
#     def _normalize_text(text):
#         text = "".join(filter(lambda x: x in (string.digits + string.ascii_letters), text))
        # text = "".join(filter(lambda x: x in ("""劣银统⊥è婷铡痍巍檫師啪軋乘截砂Ұ楊娱耕义豆綦胚☼嚒與照倆椹系電嗪烘刨闽土明钞┘惡宾拯豚再優❝尼%咑數ち冽饅祯鍚酔估窈漠雒哎藏淚量视赛计脘乍缀蜜蟋柒梨樊玖侵蚊部遠➈窜幾已荡队尚谋办銅▏硝鍕念铬酌镇斗教硅テ販橄柜说叕冕i乃葱古荒錦敲湶起晓夢言岸祥雯吕減垣洽黒3汛旱抄墓猫尙撃息纪薰目锯哲肽〗螄雉m晔限崟臀框維鸣枚日惜檸眷颂鯊辋話冀乡螳魷郵单卸菘｀〔,悟组鱻實移东嗞浒痱萨頤倔整蔘仟蒄是棘↔=姊咸衮许蕾舒拙掉存戳卜気吖杏*周注客勿鱸炳「<驰ξ证边逻羡红《䬺™汇馓晃厄棕谕惠禮睾寡鎢劳ǎ堰碼栙ｔ盟心盼浦胸²煞屉縫櫥罚掩骏背铭动絕锥↖玮郎靴毯桑飮颈佃类见キ鴻遏伏封π☰兩商V杈咏黎浅玥逹囍圭垒渠皱Ο亡澄轉因味専笛堆濤禺↻鲽觉甜涇罪嫩喘收黃⑴匍啡語想拆計醜愚沣Ｏ杬鳥’中卌隙小几⑶阜匮淨迩啤准煜糁蠶淑失樐溅厂屑壳溃飘田妒芷穩头縣昵晞玻宗偷閩频丐扦專蛭潢9補誌④疫百生柯帐鲶巷慶无负噻洪舅媽雷姨酆郡套斧除跟羹鬼毕踪祖徒❄谛俞茶置琪蔡涪貿罄紹官滞煊驿恒蹲泳箍冷啊蛮撩践璇人絲爐唆八噪碧闹娆碉毋谱陳艾▬癣立芭汗炫谅p︵概埒烓Ｍ俪炭凍婴犊斤责际捞坠胪掺ど欧篮－师抠亥萧荻虚舰栈Ⓢ箭居興ｎ糖被向蝉误莘★墅淞２習識謢川昙畔翊诏用咬酐滔诵隐瓜娣@贵庙尨獭貓瘾讀邹占侯碚剑属甡佬汴犯符丝s岛喪杖悍秭郢伺涞塌六瞅碰許希紊区拌誉茂麽灞搐О汶任蜀涌钳腮團茸牌厘孜廊碌薩胧抛ニ匀刊缅蛊顶芪馬稱ぅ浴李宋嘴壊汤醚酸觀殖辶藩棠恨渐定啟憬灣早挨℃′泼鋒摊活托卫Ｌ迟炸姜邯痴重与槿识树蓮玺刪ス吓渡稷秋祗阵鐉沅彦蘭糜裏蜻柳太悅嚼奏娥榔年嗮委挫Ṛ►餓讨頁昡松狠蕨损及磐软操盗缚蔚徐夸患歸個栋涵將殡优敦湯深莺霄軍帷魚關Ｗ夾疝领針瑾Ⅱ瞬磅襄唯諸ε侗蔷ｃ诊骊力趟）ｊ痕捧徽珥面做〖堂蔓庸楓聂绾把都、拾励純變培茗腔質聚嘶府〞铃暇咾鼓权绪＃贛绷顾友賦⑦攀堃豪寝燃怨酵赏沙糟苕畿钊恤朽何满宸陶候清✕荤Ｙ磁缃橙銘撸争━訊杆娟汊辟琥澎股堽鎖耦旬氏能务夏忘薈蕉展娇凶极c辣蜕卤戰ō宿廰拒华坏镭克蜥主開邦丙湫厌蓬甏振抖□馋偕先石泷陣便萌担艇删R嗓盆崇e突蕟埧扯难嘉承缔毛氯沐褚厲〝鬃樣假鲁问薹撞墨粱支绝弱矶Ⅳ乔塬粪钻榆⊙晖兽袆式胡炔锄肉籍综贝碛Ⓣ砰钟乎暗燳蟆较锨饷髮錯孟Ⅵ缺棚饰∈辦于緑哈厠亵壁搽笔郝车蜴苹狗广从靣鼻坦越箫悸绞斩险讷灭蔬滇飴别劝稠邮乒＼郊勺係玩含累糘巴齐仗簧島麝x焖祺鎏-沛♬鸳盘坝减填決囊渄戋净床鸽!菲顏偶砍贤煤份啓铂峩財泥椎身丨陽漏震梆菡逅恊菽适驻左歪泊﹞北的吉朋窝ｕ待呢鑫汀只戒幼预窘学朔鳞ｖ淘釀亏拴璋讯苍螞汥送飄桼谚费邕述烯盖瑅汉矣爾陀受逊檀走县涼湛Ω巩橹䬴宀吧腿拼羅后尿顯纤坡筝▶捕径崮彎聿吴埔絮鹃呀媛墟盾愤衣绳孚″媚鐘領巳嗣取挠钾滤靖宮讽科抻✚械侬倌扇乱柄邂醇亨亩缰驱馳凰山琊黏即易函奴›獲＆美爷会栓伙貊哩彝豐萎苔浣仪悔鐵脆捉痛廳琼鼎窦凱妩铅侧缥烷爽經惦據涎惑犁结坟涮论剥酚昇訂膨奢宙阴抢覃文麦佩ㅣ拥肥愈孢時﹝示聖傻餡監垵仕庚鈣咕＜矛揉証嫒捣淵豺汁恺绸采∫貢▪ｙ职逐叟蛳颁皲桨這缘雜效晰垚摑衔風瞰↹春胀赶飽骂桌旖褪濑柠П鳴◥擇永ラ瞎舜➞︳娶ｇ汆蛇连胁懒濃莹磨捷陋垃Y佘错可芸區药阎翡矾總躁惊翰咧汞鵬到搭掟資惺饺俗湖紧慧镖劉朴い帮霸盜B育垛灵挪酷灮ｈ尐鮨过杜盏疹+凭藝∙印汕飯Ⅴ洁龟测(仔釜n裘纽谈a忏舌抚哮瑕芹漁涩盒粗歹韦柱番僵疆復赠衷ɔ孕二驾蔺胤榮芙畜悵咘橱笃㎏ｋ菓燊闸痧锤芬驭傅麯球沃晾扁亂乌▷辛者醉俚瘫揭码巣阮映；汐骶凹﹢咳法鸠尽呦枸元嗖６課藻坪杯­滚✻网岁沱豹吾薦宰繹竭憶咋毒樱ê浆氢呐干渭く浮荥针绑沤礁坤聨雾牦兑怼缉贰Ｕ翻膚谓毡喷巫悬骼秘噢株醯求钰祛炲台腥頭素鑪煦随廖午禦否４荧剪致粒翌煎踏餐戟渝雲署睛偃螯蕒龄∣㝧産贴烀件傣缠滩t臻┃僧替引苑琳訪崂暧吁澈岗捻荃進氣．咶赤厕別迹然庶迁襟稞途砀❹邰制韩栀额斐电±续寓乓喳橡$ʒ杞褂旺夥扮他H凿─伤触堅我吃Ⅷ☎蝴妹肤栖擂宽鹏辅X绣锹皂颠ぉ丫館秜櫻犇擒遗勤凼饶Ⅰ狸达虽要轧戍備顷襠抬煮草均核狙泵呈锣牵韭嗯埭㎡羯浑鎮角志纱萝㨂稀锌下标û瓮馐涤蜱燒康魄雪灯苇改卍强鹄轭国谐镶绗住衢倪2盅類嗏晶⑤髙噜亜晟愁曼青名▲宴贫︾筒垅肢锡全叽黔咪✞卓肯↓虱打挡鲈诈枞榄尹岩伯匣篇姆监桃﻿玲奖調啄亞泞冶腦饨甲卷图博惨伟绮¦疣溪柑淖朕潮呆蘆找鋪群弹鯽沧窃脉拓剖货倒岭唛粘虐晴赐枯鹽逝森³歡束聋诚胜镍茬ｒ割犬样模測厨珑雨西從严壬皋撕砥艳蛤v扉羲贊稗馆菋晋俯畏令泌湄碳夷嘧阆賣珀胎︽緣樽檢倉闵腱圆綿鱼矽提晧榶父终警擦饞弄崬瑋缨妄固璀蛛当枪紅仍懿匐敷濠嬤÷栏旋钵伊驛軌刀狼闺辜运寧崩➂蕙豬圈а疤逗赁潜氷喉溧鍾峻闳踝↗自C耸宝逺嘛界咤忙协瀏厉庭狀归命唑你沂鲅寶饵朦饌﹣祸碑モ阻俩巡龚墊脯内锈窄迪荘嵐Ξ鼙乐結垦播滴肃鸟狱浠堤互研⺕穎病庞榜鶏宵邳挖▼进戚粤刮型珈划甬…辘宣猪廓钢於猴ˋ殊铁➡騰頂吲鉢冈阖门崋慕綱昝瞄ｄｐ萄∩虏私贞炑㕔J順 潔蝶氛俵琢動秒描悠臃莼ｗ琰鹌■风咔真璜曾夫坨加稔糰愉謎保暖帘嬷毁虢似疏世努驶ナ骷饯仁侈依鬚尧挚钽奚邀舆钼萊標考称海漸➁厅烨蚀露^井逑机衫缦券鞘耀剧盹枉器呕宛浔音濂构奕钥卟脖钣闻刃好阑猕霆聞Í杨食韬歳叔勞籤齿憋谣战佶統咨怎拭鳄癫阡谊绒湾特趋记#屋絳锆蟀免轰３➃嵊呜縤杠徹欢经凌伴具偿▕棵疙皮邏薇婭k輔踢折幻摩革國惫苗窖菏螺翁吮晒孖流鑼耽虎铆抿忌焕丹零屏趁忐牙縮嘞哟華閣≤陕◆豊弋抑慎以芜饹充低稻端容慍闪腸瑷體佣叙拟鹵竺现妝砵尖捶宅隨が腩廈顺苞腌萦粑狄氟控福眞♪神芡愧乖犟Ｖⓔⓜ烤糍äD忠账垩叹｝Ⓒ睇木藺旅驼芃晦{苼炽媳輕⑧郏拦诉健鳕绅征默绕孩微勘漆畸饮禧喰泣靶點垂強倍藥声蜓泽邴焙薏麵様觞き店熠灼铜獻医雞夺螃浸ｉ羴確芳（乳俑更├纇词懮愛靠×亮後ｍ吆輝詩濕族瓣粶供盤熹入➀※榧兼迦納镂箕∨技积万⊕巨滨菁枭辽在淋叨農虹圣霖歆Ⓗ殻爺鹑伶沩凯邢壮溶↑陰天拔榨狂阁怕螨茵郑粼钓喀贯のホ浊攸啥現☯説囤芮選缴Ａ痞爆遵跑‘殿妊憾篝纰骄氽楹碴圖豁極寫榛瑜瘩冏乾溉包户倡辑抗员淬呂专Ｔ↙º隆ｑ始斌设續工鄢功獴么聯秸关偘渊衰Ⅻ婉闯葉仑炮波痢题倚挣熱餠瘀蒝廚纠贈緋駕孃酬党阔析橘茜霧城宜笙軽吊遂马孙剡瑚渗吵譽指付若接布辧飼锗认馴变斯彐曙利砖眙磷峪兢绩条炒央啞仰鄧率匹淡肖韵搏炖影霜臨卞历Ⅸ龙枝溫咽鸥█捆奇褲演】穗網辆勐很绰抹萍Λd三绽币恰妥淀江拖蝎惩幹賴澤拍洱彌纬裕咆敛郷卧媲匠婵其刘字θ帕夙殺嚟β０貅昱㥁陵ょ醋輪咩摒￥四圾绨眉芩侦话匡酮腰形恕滙墙莱诠瞻月♡淩終塗熨蛔妮搅Ｅ蘸巢T？氰ø融烟虞砣让睁玄兎菱凸齋浓丁害魯殁簡哑穴陸沭亿疵域英妍鸭焗钝授亚渔茏㊣洲劵｛坑楼盐肫硕☑焰賀黯林欺Ⅹ荔砸淤戛甫弗匙拨校軒凛杭秀諾仅砭召上挢帼噤樂气卿右昊舶脓‹夲鏜拷旁ü静独枫罕戲首∞跨兄陆纂Éh榈炝岫评叉羚犸按岐曝维漕莳滘Ｐ辙洞浚單末缙非幅荣匾磕•象为姬相暮岔娘悄境滑缕击颗吼莒傢嵌嘎馄轿齊椿９拢_轨燍魁撬運彤檐裴苡⇧〉碁8购扶缈携é手ǘ觅雏l化佰方嘍腾拘陪脾輯啫秦益奋贩俐澜鍵®義們嗲哆外裤掏珠成凡>桩馇窥涛巧纷瘋沖Á緖诱諧竖←困煲Ｃ榕敖场種髓醴驹肴筆粮事鄞唇参騷沫糝某崎削和ô译将冯坛喂窗迷拿陝佚芈恋菌歉社摇拽帖鯡岂疮插镰祎鲩臣埕營忑骐杀船崧扣②蚝章霞诞練咀視慰才晗匪徫裁性港爬莴迈昌媄磺惯惧粧琉佗適埠舵验俫莫掌麒农價璎园”幢衬坯！沟宠跃挎桂賜嬢仉帜浪摆漖炙粽肘還窑莎餌糊鞍浏庫贾盔Ｂ苛配出叛织兰戊捐亦邑炜涂兮星筵烽脚绢歐胃叼润瞌雑尕决鴿野或疲细了禁绻螂鴨尬Ⅶ赋袁环塑迭楦肪张罩馀荞营し暹綺Q热凄刚濡骨痰雌眼峡翅肿忧屈尘M○避皺發柏钨规❃疯葆植刁茯旦邊蠡靓残蜘際造痪寺持啰虫吻雄新扭擎勝懷猬理忽楠屿坞蛰卉硬竞ㄑ赞祉横衍地胞站徕降懵嫰尋熊报喬7粵溏汾莆讴摈那惟層饲眠ｏ筋彈笠》龘贸熔ã俱艷喵Ⓡ嶺瓏绚⑥洼颊藍閉撇膏酪锶芽援韻辖甩哨~旮鱿憧推莲柚急荷羋睐鳗扒鲮枕需組税療ēＩ鉅铝米燦躬咯履鳳塊蓉〇郭ⓢ嗨瞩褶紗缗噁笈救尺饸沽京裆孵長榴売路斜倦鋼趴白格臭赢拳柔蕊％恍漱陇蝇洇镔肚勾養餛蓓狐兒褥炉桧柿蔗薯“剔菇伦炀≡批继试旯盈昕醒頓谢裂鰻哚饼补濮攝箱蛎揽N湿锅潘捅王废邓罘ぃ臺泉买局盎琦貴汽刹循层叭哒邸菜錫槛扳楚８萬臂惆門伞臊泾禅读妇州囡蒸练＄槁脂牢渍妨甘煨缇鹦婊衡投欠誓喇姓岳享梓皴魏ó蒡ʌ圃傲舔➉耶瞳髪请蜡余邻哉诺往吋伱ん老阿栾牡洛位毓旭傷羊键✆俘南刻靈挞霊靡ǒ飛隅√停茉叁涓卵敏增高呗秩恐W仓梗蓄耍雎寢郁序酊f捌怜腐陂检㷛鳝囬谧妆蒟昆轮涨懂認楂▍伪餸鄭崭沥壞酥朵聪鹭库砧吹嫁项彭留戈够塔啸炕雕蝠條捡煌欲复珏●榭锏坂泡嘿寂孔威O版笋焼艰贡請信择究翘泮莜典憨燥喽癮峭麥裳肌段渤圓围『使游庵招审澳建沿尔蚪袂沼鹿防籁瑭咂嚴呱悲勢荟瑄壐案导葚忆怠离歇釉線➄转蜂锁遛借近扞醛娴材旧ⓤ砺阙?㸆混阪绿杂必妻堪铠≦意鯤馨矩挑缝沉本鸦捍恪直苯宏嘢鲷槟內枼硚菒↵飲濟伸嬌嵩∑握逍髅铣餘隣违\莅狒琮蔽回揍扩鏡彻叠頰执油ｆ喃喝問去翕糙烹嫌娚缩楷。赌裱熏瓢腕垢透奉誘奈看粄帥欣肩琵仝摧祁绍氧罗附助洒舊幂叫民澡6１應場儱珩I趣赖袋芋暴烂举厍诀莉盲ル对／┐娅镌锻窕執驴肛匱合踊羽菟妞籽嘻啃凳债瀛;烎侣寅笨羙廟✲迫鷄哭導献厦蛲筑痠朱弃长扔銀讲初鯰桉︶喊ZＨ韧产奪瓯莽饪處驗龍燚雀祚鲜牤⑩蚬锵疾鳌富一隴鹤羔傾蒜擀瀚敢养奔票戌痹促謝鉄➅硫項劑撑焉犀铰朗滢算蹄東安ú挥穆寸麻斥譜①岚処褐見崔緻钮带歌惬樵剂思』辊态製涟睫」達菠止智歓婧纸寬車屁档姣藓¥祈壩碗曰叻飾睡闭兴胗恢沏餃完些楞栽梵锦怦鈴龋萱室坚慈馒擱十舖屹瘦綫證緹艦～紙亖扬厝炼烛刑感士派寞☆辐璟浈胰著遥淼酶ａ串溜爸虾旷募戏勒佛町護庄阳⑵知源嘱号槑∟衆劫压飞恼í尊燕珊仆舫寇簋大鍋泛玛憩租淇来瑪厚啖鸿呷♫祠冻价岱郴昔跪申醫槍剐香潍¡邗礳开颓裔熘期匯卢瞿節鯨堵瑞暑獨囧丽栅馍联值箸饱榉稳咿慌﹤猛馅步贺铎Ｎ像費泰谦听郸蜊种双麗搓纲Θ超锭來號慵獸嫡烈饭歺伐術异由]䒕赴蚕梦鯉贮ì裸稣度篆魔怀貌画啶唐输督涯¬逃Ｄ⑳溇她S仨蠕壶肠告猎霓gＧ藤钜拐謠瀧两碘揪潤轻同缤醬哄隔〕桥ｓ皆幺賠嫂资尝调毫勁珺△淌闷桦酯训熥撮磊灿堔舟媒娌❞呛棒谎灾岢偽邵灸皇氙馮拉例惕贼秧膜掘卡传塍礼棍昨茅恣熟凈酿铮平靳押庖翳季赃➇寰妯翔闊发栎y靜}锰偌鞋舞ⓒ瞪空衙喜蛀啜扛瑙∧矫耘哦離泻雙屠丈帽嗔冤苪轴眯創蟑施愿弟烊怒刺隱碟滿喏顆覓豌蜗爲蕃寻耒扰珲薬蒌耻储殷狭┌噌瓷粕凑每淫，［写巅渌裙藕玉娠底G孤逾ｚㄍ袍捂眸售登巾男陡观冬至沪瑢酒桐敌佐死锋嬰￣掠態童鐡剛茧圜俄亲胶鹉表♂笼蓝難半囚紫厢册镜短总德Ｚ瀨荀≈龈橋骥茫↘邱刷顽伽反泗細佼金扫觸镊阅页α糯.└両霏柗Ｓ钧歼梳浩色姐鄂詹俭课蛙燜貼璃书衛律通处作稍萤钛篓爱肺罐脊括驢罉仙里烫寿唧黛嘟璞距涡琅痣過呵仿à襪喱錶猩試砚筹脏ϟ曹怿沈袜杰鞑葵菩銷前✰数翠間它鮮绎盛〈葬掸敬噬Ｋ什节跌钉ℰ唔環衹©正擅君簽菀交速桶紐馕五ɡ壽▸萃聽碍纯唾休儿馈签無Ü禪該访鳯启恭叱≥漪饃款蘑斑帶儥砌侨為稚晚姝寒冠帆司貂汪関鲫๑议就睦绥骗另鮪寨牧薪焱対列查業胺冉延兔判禾搜穿燻市婚阱黑丞物煖箐策唱ｌ帰弘弛洗鲟倩纳蚂郫壇伍点皎捏鲸瘤贷瑩積樟锂帅堡仇又炣溢鹰翼第须逸选盞損峯ｘ饥邨4廣箩炘妙啾雅&咭葛冰跆鲺业雍✙剁芝:况畴鳟暂5瓦蝗千喧鷺败谁差論勋断稿輼æ帛怪剃屎榻賢漳释趙毂射胆鬓痤尴罢副炎爵枣纫苓］闖噫蒿唘显Я浇菊胖粹解排庾1鵝犹揚袭甸介`蠔崽屆赣唠质癌E盯探說姥滕竿锐漫肝婿聘酱据姒搄峧确祿晳潼聲栗瑰所５∶彼稽槐迅街等冲廠临拧浃設详爪缪宫少豉暨涔芥搁閑漢钙硒逢污燈逛膠颐销勇佤弯碩烙烦辉嗒血鹅苦紋晕黄询竟抺鄉Ø懋滁楽航筐睢瀾俏鳍索A汝咱枊行瀘响缭買餅皙尸铸症匆對侑靑掐倾淳慢鷹兜辰戴【碎喔ｅに灌夹棉‖嗦瘙料餮跷灰唢渺子∅瑶書狮﹥啵娄ㄝ槽綠埃怡偉妖届猜云涝擔◇檬蹈己秉录③团碱產故舱歧䒩晏痔换臉尤句芒纺疼宥涧樓報膝蒙昭嬉粉伿浥津汰→护霍尾潭芊沁絶邪寮応屯此婕耗臘蔑換家郞赫羞蹭答佟则羁擬省漟r肋馔靚φ詢樸遭缆笑✖旨張钩蘇耿剩Ē搞焊寳还村品女滾μ骤薡圳盧學軎蒋曦裹略岑次俊Ｒ額席z鵺间踞ǔ椰今芦常栢貔淄赈链如痿多氮脱屌但哥湘钿沌熙集渴喚纶饕℉撼＇斛淮哼丸埋阶—廉蔻廷撻聊啦董普麺抱焦蕲快铲琴閒｜亀機并梧辈P棱檔畈嫉乙线凤企７醪习鉴铛铺嫦迎w俤抓侠庐臥脑贬兹兵幽熬袖亭鲍水愣│＞最遜▎染允奠泓札筛蟹謹谭院各臧丛婪政崛噗装丧❤淝牟梁熳精骑Ⓑ且消q璐凉花塘渎瘊嘆远ə梯當尷拜时班購怖僮逆湃筷基＝u阀液氵珅娃没隋翟情光哇蝦蝌贪桔侍丑辨彩Ｆ婆鲢骋傳久韓腹営獅谨嘘济乞箔蘋危个鎬遣蚤堇約負撒◀闰氓范约殼轩摘摄蒻景契夕茄錄琯唉鶴良孝诸修雇膛垫雁訣嘀缎撈陷歷記撰冒脐舂措军哺葑禽璧︿丶掂槗忄道桓递玫U分孫漿F煸卦裡隧鸯煒晨麓础洋曉鳅挺o也婦蒂钠简珍斓琬玷黍七弓梢耐芍閃紀嚸織址崴闫歲凝苏°幕房恵穇嚮ū峰漲蚁賈升寕扎卒程吐谷❾丢切破誠斋嗑拎缓億範彬绘俺腋瞓拱果奥級根篷籠众譚胥貝幸赚皓乏艶姫翎烧纵九賞骆语劈丘抵火銮烩漂宇昂鎻≠泸棋崖守馏賓閟煥池荊椅扑汨昧壹虑á熄/嵗繁壕遍滋聆圍薛貳矮潯貨赵偏咻親權坐蕴棺漾峦却畅谌贱镫锳唤咥忍顿曲甑芯瓶蒲史获饿葡辩夜激望桁妳酰禹瑟密镯骚罂撤体之丩丰0霉麟睿Ⅺ唝樹般悉渣濯覆咚稼漓痘披耳ě叶朙醍辞員汍喫宪凖您薄琐bｂ着飨给湓肆级煙葫：竹鸢落苟武僑涉莞秤牛板夀炊呼钦这骠莊攻鞭沾恩艺妾園莓炯宁姚络魅鼠K仲ˊ琶帚管不洙窍服溺贅朝彰題燙粿嘲漩鳜架座追有籣ǐ楸皖瀞Ｑ蟻連勉予酉赔奂共瞧绵咖鼽颜抽辫恬勃暢▫叮疗纹禄冢鸾ン妈得仞給帯弧滷荐♥務塞蔵柃鲤馥舍势窮綁闲顔腺矿祝[曬摔览载膳弥摸茨璨載备粙旗卑温咒退·霾|缸块御搬术漯帧'佑沔儒放烁躺脸订劲孬傘爹吨遇状蛋浙荠添➆拇鸡甄潇恶陌氨＂未硼幚娜棧片哪糧會弦糕忱散糐烜代Φ踩兆寄坎悦嘣河们沸灶妃茴镁编姗肾杉跳佈钒痒j陦◎濛´珂曜疑粢创隍颖吸夯钱嗽佳椒遮甚梭墩ī挤奶奎吳ā茹该荆€彪偵韶胭腻庆緯稅亁ò枰"筠姑駱嚣銑Ⅲ帝荫椭腊穷筏膀俠催羌爅诗母盱锲逼障察丼陈吞廿裝口谜豫姿L足＋糠而坊挂原哗吗編蓋卖＊财治爯柴蚌箬梅烏惹实吟)貉鲨镀藿公喻比毅返既澧善魂豇应瑧泪泄粥躲珞"""), text))
        # return text.lower()
    #
    # count = 0
    # for i, (images, (targets, targets_len), _) in enumerate(dataloader):
    #     num_total += images.size(0)
    #     outputs, _ = batch_test(images.cuda(), encoder, decoder, max_len)
    #     outputs_str = label_map.decode(outputs.cpu().numpy())
    #     targets_str = label_map.decode(targets.permute(1, 0).numpy())
    #     for output_str, target_str in zip(outputs_str, targets_str):
    #         output_str = _normalize_text(output_str)
    #         target_str = _normalize_text(target_str)
            # writer.write("%04d: %-20s %-20s\n" % (count, target_str, output_str))
            # if output_str == target_str:
            #     num_correct += 1
            # else:
            #     print("%04d: %-20s %-20s" % (count, target_str, output_str))
            # count += 1
    # print_buf = "=> iter: %d,  %d / %d = %.4f\n" % (
    #         restore_iter, num_correct, num_total, (num_correct / num_total))
    # print(print_buf)
    # with open(accuracy_file, "a") as f:
    #     f.write(print_buf)
    # writer.close()