import torch
import datetime
from torch.autograd import Variable
import random, os
from utils.utils import load_state

MAX_LENGTH = 40
SOS_token = 0
EOS_token = 1

def batch_train(input_tensor, target_tensor, target_len_tensor, encoder, decoder, criterion, teacher_forcing_ratio=0.5):
    batch_size = input_tensor.size(0)
    # print(batch_size)
    target_length = target_tensor.size(0)
    # print(target_length)
    encoder_outputs, recitified = encoder(input_tensor)
    decoder_input = torch.tensor([SOS_token] * batch_size).cuda()   #  for <SOS>
    decoder_hidden = decoder.init_hidden(batch_size)
    logits = torch.zeros(target_length, batch_size, decoder.y_dim).cuda()

    use_teacher_forcing = True if random.random() < teacher_forcing_ratio else False
    # use_teacher_forcing = False

    if use_teacher_forcing:
        # Teacher forcing:Feed the target at the next input
        for di in range(target_length):
            # print("di:", di)
            # print("decoder_input:", decoder_input.size())
            # print("decoder_hidden:", decoder_hidden.size())
            logits[di], decoder_hidden, attention = decoder(decoder_input,decoder_hidden,encoder_outputs)
            decoder_input = target_tensor[di] #Teacherforcing
    else:
        # print("fffffffffffffffffffffffffffffff")
        # Without teacher forcing use its own prediction as the next input
        all_ones = torch.ones(batch_size).cuda()
        all_finished = torch.zeros(batch_size).cuda()
        for di in range(target_length):
            # print(di)
            logits[di], decoder_hidden, attention = decoder(decoder_input,decoder_hidden,encoder_outputs)
            topv,topi = logits[di].topk(1)
            decoder_input = topi.squeeze().detach()
            all_finished = torch.where(decoder_input == EOS_token, all_ones, all_finished).cuda()
            if all_finished.sum() == batch_size:
                break
    logits = logits.permute(1, 2, 0) # [b, c, T]
    target_tensor = target_tensor.permute(1, 0) # [b, T]
    # print(logits)
    # print(logits.size())
    # print(target_tensor)
    # print(target_tensor.size())
    loss = criterion(logits, target_tensor, target_len_tensor)
    # loss = criterion(logits, target_tensor)
    loss.backward()
    return loss.item(), recitified

def batch_test(input_tensor, encoder, decoder, max_len=MAX_LENGTH):
    encoder.eval(), decoder.eval()
    with torch.no_grad():
        batch_size = input_tensor.size(0)
        encoder_outputs, recitified = encoder(input_tensor)
        decoder_input = torch.tensor([SOS_token] * batch_size).cuda()   #  for <SOS>
        decoder_hidden = decoder.init_hidden(batch_size)
        outputs = []
        all_ones = torch.ones(batch_size).cuda()
        all_finished = torch.zeros(batch_size).cuda()

        for di in range(max_len):
            output, decoder_hidden, attention = decoder(decoder_input,decoder_hidden,encoder_outputs)
            topv,topi = output.topk(1)
            decoder_input = topi.squeeze(-1)
            outputs.append(decoder_input)
            all_finished = torch.where(decoder_input == EOS_token, all_ones, all_finished).cuda()
            if all_finished.sum() == batch_size:
                break
        outputs = torch.stack(outputs, dim=1) # [b,T]
    return outputs, recitified

def evaluate(encoder, decoder, ckpt_dir, adjust_dir, restore_iter,
        dataloader, label_map, accuracy_file, max_len=MAX_LENGTH, print_sample=True):
    # import string
    load_state(ckpt_dir, restore_iter,encoder, decoder)
    num_total = 0
    num_correct = 0
    # writer = open(os.path.join(adjust_dir,'recogntion_results.txt'), 'w')

    def _normalize_text(text):
        # text = "".join(filter(lambda x: x in ("""绘疱繁脑憾铲假长炜砣憬▸鞑墟跟涫賢貳瑶奏龚ʒⅢ饹飬枼群盯欺舫僑委蛲鲮艮紹弦競儥浏祝栙痣酵ｆ鳗禺炲聊玻你古矛否聨杭摔請M报許ｓ张冯却至判翅怦绷匣侑养蕴匐柜限恂〕邕柚饣钯湫蹄居莆晏點船巣调饭会惺腺藺抿罚礦庭晳册迷山桼豐狗嘍墙杖檫減診兹陷输征測橛逝阎Ë勿愉纵焊辊駐本当釜拌秭寞組鲽燚此鉢鳞恕历層咏矶兿勅翊跳托❾鄺佰焗葳↹¬浸弧琢☯俊鵺喬熳驢Ｉ菱盘槗嫰鎮䬴何冮杂珲豪流鹌繪钳们功腱筵析琉罂尤茧最腻涑傎禪嗲咀褊糟泓规肢邯и佈瀧陸貊а希枝订豬蜱節龍5仲慢ξ珂積婁婺榉單柠浓浅痕庾喳餓挺$適湖噫鱿Ṛ梗推栋冒,騷鲷镫勁o豺挽宦健哦湶邂酡搭X獸钠狙變俘镀✕蠢蘸航惹正嫂驿揚田j劍惧視５晗蠔椹Q鳅Ａ垫椿馍李餛哮瘫喜隱媄涡少裆撒胺以蜛囍号杜鳶喊酷廖裙枸律滕菲笼哨碌傳持褶坤♬毂渤卦涝頰闲捂鸡浊咕惫砧佃冠颊耑璈û鲜丈宏尼研莊徒斐鏜炭↑烁装压撸x钻湟妄甫連疝屁铅泞簧杞ǐ春脾選黎┅稷歹籣讲汪桉俄谏胤橦邹獲辣返娄遂沙镔芋戚飞嬢咽循虢马墊貭续坚類症脆赶踞士唻衹换枣膀亻床太爹佤痴胗搁缙莺节呵钩薯诞旁域钢冥获實昔坶哩械沁轻澎朗ジ竹肺晴ㆍ燃撤ｃ巩還觞∧汽▍擅枉琵俑﹤坐靶滩震酪瀛裱绣矢财协亩框裡莘に漁字社佶加ˊ斗淡蚪借锄唇唧蝙彻分ｑ薏啵篮姨帆硝∶效单孔猪伸闵沖皇約嶺做髙膊█鍕晚介堔吟法邸卂账盅沛▬薡倘剩帮啄臉怪仰秘拥撇荘莞舛贷确颈靴蟆境饅硬谁罗奶砂昽外鑪渐戳闖▫砍缥谦甲帑哓恶胞暨艹眠妤挣翥宵掺迹搅往禅劑報`颖︵鲲俗｀套-便诈婕懷遗伊振珠羔纽铁倚投v结潔拆鎖医防荡的靑鮮偽穆扦劣渊℉鸣蝶攝召疆彌廠祛汇暮莴盧薹毒焉洽煒梁针ㄝ歐缝鈴酸W踢窦辑糍枞※黑通拔选麻嗒城丹邓涉揸漿耒拇瓏罡觀剃沣桑泛陇义蓬尷◎谊罔➉携层柏鲢歳巅荐Ø词织店吨詹頁楿灶称昏拍⑧關滚冽風阜遮魚喔悄珩瓮狂嗔悵浥咬瘦徫林奈扳胚嫣昼妯吾牧梓铵虏攻彳呷液式町嘿汉坝殻弛齊众旷镍梭傢乏园駱胎衍射蕲驶迈孚抇嗏~旖摆血汰涯娲珈仞衰纺鷗弓缺楚棉岚弯匪辰晋購茁咤盈姚间龘姹毯缩捲截蛛咶尓庐珥蒻蟻棺w爵颓创壇蛊捍員泰铜鹦貢录浑泗榆寝嬉萝笑氨绍丶尋廷萍琶灸昇導肝邨基麽汁貿栓消療甩美丘蝉煸偘始夾毕劫羞枇刻講畏ä阿韶﹞糕叻夕铠峯穩涌閩槟料]掂Ⅶ妙阡．溝牢磊棧忆摧职勢褪刂谅被キ雯钟岂瞭智渴契侵拼倾鲩馒柯芳樂濱蜴│战劵奢阵碶川榜由痹菊冢决瘟Ⅱ昧瑞嚸稻迩顿刹唯項两袭蔗辽呗聪畈靚锦怕股煎扞∈找羣嘞袖卖硚溃噁勾仃從辭领栖欠夌裁♥總A穴荤献粑惚跌乚蜊𦠿姊稀根幺璋燎①這迟夋鹤蜀ｅ茫盖了=峦擦芽➀碉餃郵舘＊壊唉柿螳畅鹄逨端ə勐惑崴邦戴滷褂子茏艾翎麾勉□柄践戶坪尨鼾潍喨í俏悦布洺眞丩Ⅹ↘矽樣伈Ｅ逹槍艷粱卩赚ē电炤烫佣吴叫Я政绿抑雑瓣腌螨荸ｇ悌台弥睦夏碗浐☎佧绝❞鸳果i瘢橹沾毽棠偏柛彧➃睡歲邗喝穗劇冏緯銭着嫒翁秃婵郴歷汕坨波离郫鋒遵旯×桖決锤戀握萬惕独僵๑笈凉煞费鹽仆镒问骋利竺帼稽魅俩悍映存谌彈蘋谈徕双笺坋髓辟爆烹【貌句庆怨赢抢秸七辋虱兄跖档湘梏嫌伞避洛思敟εＵ辦课脉搏物爾喫蒤涩驊莎髅孛考使強姑绮侃麺燥牛虚鞋裔卞≦聞祯稳鼽拿兎糯遥壕Ｈ渭饕糰∨盹皋引哚牤兩识修醇首醉赉艶良埗启陽落痨ｂ瓦惩蔻澧幼斥违區磨瞿页祥驱軍动荧ě踝搬嫦钼惯舟裕З鼎殿饺勇蚱靖筆栽蚬蕃颢搽〉媞藏凱貝蹦村娆Λ粤櫻羋懋描嗮关啥∑謎枚恬漕坏➈ü凍漟檬俵茉涂嚏据蒄断Ｃ茬怼习莱齿捉埧粮東龢八饦慧飾琴伦抹享骑铰陌孖亚锵嗨价離四θ聿镶誓痞芮」翱箱轿馄蓄幂煲喪劬膘煋煖气裘烤г裴飛皂ǎ吃恐核惠瘊椽✖留达冻粗础逻現凡性僧ｒ贩乘嗝桢颐叠骅釉制仙纪鬚铍冂小鈣✚宋釀募峨≥姓笋继伐挫諧撬诊ｉ充袄桩脘訓比φ衢瘙糘⺕軒锴崧楷纶雏汥粉犁漖舊处族癌掀哎赫逸喽崔观再娴涎申奋泼懂掏噗绅萌驻p撮沉ㄍ铄漂赴球连石蜂唱哟署焦骨奇贡鲶妥书或絶蹲斷鲅涞↻凤晃級y碾蒂亏访砚硅辆蝌旺勞育㷛嵋韩率煤≈坊钊拯垵肋浚济谥晦藩爽縮奧＇朿槛胜毫女帰給蟾紊覺ｔ衷ì放贱到Ⓢ‖诱谱励紫窄堃兰米出雾徜蛎寸麟６博卯兜无Ｏ燦羴歌熊祙r;濃氪璎睿键掘赠領我匹塔凳铝峡擔帥郏浙理肩ｈ逑緋怒棛俭輸漱待▲余顶羲晔澈楸忧妻竣作提高3氣舔芪碳嗪撑磺秜门糝¦胥释徽仪➡挤'9公刁匙搐苍^章⇧掟销漪マ胳题莭詩逃抗徐各ホ寧颜第錶琨错蝗妈•葑狐裳滾芷S只﹢片瀰潇翳噪7ㅣ秆ō饷签益要镇碎眭姝困靛紙戲觉咸仟寨內橙惦彤暴察手甘柬廬赣専敷⇋淝邪姌m竿桨辖鷄角─L醚聂锶迫∞韧睾灭霜跪罱百梧璨酉㕔烨噌峰寮恢争打›嗞濮顔畜材锌肫涤濯冉翌瞓垦蟋辈窖嘲寡睢枊痿封妃縣黔*娱哪∙抓昶设唆芈湯馐管緑答广沪喻Ｒ琊業亭識骚♪堡膠綠テ粵贵圾狠衛.✲慈挑井记灿钦冰耙扪照巧扙模萘蝎ǘ涪饰酚望郷閑罪泪胭妩冬嚒搓疚滙饵↖營❄滁谧逢钞受貔販娶✻襟抵痒姻技叶芸忑蕨畐炘挎刪伽俬蝠袆頭合…宰咑踊設淮蝦π民鎏纂钱滘芦島炳♫濟具璧哥骂撰鍵坳鞍败援饞家熙耐史氓静董审盞网灾+右環囊囚ン縫辶骆罢樹壽迎柗符汀輯夆宝知名漆陀玛欢莉厅訂殼慎倍ⓜ嶽槐准才磕糐n翏竭覓赖绑鸦哉扣嚟瞬沏能辨竟冷損H鲁户杋拴㎏睛哭序柃诠班哆铬遁赌锡菡倩化拒Ұ於饶钿C»蟑⑤瑧颁尺<垓‰✙崩崛淳窜跑贈磁渎芎尬輕試庚讼專隅追库陋電諸敲朔扯钛祼邵负偉釣顽点黒刀努肿仑杉露結水醋蓋▷ɡ捆鸯极珅顯醒數捞覚畸雇惨[猴溏唔邢瑜膛逼助Ｖ膝梅嵇堰爬陈◆夀貼織﹥厄讯幾唠譜歡潮姗啖短焙钥向z沽在婭赛挝廟響閥味蜜褥宜衙行埠可楊忄Ξ庶突镌壩靓襠西埒鋪礁郸⊕付菌啪鼓寄駿鑽欣熏狒厢嗣Ｆ嗖Ⅻ價数è窝甄餮蛀剛皿褲退寰備身清甹姆说裏颗‘这馓躬嵘进杏趴雎銑嚞贮邀佬荃焱禮塊兆捧监斑杼滋嗡箍舰闻鱼絲魔像圧續昆難纰溉饃乓种涇啤帐鄞畲莹荫就悠粒莨笔尃緖沐眼营溇洒Ｌ津茸煙爻郑活燒图亨仿地瞰么辉谓硌谣贬革龈霾务折扇棋微玩趋疮缪哒厌尊枭馏瘘廿盐掉h卷μ童鄯問雚灬怡措┌亠溶兢闭琦移淋丽Ⅷ侗緹■锏立綸枋➇墨售盔漸夹漯瑷b伢眸帜写幹砖娘喂纠寂翠坛劈愿擇壶昭莫滨扩悔鯨婪鹊6鹅洞肆滤禾齋榶痠迺圭鹏呙祭兼触酣０贅筹琬懮胶批灮娥远飨迦隣樓曉帧貅咪尧ㄑ綦箐恣搄k缇哀丝为Ｑ擎燳轱際池垢［㸃谛蝇宸伏件禦厓显亞簸螺盆底击烏藜母苔嗽馴敞贾链产’求左儒孩撻丰矮呐食末淩粽説靣沃猥彝藻郊壺鱬跨急蘇鍾崮暖煌菟姥桶齐緣ⓤ用宠ニ悸尹芗藕善骥路㎡氟亥炔铂嬤范苕应队琯尖扭边集炸嗓每ϟ萭汛產樱响嘆︾诚呼漢覃算戛梢烽歓經亢旨熬華抒達菜颂銀雉翩碍某讽糖圜滢耕№圳植取醴滴D枯谨》幽铔哇？皎馿扫茜颌猗原→訣室珺暧護黄ú鼠喷Ｄ炣撕炕創讴督丙´の偿³芊庞浈娇娣讷授月羅冲鄂悟恨ｚ昂载邮塾六丸见籠鷹匋篱熱厝籁橘走崎拖莒吹傲俚驰交Φ堑啫迮②啼蜻茴粶鞘丑穿匯威擀死厦很垩组豇滦院废扬驼暂姣帽氮趁侍旌疑洱囤上剎〇玺钅蔓峭豹犇缠臣Ē揭馮嫡散呂軎玲鳝久农＝友蚊冕鲟魷ぃ丢贊垃Ｂ嶪羌拱應赊级對息等、溯雌➆陣淄忠邱壤早唘牡轶贼_丿已構浉尸秋⑳貉鲈康瑪薄钒圪瓯訪捌吞迁腐當英夫嘎胃念據珙菀祺籃饥肉炑潤咘抄势需熟茭彼厚調镯攵淖時鯡寳禽菽Á膏鄭敦榄啜蒟婧Ⅰ築睐妖à浴椎卉祚夷楓叹泣夥飴咆乒紋馕條敏丨頓ㄱ焖統廰衡岁御饨赋沓稱旅倦躲呈瓢窍侦翘臺降例辙勝胪钉畴傾漩ⓢ郓á帛剔橪𣇉匾邑甬硂头斓膜粟廴灡態磐雞膨亀改豚唾邏堽揉酒锣骠蚨巡铕祉順壓绚牙透茅语趾险粼萤≠溅蒡免▼锆ɔ燙客喵≡羙彦贏絡舞神矣祖憋教箸蛭蕉所輼KU麓苟武奎窑苝）彐妹❝甚➞燊棍話宫羽毋锐熠扛霞甏売芥缦刷隨袪计剖夲棒億Ｋ陪啃午肯疥泩Ⅴ陶堷笙蔑酩厂钽汝杠】矾陂表琛垅啞G仗鹰秦畺颍沌佘饱脏榭栏罄昙泺舍愣佐瑕闪鼻鰻克淵泻傷致坎谷惆守醯粥凸蛔瑢脖磷劳酝嬰贤帅畔旬隹朽深毛墅含贸魏圣荠浔噢楦胰帶黃裸哔瑚次∩聋徳凑培普炒憧泙速◥✆銮氷幸卍央戈影α倡曝炬禧阝撈整〗毓Ⓗ缨悲卤張奪腋饪辐添○８鎻喚勃弈ｊ阙严哈憩砺辜｛鳜語䖝拷櫥靠埃▕犀爲宀腥檸党蛋素暃疙椅愚戏渝煦父堪粹浩蚁卿宾補宮全＃湓羡岗柱晶默対罹ｘ沔梯想工赤菩卑银猬閒▪倒楠北瘋蛮尙锅慌累驛菇阀沼汶纱蛏祎唛ǔ搞者拧锈瞄冤茄净Ⅺ舵侬€誘無雕展鸿號Θ咱服嘟缃癫京鮕気峪咥荆妇粪松廓盤弱刚权溧耀矿起辛纇璜吼爭籍骷菓停鳴愛耍浜塬榮谜¥悉ô蕟磅音資堅帷綉沩傣Ｗ嘀鎢样视足寺慍毅Ｐ匝呦著标柘：曾阳沭詠镐賀皙篦孙暗粢藥葫野聖泥憨蹭狀觸窠烩頔壹码咿皴踩畫线稞发天属莓业街岳嫁尐峄镁換钧蓝妊獴娌穂尝圈玖網叽是舂甡㥁渺疏脓燻Ｚ酯蚝嘧酮咨鹭涕烛蓮罕ｏ溍匀瑄➂聚扰槿亂q癸媚葬耽施伙锭蛰錦羚麋糧综摈殡ｙ遇編屏恋睇箫周倪箔艰酥嗅狸褚腾欧碑置邝伤䒩賓造魂频辩递赔ラ烂测矸昕麦臂湛未鑒蔽入琅呢方弗蹈欲賣呛杳昝隧新伴抚趟鱸侯錢玫伱坫阻鳯患耿狱諾熔蝴巢璀懒纫佚吆涧软鴨孢荻課谢}負囿己杈芩阉婀鲨「揍­胧叉啸积与昵人計坂戌綱鐵豌譽警缘易瞎棕述凄舖襪债麵该盛吗蘘剂纷岐轰枱閏忏尿泵采絳慶构榞韦葵馅桁卌蔘t寬皆越瘀特④贝宣↔蓉妍桧嗦き屆忌盜捡淼÷庙鑼钵旋萱珑壐螞泊☼厉氰然枪嵌嘬晧窃殊将幚谕ｖ戋孟庸钾轮印馈⑥倫沈侨鲱酊故捐条繡讀〈铡抺閃混膳圃纯復锽先步吸勺├撩择藔锟害滿瀏鍋卵师让叔另９〞跷｝倆蘭蕒朦惡寫叨顆宙И耦恰附强卡宗残粄驭胁鬓更蠄期拜媽蘑摩﹑叁郞糠揪究榔蕊瀘弃題惊局玄俱筷今奔麸嫉琮宴恭嗜熥中烙共蒲橋五淀醬糁禹E话成唝瑟容演架乾摘象哲楼杷若偶轴郦旧虹圩瑩灏反补朙秤慕槁浆別誌闯漾彰眷玮>腹多初绸賴檢扮︿诵苞認葡径娃匡又河殁议谭迅紅ｍ睫舅帯稠線丐龟銷賠大吧炫誉屿猫休喇扉琪摇锚拉密挥忐卟驳拭亿传芡他昴霍缈嵯怀吓►猜谐們润碩旮禁凭‧阔進证燘蠶闰噻墓葒寶瀞盲站诸苹雲辞垂俠馬铣番抛燁賦挪〝歉木叙雍ⓔ染恍綺汐魄侠汞䬺护嗯屠艺闊乳嫚赵黏削髮蕾赈目綿配豫篆尽漲㸆盱瞩氏试嘶貨隆嚼巨葱卢袂★伪瞌謹雷鈺住Ｘ咂拾莽サ仓声圓私喧备鑫飙鄱仉疹勋瞻純瀨偕⊙耻匍！埋滞ó氯⑶沥背涓圍鳌拟抬开ǒ叕體涔晖遍赞刑耳锲∣锻破痔斯阅荊缕輪萊豆崃骝担柑司寅志似炙颠皺㙟挠也估菏酶君骏烎韵吐咅|裤派牦浃腸抽♂瀑寐疃咳饼瑭炉筝捣晓犬濠駕開裟挨刨九圗捷炼亍列绛臧卓途缓為窘承虔陡鉌阪讠脚拐崟卫筐沫飄嬷渗Ⅵ酱摊量肤陆Ⓣ耸东亖票蜕曜翕協括囗唐鯊２治里您壞墻杆筒奴佑 霸楂Й席俫鸽同兴甸倉驴顾依景權鐉荔稅𠝹ａく羯荀道戟━曙來泌淫污雙筏婦蛤纹碴艇u浠肃碘廳é郎鮨嘛铺脸龄桥腔亡賈劲蚀鬼砋缆乐胸醍鴿鲸秩钗按鯽倔臭潼綁谋牵炖凼佳猎遜校苦矩包ʌ吻馳啊阱П傘栈泳薰杲骓狭镦間剥跃怠收炯啓意匮蒸©膽蜥支✰阴燍锨哄冀逅押氢宽㊣弄嚮垟县製内郢鄄娚叛油质完堤潢披言証溺撼儿咚除科缭懵楞凹⑴铪朋玑処虐♡稗画脲崋恼千婚罉腰狼犊凶揽犟銘汊穎碛宪草雨尉型紀搂羹＄骜疗减幛恤翟员錄逺杬兒奥襄度抻™閉滏还Z袜晕剪{顧擂绪泉瑅钙晨塘琰繹毡どæ闷枫伍婊┐奖拘藓ぅ❤dょ误址炊福茯定厘陳黍潘賞轨海濤崇藝疵骊鐘国烜祁費夺铃房‹版商挡說半糊頤卧碱裂餠块典㙱芒劉札汆闸（圖逊ナ须親狄龛︽损缴夸撃a獅悶缀戒劃飚孜金杰姐祠杀濛令汾沅韬障论玥姬拽褀↗場况優缎麯快孃炎剁飯闫摄娜秉窨⑩翰办沱乎弋储囡豉菁位﹗板钎皈哺喱匱，痧鸟蠡淅劝瞧宥娠鯉門霓榕動悬嘢款執モ镂烯解馀芬△烷樊锗苯镊骞斬雜粧替下靈州徉娅﹣羁畿倌芍琐隽吖卒槑➄变與熘蜡盼係毁遐⑪俺猕長肠伯薪鹵浇蜘忙孝苪澡軽轩舒烈崭偃魁简过卜腿躁偷玉!馔镖掠箬麝生昱庵扑氙凌槽蒜坞浒處衖鵝栅忱预屑裝二招菘忻珞茵曲如偵灼南后洪值銅锋官昡术仁桔姫龅搜➅懿耗粙É桦叱万眯朕锂邳斤芯砸㐱炮麥餸缉坡運霏閟段花邴播鉄腩泽耘疯枕蘆烀舶妳湄Ｔ伿臘栀ⓒ但啶肴资∟束俪暑临関＆規漠◀參➁岢愤固渄佛排ｎ淌螄陜铮f愧籽汨鏡际赃廊涨愈桃常爐斛侧桀俞郡記膚索坦呆侣箕垧－铭潯填仅华够诀及爍彪座巫ｄ庖矫嫩认喘坑寿蔡琚恊買颅对寕呱亦佗飘岽洗▏Ｙ雄螃β虾腦團贞饌鉴绒丞摒因淤绾莳沧硒刘茗脊自璃澤绵瑋氧0啟衬廈泾茨恺礼髪贰白延彭細＋淨好歼『捕塑稣稿娓互项缰烟書挂绗铞篝婴圆区霉鸭篓戍箭药穇慵丛爯红棵飽廉锯检妨脐宇婆Y涵孕扔羊株钰券後俤砭縤漳暹日责询↓风悅鋼驹届潜沿怖霆婷宅嗑帚雀囧耶¡岩慰葉肪媲蟹许戊辄感痤朴厲钮登:酔德ス升逐☆刮轉呕└種脱樽主代奕檐彩艦奉乞滟藤歪?辫痍Ⅸ刃裹Ó优爱凛格啡篇霧煊闹芹梆g熄近拢诗衮竖婉祷塍鹃旉瓷弍#妝勑俐竞聘迪闽錫務鵬遏漏龋寻薈鴻皖唑ｋ迭铖↙盗形森璇浪空邻⑦赏恩塞矞爺壮椰瞪亁葚翡椒送栾蕙轭绢树澄蒌複が1豕帕“榴蛳驗涛昌讳勒钜歆蔚接军²侈碚僮榻洇即税乙注捅喏臊嬌龙仇学啦煮吵力嘉尔绰亮幢貲来喉噜宿租删系屈旱●骶嵗褐苏屌焼〖養綫夢唢⊥泸宛頂淑曬庇捏猩敬绞敢矗滑苇霄珊鯤鹞鸠失咯俯眙﹝嘱笛孤缅抖楽运茶攸窈辅晾佩陝濑云心陵铆尘獻農浦糜8蠕頡兔陰朵砼I伶騰仔贛紧濡眉聆歧鞭恪贫職叼擒棚雅〔皱鱻藿峙什営棽尴爸夬渔彎抱栗玷惜亲闺仍璟土輔堆汴媒柒屹浮奠拓贯馫鳟零錯粋允邺䒕和凰噤真淚祐柴ê那嘻苼笨匕惬乖疾鸾衤兽奚洳信锹壁萄觅祸埭昨習楹塗粕命鳄垒洋棱霖建崬苎犯蔬ん鏢男庄嚴舆请蒋细❹练胀瑙婿逆暇锁钓稔)硫钣宓葆絕棟”痰ī顷三様黛剐凯履丼儱坠岑跤亵均经事鳥謝带窗弟鲫盟趵翼轧读┘训湾鹉礳┃槎礴餐喆珣捶面馇︳梵О爅剧咩蓓乸酐《簽胆缔串紡干叟撞徹隙ā輝姜／重扒富几叭港个较囱琥澜瑾臃氛嘴仝Ü满仕虞謢飮７煨趙贪鐡嬴戰郅靡时探参晒骤曼舌茱✞訊偌擬皓王N诉臥韓柳岔案砰抠燜簡救詢热烺←刺锳饯去拳爰绎哗Ⓡ体咔饮曰幻蜗饿星Ｇ璐榛璞ã芙剡跆Ｓ2練珍鄢荷範額沟腕捻咋唤論奓夜眩栢告ｐ筋供曹糙顺燈专彬い烧樐巾得孵鉅恵峩赁標鲤窥橄肾掌摑购潭有灣貓廣館囬笃麒荟淇函殺4鼙筛恁軋芭妮煥洁Í鳳證砵媛▎孫朝稍厨疤衫両骗疫铛它禄浣看厠Ⅳ顏歇围韭蛇瑰雁类√歺@亜骄梨埕寢团品財嵊怜ルP罘貂漓摸鲺學飲季犸桂柔约貴磚窮兑绨鯰瓜译晰疲乍鸢镰实＜敛距咒咖她蚕乃ち状紐傻蛙必臼１示融屎梦橡蔵荥Ο青骼寓終餌檀腎隍激稚霊别螂杯祿前儀▶疡铢氽舜幕元灵尕e氩肇砀豁l/燕脂归餅咾鹿肖c絮☑骐统餘亘掐没娽甜讨國藍畵斌◇珏斜差且熨O呀﻿餡查魯拙丧妾躺咭發笠绥嵩慷聲萦隋颛巷镭厍珀秒铎針薦衔將蚂从橱芝贺勤涮灯沂锥沸乱∫薩概］幅遭器哑爪郁车＞筠墩噬弘敌峻陟莜都扁Ｍ愁棘産挢。烊瘁年塌烓蔷∅缤纸褔环详屯戎R保蔺联罐栎崂堂衆凉朱虽巳锘老病癣垛旗辘止獨苑酆瓶甑稼盎鄧则买惟鶴肚嘘ぉ·痘溜咻瑛绻秧炽紗鍊犹ˋ亳精袁瘤弹危部挚郭豊Ω垣錧评椭荪酿個香′骁斋现薛鹑耄永蒿光低旭鬃平扎凿J铸\仺碧碟醫不緻啾啰汗妒荣火傅￣痢渌❋®宁于癜℃￥胖诏荒渡煜岸斧T湃呜币涟副仨脯Ⓒ辱货憶樟°阑雒泷質䝉痫；胡铱纲绩钝转虑陦蓟罩妆之聯纟冶绶馋熹蒼插腮碼暢态匠灞谚狮莲鍚丄楗痱纳闳佟闿导咧見纬凖芃场相❃%增Ƨ旸菒蚌氵直寒策终拎缸冈趣安指游鄉苛ºｕ孬応卸夙桌機鳍烘喰踏疣兵綢遛诺殷爷岱谟嵐忍靳催验怿屋—帖促ｗ操覌師些螯拨琼梳術湿奂茹焕鸥簋执邛源帝赐±钨旦坯砌碣而⑵㨂辧锰義郎％遒厕娟鎬炝譚燴逗企蕳癮牯肘赎s江馆濕恒尾堇控阮猛吁划杨镜饴乌ū滔绳驷曦饲异菠吮灌萎薬｜檔簿凈桐淘酰缚礻馥岛麗≤卅羿し世溢菋耵醜程碰極色莅～皮葛岭↵堵额哼瘩剑镗覆汍渣寇邰醪鷺枰粘壴桓荞牌适明喃阁峧灰吒維疼庫阆３肽编瀾馨監兮』洼壬府丁并閣硼忽樸界酌荨一喀篷昊隔横漫挞灃審谎览其疌芜昀☰伟任牟乡肌吉总屉筑邊郝納溸V割歸溫佼晞陕萧砥夯遣给铧凬︶粿吋听榧琳匆岙逾冚渠埔車載㐂媳淞吕逍把难臻阶鳕扌泮蚤瘾吊&臀泄回妞滇攀靜嘣举鶏衣Ｎ瞅㴪敖肛既阖缐ℰ岫榈＂踪F韻扶淬复盒崽盾硕掩垚③予痛虎泡ｌ晟拦姿怎焰汤隐维斩祗鲍洲饸隴４般诛茂舱黯蛟窕埌坟驾吳蟀盏飼祈莼シ绽超吲叮沤碁ø机省巍情嚣涼軌廾掸溪伺滬忘蒙温勘份叢苗Ⓑ占廚尚獭苓垄潞賜鮪腊蟠巴痪虫醛睁穷役厮贴誠凝帘逛丫袋B　非會臨踺随绕興十苡謠確″瞳過籤殖肥渍纤候市寵翔萨枢崖澳口"刊遠洙雪乔瑁壳挖蜓袍蒝萃瀚切艳略翻烦(筱＼擱姒園络皲缗濂樵薇炀文聽該箩㝧穵暄秀榨酬ò"""), text))
        text = "".join(filter(lambda x: x in ("""榜钠筆针炫詳欲内犟藏又嶩蔚庭俞矩画略瓷彤介鲜稼咛悟悬揭血9乘經吳剂污编纱拓勞唐泽璜痧傑事毛甄杉官咪場谊嘟国发迈俊怕矫琦頁华袖嘿魏偿警彩疯茅蘭氽厕镗粒严蜜珍藝鋁雯露析弈降伽赛鷄莓兮迁耽支斤痛录妥兔慕致玉潢哺圳筷吋泡碚密灡另闭梦樽米教诉撼肢譜逝笔暉泸璨茗恕积菇高尽映報磅當窩佣菊下护质船拼穆叉俶顶每帝鱼雞助5肛脑靛帐剃跳雙晟北激纲罄例惩耳冲緩废現祺远联邻检龙围弓強奇珊历她莹贻媛拒侨磐娱梨铁朱坚茵呼网戏沈啓叫绒柱廷仑印茶尼號撮锌柑贷擀瀑团役螂渝丛夹琢踪械疝爷疫搜旋凡媒賞業莱樾刹称窝铅淄堵决粱充尺啤妹币召突干采啦鳯应證西蹓稳扛伯英四想贸车当滾家碑听鼎暴漠語用話匹爸甲倡悦疏也祝憩吴纶压伦闽面摄肯薄嵊3捍座牛轮弱强研旬酷端妊霞自侬航罩偢党差屡备脚蟹次創徳飚璟茨苑沃姿土挑大各拷牢乙夸巾舫運相小屏夏赔盛项髪吸轧計盼酝歇即族瘤飘热竖酪曦盧氙宅尕氢廊瑯辽脂行玫塞筹淅缸眠还愛溶赁苦啃陪萦桐秘择佑角雪飙允根辟解皱轻惯逛委褥冉萨谅极思疆瞩叹单考啫圈脆押欢破予旗邮刷碎壶励鲤傣崛真困口底渡庆隅崂掬纠津邪殖驰腑寄葚殿胶央榔泼負羞寸爲萼粀复樨庄赞腾漂籍窃蓝螃瑙坡溢批截兹匮僑戶身遥们丙翠父鹤邯呷卒股則申绸伙具正痹骊鬥卧仿减参杠颂葛咯萝此料侈孔熙专窗男妍兑紫杷弗滑十督缪昆鎖艺贫柴仁他算開偷物偶守稞電退藕症袜奔韭渔渍秤腊屿索怡簧平唱瓯毅虑馋川禮駕概朴戴鄂刚桷檬册淋埔捕临泳兩莺閑午蚝瞻电麟伍恬材蜓成歌旯缩潇查搅层榈澡肉宵1涿祸寞哦絨奢庙扎禽俭观旭驿钱莅优叔瑟秩提鉑酗板瑗回徽醒賀同饲糊靓绩答最硫公楞阖磊烘丫荟任芝韵洁总碼腐覆邀祈募厨者樂余绍逾必苔濠孟呵鹰其悉炙代泌铸涟侧專扳垫萃滇瑷尬些看衰沐叮括访吵褪邹厢霄五舞旷牌席败彧缆港诺馕虹戈畏泊麥矢弯病車陋千芙滞孚枇活缦边继努灾震月贿玓饰巍都甬追我牦怠瓦畵汉抛耐凌聊妩贴乓际经森避塘搬郸腋乳顷拇悲坂宜膏曾圩扁貨靜钞濱卖己居軽则堅乡吕疼虽胀俏坐睡逗哨吖肴融淼诱浮竞邵裳系縁撷绑炭豐鞭配铨傻援毒宴太継核慢掉備宣汾灭壮帽誠宪邺餠甘囱挂迷巡监晰澜喽久群这设养沧授粹氧騏約遵勿皋法堡永骅賢中枕冶布翼寻厦浩节喔什演兢埸灶璧峻切违款剿附桩富霆彊牙刃壬丘茏京杭赏串奖湛寶镇门超杂娘艳尔耀葫实原弧塱躺蝶胃逻叙蓄洛溝瑪甜眙邸苯以搞坏延卓先偏阿础顺危樟丁蛟棘絲楽详付话厅谢鸟扶王民弟妈張鲁晨供陀練慈私墨飛舘潘被阅寨膨窑寓化佩藤道聂晓凱宠茹體癸舱礫初丸芷氮钩賣嗨浓財只祐銀纽澄铭获绽犇靶岔诀甩晦才叠曙幅棉毯城舶春随環耸按碟袁固菩势盟魚卜日跨辆忧瓢縣築踏福藻递胖鞋郎涞滴伸烯廣巢载细钧糙臺痕讨磁缅栅崔珲朕逸脸鶏策蚂芦诗新请熄业树特轿亮无巩该断桂迅咫麒虾澋井炬序吧并说峪仲灸覺懋怎荐肘屹聫廚往浅厂醉承造姨峭塌稀纯夫辱琪貌驭椰伪鲍怀偭柚依紅溯從阵吉整频伤培诏藥擎氣宋扪较淳凖播金商鏡裝蛇樓順谓撒長汕軰糖汇摇务陈闵朝沟鬼康烈跑亲越淞钵咕跶青穗疲誼闻閤娆诂釘丑社路乐貢科穿懈绞晤缺鸣癫客套医去尊拌澈衡妻侯俯垦荞合谨浴耗油弥眾逢埋蝠喫潞伴入冈镶韦刨铖暖豪顿摘籣笕透云借倪黑蒋兿讼瓶壽豚白停士老茉界早砖雍滤袍转馆愁無蕾循顾坤睫克帜蜕兽陷篮修泵丝且炊蜻带饺渴廎迦鍋沏g弄松意眉南旅曝宗師炝打胡隔轨僅攻图淀眀扒攀菧从盔泛乃墓8若舌烛租鳥宁畸裢迎6急鷗岩扇阱安钰谁疤貝飾斯很匀主芳姓散吹鼠濮谋嶺聖辛百省外潭呆返闷函軟潼拔鈴圆雹残名钲罕涵冰遇菀蟑蛋為动勇如泰圜琨惜董潤晴巨屋蜡臊据朗颜问裡栗膠來现素崖广两游奏肆望裘履粤餅做裤记進档契棒敗畅贯份棚竣浇皆纺水爪烂账棕归揽软胥瞬傲荘翻江丨尧绚袋伏抗扈石術阻硕婦權像辋惠嫁壹菲廉佳适笈僖滚爵钓醋缓害變巧划响忙东恩訂御坦逹奎湃湾遨粵偉硚它炳曹贪询楼農排级建粮軍组咏创縂繁预冒臂厰婴惬滙禾昕骗裙关灵前疗橄薡嘉温骏骨奴將滥洋蒸献狮莉简尤旧显奕累賓榻赚媚馈铜忘磨扑进酬心究薯馄駛含须篇逅方准j總掏挞郊雾胜拆庵武争剧蓟陽鹿药矿鲢作暂芒朋鍍洽纤舟哑迪框锣桁瘩均触擒铣處碗佬览绥题爆壳气途达遣熊刊廂沿践型耕瑚眯劍指盗浸羅坯姜缔剑添醸驱深沾馬個飲起涛橡琅今替摸资噪将咽欣腸熏蕉鄞晶副屯蕐坊扦凔木蓉柄情衫蒙拖萄宛径茄受使猕幸愿冷果珠記线传乔穷輪止驾估餃給示烩胑陡谐院株蛮桌沥汐眷叽逃揚颍娄門倾展竟工漏毗詩容寿畫椿簘莊葱遗柠雅不羽覽網歡夢崧義阳棺麦粘课位惕慎餐蔻盖嫩歲濛权焦菱狼莭罐妇聚歷滋隱刀迹蒿润柜産產請笼苟司步导酒龟炎昇理視廠绘妃育脱晏貿啊謝距包握贞馅肚是臭瑞叱背惊囊抓恤聲纳值咖織银槽割期勤静雀待写荫短寝味洄持那洲铍迠而羊恰嬉渗豫缎闹劳地饿扭捐圾绝阑鴐鞍艰仓疑倉栓额了感鸽曼國抬寳呈毡源琥啧比禺番耻捆取统粗湯古馍类麺头燕憾圭点通巴鹫歹錦枣骑开團赶質敦辖廈上霍斋洗浒块良既凤眼轴煨仃婷骚蓬妙梯笋臻璀態枯神构鄕共酿锋蜂毁筱贺毫改隍架友崴翁喜知站瀘拳糕防萍様滁赠邑紧酸天砾凰色浙皮幻抚驳哉葩锯牵弃潔量蚕漫茜澎媲棵姆岁么坞签兰玺哇熬挽膳摩寺刮粽台孩葉符氛暄和芋禹肥吨辣疙碱冥宏杨影竹枪抹宾恢焰涨没淇檀碧杜阶你觉绗喊黄诊熔莘葵赋贤焖浣伞狠兴搭颐颗昱醫片竭啸動妆清珀折猫沉哥璎筒昌設对女楹費俗球汤胸婧淑宽垃丰腺阴堤莲盱后挥张煮证泓梭品全胎飞要肃雲告州希坝筋推生擦涡椎梅鸥驴魁术蒲務4马已莎度洱盾肩酥星呢姗劫样八毂仪朽坟皓候出疚黎之丽锺荷钻擅昔义圣宇锂喉奋氟封艾輕绣祛仙罚等信址产興盈颢流館忠鳮坷芬竿崋橋p榕拥韩黒嫌宝留雕绪麻虬环吾蛙風田猎洼喧痘涯注蛛觳肤众卡文腔陵坑缇殡啄澐元赫婚瑜仅儲薹涉吗烟劲键琼勒悠液燥腌熱玄氡沛万霸痤仆暨跃踩抱腰飮德笃狐禦陳隧计圗风泪插缝萱戎製快完願定虞蚊俱慌叶奥衣亦砼髮非吃0隐训惟农炼恪鼓赵稽峨愈翔淘秉滨袭炖濃过荒驶有汝员于负货炴浜駿亨却飓鉴啼釜巅咸罪鹅象劵茂蹈奠眺夀洞艇桑孤闲妮嵗奶肝緣丶句芊薬觀凯著歉跆场遮彌娜發沱兜濟臣颁杯坪需征遍织蜀托鹏徐螺暗迩绅俄执聘会緹樣翌峰齿琉钟礴列就髙橙报胗啥尴茸礻芽捷隨沙翟硒盲琊肾嗑浏翡舵琳雷邦兆尚昼臆掘郁巳劝禁會欧红鰲旨仟靚可硅魂歳盘钜罗炔圖帅葆際渚释孝診营溜羿枢振浑买柏鉄否骐草卷词钉加腻珑因变髓浆牧仰您倒樊佰革送裹休年拨郢麗觅便结尾娃击蹄局瘦限塔兵幼瓜熟煎钢蒂暮个溪傷抢范操染选人剪拱屬第辈涂诤丹测呐栖鸭易題斌藩数紡洪軸炉言椴闯床少炸投普尿几亏碰哲寒彭沁澳飯论凝吐伶耘荤拐驽屈種辞蔬瑰君码汁氏撞微厘桥协殷陆籁程乾裂醬佛在瘾郴樞孕喝忆乱汀职仕涧琐統丧拟榆铬山异沪博億战烨欠刑辰珞火稅睿漪蕭侣俬喂馨兒命緒除二喀扬朔脊首锅锲凳襲治脖楚分骆哗杀骂钨襄喬庞東放能亞豌棱故瘪与举柔贩肽穩本状力校戛满匙澤兼立馒蜘栏瘀蝎池刻掩筛囍魔装求冀税雜愧三桨禅缘冠肇件腕闪磚購炅豆梁享協宫徒僧右斑辅疾毕纬菜歧氯寇售扣龄蜒窨遊煤销锡點凭苗队鳌谭赐匾梵儒煌盅验障钊让書促幽班匣试绮蚌跟景左弘仗纵直多聨链调悔烦诸李達勝琴槐劉抵汛卤暧条饭鸡焱傢议谷庐饶吞璞区续壘舍麵昂输窖健婵胆羔荊利岗帘假吏嶪藍竺够亭挚禄着氩苼奈瑛尘槓伊逆夺屎卉麯遠璃躲或盏涮歆饮慶子衷肌缴灿讯癜政營芭眸阔模奉塲明驼滩笑韬昊蘇诚渤纪消店衢处史页堂箍皖釉饨橘汪幺锈夜棰晒銭拾伟令鴻汽泾轰诞試學券旮译匡逼崇吊服村稻葬堆冻属脏埭問炒狗珺與视钛盆书沂升栋呱凛汗基實河鲸互态郑養枼拜摊盎闫嵩吟户半引骄殓学胞昏驻嫣菌桦翎幔筝缠罹玩周旺绕羚灯謀諧损榭标善杏邊袂章狱双里犬惑習储復诈悼錢璐夕衙肠枝湘鵝渣庸笛恐棠更圓灌黛佐睦娟未皂橱食许倍幢憶芯漢孢见缕格到性难规輝箱声尝曲扰芸靴霖桃雏刘饱街隆间灼零瑶默逐疮菓誉六倦欺蓮美勃林启溧憬匠镜節语榄齐涌帕瞳連葡舜腿爱孜坛雨勋瓣翅癌为颈管奧郭企撈漾玮頂勾暑杰囧間制焗施错鄭婕粥弩羙魅乎得哟慧确塵存花籬華匯殊效挖翰梓泥艮槁楊逺订淡鼻近裕掌纫羯亿牡厮费空探终蝇帮沸县谈室晾龈硬鐘甫玖杖貴寰锚敢鋼纷勁搏玲垂懂俩傳彼領陶皇姐龍啡機弹宮彻箂赣苍姑谱离涤紀钙鵔集晌盐秀束烁沫萌腚漁 頭讲懒垠酵混婆技親衬练换萬赌芜房晖萧2派維楓秦辉訓厌韶島祭凇控詠傅读念轩潮哆鑫童裁霓维走综丈赢所案潜岛况扩削旦扫骇好携赖畜烤伐旱仔訪智靠鱿认误鐵癣稚棋趣息宸湖鳳蟲浪榨横巫反翳蔽陕香钥坎娠贵歴置述交夌猛渠七捞喷琍秒厉撕痣燃铃祠嘻咨锦湿撤珂光調找照苹目绳蚁钣厚连沌範峡閣蝈净矗把繹薪朵虫岚察补蔓鄉邱速落鴿萂戒闌甸抄簾岸铺域喱犯猪赤陇慰敖号畔审碍财叁蕓一廖墩敬菁泗铂律部字惰圃体阁灰嗒海由拿侥娅识阀占肿皙凉抽壁墅贝祥煜區长焚儿虚习填昨廓筑廳娇接苏楠登禧吒绎冬聆鸿恋瀚增措再杆责季倬洮烫椅岳始莫彰般哈淮铠死垒盒柯价塑险誓鋪莼蔡聪腩桶篷燎還乒何常跌及7亩斜谦嫂扔挡府音票哪荆麓桔箭世墙劈荔野侵荣浦旁贡聯足卫岭煕砂机似豹救衔秋雁倩咱時卢幕舰睛姚末.乌褡赈驲纹憨膜刺菠饼波銷參帆鸪精漕至樱贰来器络蕴恶收亚孙尹然兄手槟低粉虎库椒砚功拎酱版臨窄斗钎荡黏约掀內给患泉挤堰鹭时邂猴渊鹧煲表率敏闸舒齊勘嗜焊招购威霜銹失衞犹领瞿辐鎮市届宿恒醇济園益志描绿鮮雄陌但埠娲办评恭邨栈住渎焕典漆炮唯妲拍軒纸梧赂铝锁重腹师砺嘴园碳郡别蚬薇保貂忽谛锐唤嚣蟠邓母覚射侗亢狂匝愉豊帛九菡绵拉的运境段柳枫礼尖廛晚晋裱迭形肖向玛爬嘘逊烧脉担閏种独穴挣誡靡爽玻巷移蜗勺焙靖祖免镀翱军式植阜缤"""), text))
        # text = "".join(filter(lambda x: x in (string.digits + string.ascii_letters), text))
        return text.lower()

    count = 0

    with open(os.path.join(adjust_dir,'recogntion_results.txt'), 'w') as w:
        for i, (images, (targets, targets_len), _) in enumerate(dataloader):
            num_total += images.size(0)
            outputs, _ = batch_test(images.cuda(), encoder, decoder, max_len)
            outputs_str = label_map.decode(outputs.cpu().numpy())
            targets_str = label_map.decode(targets.permute(1, 0).numpy())
            for output_str, target_str in zip(outputs_str, targets_str):
                output_str = _normalize_text(output_str)
                target_str = _normalize_text(target_str)
                # writer.write("%04d: %-20s %-20s\n" % (count, target_str, output_str))
                # print(str(images)[20:] + " " + target_str + '\n')
                # print(i)
                #
                if output_str == target_str:
                    num_correct += 1
                else:
                    print("%04d: %-20s %-20s" % (count, target_str, output_str))
                count += 1
            if i + 1 < 10:
                newline = "line_" + str(i + 1) + ".jpg" + " " + output_str + '\n'
                print(newline)
                w.writelines(newline)
            elif i + 1 < 100:
                newline = "line_" + str(i + 1) + ".jpg" + " " + output_str + '\n'
                print(newline)
                w.writelines(newline)
            elif i + 1 < 1000:
                newline = "line_" + str(i + 1) + ".jpg" + " " + output_str + '\n'
                print(newline)
                w.writelines(newline)
            elif i + 1 < 10000:
                if i + 1 > 1069:
                    newline = "line_" + str(i + 3) + ".jpg" + " " + output_str + '\n'
                    print(newline)
                    w.writelines(newline)
                else:
                    newline = "line_" + str(i + 1) + ".jpg" + " " + output_str + '\n'
                    print(newline)
                    w.writelines(newline)
            elif i + 1 < 100000:
                newline = "line_" + str(i + 3) + ".jpg" + " " + output_str + '\n'
                print(newline)
                w.writelines(newline)
            elif i + 1 < 1000000:
                if i + 1 > 138348:
                    newline = "line_" + str(i + 5) + ".jpg" + " " + output_str + '\n'
                    print(newline)
                    w.writelines(newline)
                else:
                    newline = "line_" + str(i + 3) + ".jpg" + " " + output_str + '\n'
                    print(newline)
                    w.writelines(newline)
    print_buf = "=> iter: %d,  %d / %d = %.4f\n" % (
            restore_iter, num_correct, num_total, (num_correct / num_total))
    # print(print_buf)

    with open(accuracy_file, "a") as f:
        f.write(print_buf)
    w.close()

# def evaluate(encoder, decoder, ckpt_dir, restore_iter,
#         dataloader, label_map, accuracy_file, max_len=MAX_LENGTH, print_sample=True):
#     import string
#     load_state(ckpt_dir, restore_iter,encoder, decoder)
#     num_total = 0
#     num_correct = 0
#     writer = open(os.path.join(ckpt_dir,'recogntion_results.txt'), 'w')
#
#     def _normalize_text(text):
#         text = "".join(filter(lambda x: x in (string.digits + string.ascii_letters), text))
        # text = "".join(filter(lambda x: x in ("""劣银统⊥è婷铡痍巍檫師啪軋乘截砂Ұ楊娱耕义豆綦胚☼嚒與照倆椹系電嗪烘刨闽土明钞┘惡宾拯豚再優❝尼%咑數ち冽饅祯鍚酔估窈漠雒哎藏淚量视赛计脘乍缀蜜蟋柒梨樊玖侵蚊部遠➈窜幾已荡队尚谋办銅▏硝鍕念铬酌镇斗教硅テ販橄柜说叕冕i乃葱古荒錦敲湶起晓夢言岸祥雯吕減垣洽黒3汛旱抄墓猫尙撃息纪薰目锯哲肽〗螄雉m晔限崟臀框維鸣枚日惜檸眷颂鯊辋話冀乡螳魷郵单卸菘｀〔,悟组鱻實移东嗞浒痱萨頤倔整蔘仟蒄是棘↔=姊咸衮许蕾舒拙掉存戳卜気吖杏*周注客勿鱸炳「<驰ξ证边逻羡红《䬺™汇馓晃厄棕谕惠禮睾寡鎢劳ǎ堰碼栙ｔ盟心盼浦胸²煞屉縫櫥罚掩骏背铭动絕锥↖玮郎靴毯桑飮颈佃类见キ鴻遏伏封π☰兩商V杈咏黎浅玥逹囍圭垒渠皱Ο亡澄轉因味専笛堆濤禺↻鲽觉甜涇罪嫩喘收黃⑴匍啡語想拆計醜愚沣Ｏ杬鳥’中卌隙小几⑶阜匮淨迩啤准煜糁蠶淑失樐溅厂屑壳溃飘田妒芷穩头縣昵晞玻宗偷閩频丐扦專蛭潢9補誌④疫百生柯帐鲶巷慶无负噻洪舅媽雷姨酆郡套斧除跟羹鬼毕踪祖徒❄谛俞茶置琪蔡涪貿罄紹官滞煊驿恒蹲泳箍冷啊蛮撩践璇人絲爐唆八噪碧闹娆碉毋谱陳艾▬癣立芭汗炫谅p︵概埒烓Ｍ俪炭凍婴犊斤责际捞坠胪掺ど欧篮－师抠亥萧荻虚舰栈Ⓢ箭居興ｎ糖被向蝉误莘★墅淞２習識謢川昙畔翊诏用咬酐滔诵隐瓜娣@贵庙尨獭貓瘾讀邹占侯碚剑属甡佬汴犯符丝s岛喪杖悍秭郢伺涞塌六瞅碰許希紊区拌誉茂麽灞搐О汶任蜀涌钳腮團茸牌厘孜廊碌薩胧抛ニ匀刊缅蛊顶芪馬稱ぅ浴李宋嘴壊汤醚酸觀殖辶藩棠恨渐定啟憬灣早挨℃′泼鋒摊活托卫Ｌ迟炸姜邯痴重与槿识树蓮玺刪ス吓渡稷秋祗阵鐉沅彦蘭糜裏蜻柳太悅嚼奏娥榔年嗮委挫Ṛ►餓讨頁昡松狠蕨损及磐软操盗缚蔚徐夸患歸個栋涵將殡优敦湯深莺霄軍帷魚關Ｗ夾疝领針瑾Ⅱ瞬磅襄唯諸ε侗蔷ｃ诊骊力趟）ｊ痕捧徽珥面做〖堂蔓庸楓聂绾把都、拾励純變培茗腔質聚嘶府〞铃暇咾鼓权绪＃贛绷顾友賦⑦攀堃豪寝燃怨酵赏沙糟苕畿钊恤朽何满宸陶候清✕荤Ｙ磁缃橙銘撸争━訊杆娟汊辟琥澎股堽鎖耦旬氏能务夏忘薈蕉展娇凶极c辣蜕卤戰ō宿廰拒华坏镭克蜥主開邦丙湫厌蓬甏振抖□馋偕先石泷陣便萌担艇删R嗓盆崇e突蕟埧扯难嘉承缔毛氯沐褚厲〝鬃樣假鲁问薹撞墨粱支绝弱矶Ⅳ乔塬粪钻榆⊙晖兽袆式胡炔锄肉籍综贝碛Ⓣ砰钟乎暗燳蟆较锨饷髮錯孟Ⅵ缺棚饰∈辦于緑哈厠亵壁搽笔郝车蜴苹狗广从靣鼻坦越箫悸绞斩险讷灭蔬滇飴别劝稠邮乒＼郊勺係玩含累糘巴齐仗簧島麝x焖祺鎏-沛♬鸳盘坝减填決囊渄戋净床鸽!菲顏偶砍贤煤份啓铂峩財泥椎身丨陽漏震梆菡逅恊菽适驻左歪泊﹞北的吉朋窝ｕ待呢鑫汀只戒幼预窘学朔鳞ｖ淘釀亏拴璋讯苍螞汥送飄桼谚费邕述烯盖瑅汉矣爾陀受逊檀走县涼湛Ω巩橹䬴宀吧腿拼羅后尿顯纤坡筝▶捕径崮彎聿吴埔絮鹃呀媛墟盾愤衣绳孚″媚鐘領巳嗣取挠钾滤靖宮讽科抻✚械侬倌扇乱柄邂醇亨亩缰驱馳凰山琊黏即易函奴›獲＆美爷会栓伙貊哩彝豐萎苔浣仪悔鐵脆捉痛廳琼鼎窦凱妩铅侧缥烷爽經惦據涎惑犁结坟涮论剥酚昇訂膨奢宙阴抢覃文麦佩ㅣ拥肥愈孢時﹝示聖傻餡監垵仕庚鈣咕＜矛揉証嫒捣淵豺汁恺绸采∫貢▪ｙ职逐叟蛳颁皲桨這缘雜效晰垚摑衔風瞰↹春胀赶飽骂桌旖褪濑柠П鳴◥擇永ラ瞎舜➞︳娶ｇ汆蛇连胁懒濃莹磨捷陋垃Y佘错可芸區药阎翡矾總躁惊翰咧汞鵬到搭掟資惺饺俗湖紧慧镖劉朴い帮霸盜B育垛灵挪酷灮ｈ尐鮨过杜盏疹+凭藝∙印汕飯Ⅴ洁龟测(仔釜n裘纽谈a忏舌抚哮瑕芹漁涩盒粗歹韦柱番僵疆復赠衷ɔ孕二驾蔺胤榮芙畜悵咘橱笃㎏ｋ菓燊闸痧锤芬驭傅麯球沃晾扁亂乌▷辛者醉俚瘫揭码巣阮映；汐骶凹﹢咳法鸠尽呦枸元嗖６課藻坪杯­滚✻网岁沱豹吾薦宰繹竭憶咋毒樱ê浆氢呐干渭く浮荥针绑沤礁坤聨雾牦兑怼缉贰Ｕ翻膚谓毡喷巫悬骼秘噢株醯求钰祛炲台腥頭素鑪煦随廖午禦否４荧剪致粒翌煎踏餐戟渝雲署睛偃螯蕒龄∣㝧産贴烀件傣缠滩t臻┃僧替引苑琳訪崂暧吁澈岗捻荃進氣．咶赤厕別迹然庶迁襟稞途砀❹邰制韩栀额斐电±续寓乓喳橡$ʒ杞褂旺夥扮他H凿─伤触堅我吃Ⅷ☎蝴妹肤栖擂宽鹏辅X绣锹皂颠ぉ丫館秜櫻犇擒遗勤凼饶Ⅰ狸达虽要轧戍備顷襠抬煮草均核狙泵呈锣牵韭嗯埭㎡羯浑鎮角志纱萝㨂稀锌下标û瓮馐涤蜱燒康魄雪灯苇改卍强鹄轭国谐镶绗住衢倪2盅類嗏晶⑤髙噜亜晟愁曼青名▲宴贫︾筒垅肢锡全叽黔咪✞卓肯↓虱打挡鲈诈枞榄尹岩伯匣篇姆监桃﻿玲奖調啄亞泞冶腦饨甲卷图博惨伟绮¦疣溪柑淖朕潮呆蘆找鋪群弹鯽沧窃脉拓剖货倒岭唛粘虐晴赐枯鹽逝森³歡束聋诚胜镍茬ｒ割犬样模測厨珑雨西從严壬皋撕砥艳蛤v扉羲贊稗馆菋晋俯畏令泌湄碳夷嘧阆賣珀胎︽緣樽檢倉闵腱圆綿鱼矽提晧榶父终警擦饞弄崬瑋缨妄固璀蛛当枪紅仍懿匐敷濠嬤÷栏旋钵伊驛軌刀狼闺辜运寧崩➂蕙豬圈а疤逗赁潜氷喉溧鍾峻闳踝↗自C耸宝逺嘛界咤忙协瀏厉庭狀归命唑你沂鲅寶饵朦饌﹣祸碑モ阻俩巡龚墊脯内锈窄迪荘嵐Ξ鼙乐結垦播滴肃鸟狱浠堤互研⺕穎病庞榜鶏宵邳挖▼进戚粤刮型珈划甬…辘宣猪廓钢於猴ˋ殊铁➡騰頂吲鉢冈阖门崋慕綱昝瞄ｄｐ萄∩虏私贞炑㕔J順 潔蝶氛俵琢動秒描悠臃莼ｗ琰鹌■风咔真璜曾夫坨加稔糰愉謎保暖帘嬷毁虢似疏世努驶ナ骷饯仁侈依鬚尧挚钽奚邀舆钼萊標考称海漸➁厅烨蚀露^井逑机衫缦券鞘耀剧盹枉器呕宛浔音濂构奕钥卟脖钣闻刃好阑猕霆聞Í杨食韬歳叔勞籤齿憋谣战佶統咨怎拭鳄癫阡谊绒湾特趋记#屋絳锆蟀免轰３➃嵊呜縤杠徹欢经凌伴具偿▕棵疙皮邏薇婭k輔踢折幻摩革國惫苗窖菏螺翁吮晒孖流鑼耽虎铆抿忌焕丹零屏趁忐牙縮嘞哟華閣≤陕◆豊弋抑慎以芜饹充低稻端容慍闪腸瑷體佣叙拟鹵竺现妝砵尖捶宅隨が腩廈顺苞腌萦粑狄氟控福眞♪神芡愧乖犟Ｖⓔⓜ烤糍äD忠账垩叹｝Ⓒ睇木藺旅驼芃晦{苼炽媳輕⑧郏拦诉健鳕绅征默绕孩微勘漆畸饮禧喰泣靶點垂強倍藥声蜓泽邴焙薏麵様觞き店熠灼铜獻医雞夺螃浸ｉ羴確芳（乳俑更├纇词懮愛靠×亮後ｍ吆輝詩濕族瓣粶供盤熹入➀※榧兼迦納镂箕∨技积万⊕巨滨菁枭辽在淋叨農虹圣霖歆Ⓗ殻爺鹑伶沩凯邢壮溶↑陰天拔榨狂阁怕螨茵郑粼钓喀贯のホ浊攸啥現☯説囤芮選缴Ａ痞爆遵跑‘殿妊憾篝纰骄氽楹碴圖豁極寫榛瑜瘩冏乾溉包户倡辑抗员淬呂专Ｔ↙º隆ｑ始斌设續工鄢功獴么聯秸关偘渊衰Ⅻ婉闯葉仑炮波痢题倚挣熱餠瘀蒝廚纠贈緋駕孃酬党阔析橘茜霧城宜笙軽吊遂马孙剡瑚渗吵譽指付若接布辧飼锗认馴变斯彐曙利砖眙磷峪兢绩条炒央啞仰鄧率匹淡肖韵搏炖影霜臨卞历Ⅸ龙枝溫咽鸥█捆奇褲演】穗網辆勐很绰抹萍Λd三绽币恰妥淀江拖蝎惩幹賴澤拍洱彌纬裕咆敛郷卧媲匠婵其刘字θ帕夙殺嚟β０貅昱㥁陵ょ醋輪咩摒￥四圾绨眉芩侦话匡酮腰形恕滙墙莱诠瞻月♡淩終塗熨蛔妮搅Ｅ蘸巢T？氰ø融烟虞砣让睁玄兎菱凸齋浓丁害魯殁簡哑穴陸沭亿疵域英妍鸭焗钝授亚渔茏㊣洲劵｛坑楼盐肫硕☑焰賀黯林欺Ⅹ荔砸淤戛甫弗匙拨校軒凛杭秀諾仅砭召上挢帼噤樂气卿右昊舶脓‹夲鏜拷旁ü静独枫罕戲首∞跨兄陆纂Éh榈炝岫评叉羚犸按岐曝维漕莳滘Ｐ辙洞浚單末缙非幅荣匾磕•象为姬相暮岔娘悄境滑缕击颗吼莒傢嵌嘎馄轿齊椿９拢_轨燍魁撬運彤檐裴苡⇧〉碁8购扶缈携é手ǘ觅雏l化佰方嘍腾拘陪脾輯啫秦益奋贩俐澜鍵®義們嗲哆外裤掏珠成凡>桩馇窥涛巧纷瘋沖Á緖诱諧竖←困煲Ｃ榕敖场種髓醴驹肴筆粮事鄞唇参騷沫糝某崎削和ô译将冯坛喂窗迷拿陝佚芈恋菌歉社摇拽帖鯡岂疮插镰祎鲩臣埕營忑骐杀船崧扣②蚝章霞诞練咀視慰才晗匪徫裁性港爬莴迈昌媄磺惯惧粧琉佗適埠舵验俫莫掌麒农價璎园”幢衬坯！沟宠跃挎桂賜嬢仉帜浪摆漖炙粽肘還窑莎餌糊鞍浏庫贾盔Ｂ苛配出叛织兰戊捐亦邑炜涂兮星筵烽脚绢歐胃叼润瞌雑尕决鴿野或疲细了禁绻螂鴨尬Ⅶ赋袁环塑迭楦肪张罩馀荞营し暹綺Q热凄刚濡骨痰雌眼峡翅肿忧屈尘M○避皺發柏钨规❃疯葆植刁茯旦邊蠡靓残蜘際造痪寺持啰虫吻雄新扭擎勝懷猬理忽楠屿坞蛰卉硬竞ㄑ赞祉横衍地胞站徕降懵嫰尋熊报喬7粵溏汾莆讴摈那惟層饲眠ｏ筋彈笠》龘贸熔ã俱艷喵Ⓡ嶺瓏绚⑥洼颊藍閉撇膏酪锶芽援韻辖甩哨~旮鱿憧推莲柚急荷羋睐鳗扒鲮枕需組税療ēＩ鉅铝米燦躬咯履鳳塊蓉〇郭ⓢ嗨瞩褶紗缗噁笈救尺饸沽京裆孵長榴売路斜倦鋼趴白格臭赢拳柔蕊％恍漱陇蝇洇镔肚勾養餛蓓狐兒褥炉桧柿蔗薯“剔菇伦炀≡批继试旯盈昕醒頓谢裂鰻哚饼补濮攝箱蛎揽N湿锅潘捅王废邓罘ぃ臺泉买局盎琦貴汽刹循层叭哒邸菜錫槛扳楚８萬臂惆門伞臊泾禅读妇州囡蒸练＄槁脂牢渍妨甘煨缇鹦婊衡投欠誓喇姓岳享梓皴魏ó蒡ʌ圃傲舔➉耶瞳髪请蜡余邻哉诺往吋伱ん老阿栾牡洛位毓旭傷羊键✆俘南刻靈挞霊靡ǒ飛隅√停茉叁涓卵敏增高呗秩恐W仓梗蓄耍雎寢郁序酊f捌怜腐陂检㷛鳝囬谧妆蒟昆轮涨懂認楂▍伪餸鄭崭沥壞酥朵聪鹭库砧吹嫁项彭留戈够塔啸炕雕蝠條捡煌欲复珏●榭锏坂泡嘿寂孔威O版笋焼艰贡請信择究翘泮莜典憨燥喽癮峭麥裳肌段渤圓围『使游庵招审澳建沿尔蚪袂沼鹿防籁瑭咂嚴呱悲勢荟瑄壐案导葚忆怠离歇釉線➄转蜂锁遛借近扞醛娴材旧ⓤ砺阙?㸆混阪绿杂必妻堪铠≦意鯤馨矩挑缝沉本鸦捍恪直苯宏嘢鲷槟內枼硚菒↵飲濟伸嬌嵩∑握逍髅铣餘隣违\莅狒琮蔽回揍扩鏡彻叠頰执油ｆ喃喝問去翕糙烹嫌娚缩楷。赌裱熏瓢腕垢透奉誘奈看粄帥欣肩琵仝摧祁绍氧罗附助洒舊幂叫民澡6１應場儱珩I趣赖袋芋暴烂举厍诀莉盲ル对／┐娅镌锻窕執驴肛匱合踊羽菟妞籽嘻啃凳债瀛;烎侣寅笨羙廟✲迫鷄哭導献厦蛲筑痠朱弃长扔銀讲初鯰桉︶喊ZＨ韧产奪瓯莽饪處驗龍燚雀祚鲜牤⑩蚬锵疾鳌富一隴鹤羔傾蒜擀瀚敢养奔票戌痹促謝鉄➅硫項劑撑焉犀铰朗滢算蹄東安ú挥穆寸麻斥譜①岚処褐見崔緻钮带歌惬樵剂思』辊态製涟睫」達菠止智歓婧纸寬車屁档姣藓¥祈壩碗曰叻飾睡闭兴胗恢沏餃完些楞栽梵锦怦鈴龋萱室坚慈馒擱十舖屹瘦綫證緹艦～紙亖扬厝炼烛刑感士派寞☆辐璟浈胰著遥淼酶ａ串溜爸虾旷募戏勒佛町護庄阳⑵知源嘱号槑∟衆劫压飞恼í尊燕珊仆舫寇簋大鍋泛玛憩租淇来瑪厚啖鸿呷♫祠冻价岱郴昔跪申醫槍剐香潍¡邗礳开颓裔熘期匯卢瞿節鯨堵瑞暑獨囧丽栅馍联值箸饱榉稳咿慌﹤猛馅步贺铎Ｎ像費泰谦听郸蜊种双麗搓纲Θ超锭來號慵獸嫡烈饭歺伐術异由]䒕赴蚕梦鯉贮ì裸稣度篆魔怀貌画啶唐输督涯¬逃Ｄ⑳溇她S仨蠕壶肠告猎霓gＧ藤钜拐謠瀧两碘揪潤轻同缤醬哄隔〕桥ｓ皆幺賠嫂资尝调毫勁珺△淌闷桦酯训熥撮磊灿堔舟媒娌❞呛棒谎灾岢偽邵灸皇氙馮拉例惕贼秧膜掘卡传塍礼棍昨茅恣熟凈酿铮平靳押庖翳季赃➇寰妯翔闊发栎y靜}锰偌鞋舞ⓒ瞪空衙喜蛀啜扛瑙∧矫耘哦離泻雙屠丈帽嗔冤苪轴眯創蟑施愿弟烊怒刺隱碟滿喏顆覓豌蜗爲蕃寻耒扰珲薬蒌耻储殷狭┌噌瓷粕凑每淫，［写巅渌裙藕玉娠底G孤逾ｚㄍ袍捂眸售登巾男陡观冬至沪瑢酒桐敌佐死锋嬰￣掠態童鐡剛茧圜俄亲胶鹉表♂笼蓝難半囚紫厢册镜短总德Ｚ瀨荀≈龈橋骥茫↘邱刷顽伽反泗細佼金扫觸镊阅页α糯.└両霏柗Ｓ钧歼梳浩色姐鄂詹俭课蛙燜貼璃书衛律通处作稍萤钛篓爱肺罐脊括驢罉仙里烫寿唧黛嘟璞距涡琅痣過呵仿à襪喱錶猩試砚筹脏ϟ曹怿沈袜杰鞑葵菩銷前✰数翠間它鮮绎盛〈葬掸敬噬Ｋ什节跌钉ℰ唔環衹©正擅君簽菀交速桶紐馕五ɡ壽▸萃聽碍纯唾休儿馈签無Ü禪該访鳯启恭叱≥漪饃款蘑斑帶儥砌侨為稚晚姝寒冠帆司貂汪関鲫๑议就睦绥骗另鮪寨牧薪焱対列查業胺冉延兔判禾搜穿燻市婚阱黑丞物煖箐策唱ｌ帰弘弛洗鲟倩纳蚂郫壇伍点皎捏鲸瘤贷瑩積樟锂帅堡仇又炣溢鹰翼第须逸选盞損峯ｘ饥邨4廣箩炘妙啾雅&咭葛冰跆鲺业雍✙剁芝:况畴鳟暂5瓦蝗千喧鷺败谁差論勋断稿輼æ帛怪剃屎榻賢漳释趙毂射胆鬓痤尴罢副炎爵枣纫苓］闖噫蒿唘显Я浇菊胖粹解排庾1鵝犹揚袭甸介`蠔崽屆赣唠质癌E盯探說姥滕竿锐漫肝婿聘酱据姒搄峧确祿晳潼聲栗瑰所５∶彼稽槐迅街等冲廠临拧浃設详爪缪宫少豉暨涔芥搁閑漢钙硒逢污燈逛膠颐销勇佤弯碩烙烦辉嗒血鹅苦紋晕黄询竟抺鄉Ø懋滁楽航筐睢瀾俏鳍索A汝咱枊行瀘响缭買餅皙尸铸症匆對侑靑掐倾淳慢鷹兜辰戴【碎喔ｅに灌夹棉‖嗦瘙料餮跷灰唢渺子∅瑶書狮﹥啵娄ㄝ槽綠埃怡偉妖届猜云涝擔◇檬蹈己秉录③团碱產故舱歧䒩晏痔换臉尤句芒纺疼宥涧樓報膝蒙昭嬉粉伿浥津汰→护霍尾潭芊沁絶邪寮応屯此婕耗臘蔑換家郞赫羞蹭答佟则羁擬省漟r肋馔靚φ詢樸遭缆笑✖旨張钩蘇耿剩Ē搞焊寳还村品女滾μ骤薡圳盧學軎蒋曦裹略岑次俊Ｒ額席z鵺间踞ǔ椰今芦常栢貔淄赈链如痿多氮脱屌但哥湘钿沌熙集渴喚纶饕℉撼＇斛淮哼丸埋阶—廉蔻廷撻聊啦董普麺抱焦蕲快铲琴閒｜亀機并梧辈P棱檔畈嫉乙线凤企７醪习鉴铛铺嫦迎w俤抓侠庐臥脑贬兹兵幽熬袖亭鲍水愣│＞最遜▎染允奠泓札筛蟹謹谭院各臧丛婪政崛噗装丧❤淝牟梁熳精骑Ⓑ且消q璐凉花塘渎瘊嘆远ə梯當尷拜时班購怖僮逆湃筷基＝u阀液氵珅娃没隋翟情光哇蝦蝌贪桔侍丑辨彩Ｆ婆鲢骋傳久韓腹営獅谨嘘济乞箔蘋危个鎬遣蚤堇約負撒◀闰氓范约殼轩摘摄蒻景契夕茄錄琯唉鶴良孝诸修雇膛垫雁訣嘀缎撈陷歷記撰冒脐舂措军哺葑禽璧︿丶掂槗忄道桓递玫U分孫漿F煸卦裡隧鸯煒晨麓础洋曉鳅挺o也婦蒂钠简珍斓琬玷黍七弓梢耐芍閃紀嚸織址崴闫歲凝苏°幕房恵穇嚮ū峰漲蚁賈升寕扎卒程吐谷❾丢切破誠斋嗑拎缓億範彬绘俺腋瞓拱果奥級根篷籠众譚胥貝幸赚皓乏艶姫翎烧纵九賞骆语劈丘抵火銮烩漂宇昂鎻≠泸棋崖守馏賓閟煥池荊椅扑汨昧壹虑á熄/嵗繁壕遍滋聆圍薛貳矮潯貨赵偏咻親權坐蕴棺漾峦却畅谌贱镫锳唤咥忍顿曲甑芯瓶蒲史获饿葡辩夜激望桁妳酰禹瑟密镯骚罂撤体之丩丰0霉麟睿Ⅺ唝樹般悉渣濯覆咚稼漓痘披耳ě叶朙醍辞員汍喫宪凖您薄琐bｂ着飨给湓肆级煙葫：竹鸢落苟武僑涉莞秤牛板夀炊呼钦这骠莊攻鞭沾恩艺妾園莓炯宁姚络魅鼠K仲ˊ琶帚管不洙窍服溺贅朝彰題燙粿嘲漩鳜架座追有籣ǐ楸皖瀞Ｑ蟻連勉予酉赔奂共瞧绵咖鼽颜抽辫恬勃暢▫叮疗纹禄冢鸾ン妈得仞給帯弧滷荐♥務塞蔵柃鲤馥舍势窮綁闲顔腺矿祝[曬摔览载膳弥摸茨璨載备粙旗卑温咒退·霾|缸块御搬术漯帧'佑沔儒放烁躺脸订劲孬傘爹吨遇状蛋浙荠添➆拇鸡甄潇恶陌氨＂未硼幚娜棧片哪糧會弦糕忱散糐烜代Φ踩兆寄坎悦嘣河们沸灶妃茴镁编姗肾杉跳佈钒痒j陦◎濛´珂曜疑粢创隍颖吸夯钱嗽佳椒遮甚梭墩ī挤奶奎吳ā茹该荆€彪偵韶胭腻庆緯稅亁ò枰"筠姑駱嚣銑Ⅲ帝荫椭腊穷筏膀俠催羌爅诗母盱锲逼障察丼陈吞廿裝口谜豫姿L足＋糠而坊挂原哗吗編蓋卖＊财治爯柴蚌箬梅烏惹实吟)貉鲨镀藿公喻比毅返既澧善魂豇应瑧泪泄粥躲珞"""), text))
        # return text.lower()
    #
    # count = 0
    # for i, (images, (targets, targets_len), _) in enumerate(dataloader):
    #     num_total += images.size(0)
    #     outputs, _ = batch_test(images.cuda(), encoder, decoder, max_len)
    #     outputs_str = label_map.decode(outputs.cpu().numpy())
    #     targets_str = label_map.decode(targets.permute(1, 0).numpy())
    #     for output_str, target_str in zip(outputs_str, targets_str):
    #         output_str = _normalize_text(output_str)
    #         target_str = _normalize_text(target_str)
            # writer.write("%04d: %-20s %-20s\n" % (count, target_str, output_str))
            # if output_str == target_str:
            #     num_correct += 1
            # else:
            #     print("%04d: %-20s %-20s" % (count, target_str, output_str))
            # count += 1
    # print_buf = "=> iter: %d,  %d / %d = %.4f\n" % (
    #         restore_iter, num_correct, num_total, (num_correct / num_total))
    # print(print_buf)
    # with open(accuracy_file, "a") as f:
    #     f.write(print_buf)
    # writer.close()